[{"date": " 03 Dec 2015", "content": "Dec 03, 2015, 10.55 AM  | Source: Moneycontrol.com\nApollo Tyres' production disrupt due to heavy rains in Chennai\nApollo Tyres Ltd has informed BSE that the production operations of the Company's plant located at Oragadam, Tamil Nadu have been disrupted due to flooding at the factory premises caused by heavy rains in Chennai.\nLike this story, share it with millions of investors on M3\nApollo Tyres production disrupt due to heavy rains in Chennai\nApollo Tyres Ltd has informed BSE that the production operations of the Company's plant located at Oragadam, Tamil Nadu have been disrupted due to flooding at the factory premises caused by heavy rains in Chennai.\nPost your opinion here\n \nApollo Tyres Ltd has informed BSE that the production operations of the Company's plant located at Oragadam, Tamil Nadu have been disrupted due to flooding at the factory premises caused by heavy rains in Chennai.The production was disrupted in 3 shifts till December 02, 2015. The production loss due to this natural calamity is 450 MT (approximately).The natural calamity is adequately covered under the Insurance Policy of the Company.Source : BSE\n", "title": "Apollo Tyres' production disrupt due to heavy rains in Chennai", "link": "http://www.moneycontrol.com/news/announcements/apollo-tyres-production-disrupt-due-to-heavy-rainschennai_4437861.html", "time": "10.55 am "}, {"date": " 18 Nov 2015", "content": "Nov 18, 2015, 11.28 AM  | Source: CNBC-TV18\nSuper Six short term picks for November 18\nGaurav Bissa of LKP Securities is of the view that one may buy Oil and Natural Gas Corporation with a target of Rs 240.\nLike this story, share it with millions of investors on M3\nSuper Six short term picks for November 18\nGaurav Bissa of LKP Securities is of the view that one may buy Oil and Natural Gas Corporation with a target of Rs 240.\nPost your opinion here\n08:00 am\nOn CNBC-TV18's show Super Six, market gurus Rajat Bose, Gaurav Ratnaparkhi and Gaurav Bissa, place their bets on two stocks each, thus offering investors a variety of options to choose from. Investors can read into the detailed analysis before agreeing to any or all the bets.\nRajat Bose of rajatkbose.com\nThe first stock that I would like to recommend is Vedanta . Yesterday, it performed very well with a lot of volume activity, closed around Rs 92. This stock is headed for higher levels, at least I am expecting Rs 94.20 which is my first target and the next target is Rs 95.80, put a stoploss below Rs 90.\nSecond stock which I am going to recommend is Apollo Tyres . Yesterday, Tyre stocks did well and Apollo Tyres is recovering from a lower level of completing its downside correction. It is headed for levels of Rs 165-166 which is my target range for the day and put a stop loss below Rs 160.\nGaurav Ratnaparkhi of Sharekhan\nI have a buy call on Bharti Infratel . The stock has formed a short-term correction in last few weeks. In terms of Fibonacci retracement, it has retraced nearly 78.6 percent of the previous rise which was an impulse on the upside. And to end the correction, the stock has formed an ending diagonal pattern on the daily chart and has broken out on the upside in the last session. So, I have a buy call on Bharti Infratel with stoploss of Rs 376 and target will be Rs 410.\nI have a buy call on India Cements . The stock has been consolidating near its crucial weekly moving averages for the last few weeks. The consolidation has taken form of a bullish flag pattern on the daily chart. The pattern is on the verge of a breakout on the upside. So, the stock has decent upside potential from current level and from trading perspective, stop loss can be placed at Rs 79-50 and the target will be Rs 88.80.\nGaurav Bissa of LKP Securities\nMy first recommendation today is a buy call on Oil and Natural Gas Corporation (ONGC). The stock after witnessing decent amount of corrections seems to be forming short-term base formation around Rs 225-227 kind of levels. I recommend going long for a target price of Rs 240 keeping the stop loss at Rs 227.\nMy second recommendation today is a sell call on Hindustan Petroleum Corporation (HPCL). The stock has seen consistent long unwinding. Fresh shorts yet to be seen, but then again, the fact that the long unwinding from the levels of Rs 795-800 are seen, indicates that the Rs 795-800 would act as a strong resistance for this stock going ahead. I recommend going short on HPCL for targets of Rs 740 keeping a stoploss at Rs 790.\n", "title": "Super Six short term picks for November 18", "link": "http://www.moneycontrol.com/news/stocksviews/super-six-short-term-picks-for-november-18_4208721.html", "time": "10.09 am "}, {"date": " 17 Nov 2015", "content": "Nov 17, 2015, 02.05 PM  | Source: Moneycontrol.com\nApollo Tyres extends gains on acquisition of German company\nThe company's one of the promoters - Sunrays Properties & Investment Company has released pledge on its 33.82 lakh shares on November 10.\nLike this story, share it with millions of investors on M3\nApollo Tyres extends gains on acquisition of German company\nThe company's one of the promoters - Sunrays Properties & Investment Company has released pledge on its 33.82 lakh shares on November 10.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of Apollo Tyres gained another 3.2 percent intraday Tuesday, in addition to 1.7 percent upside in previous session after acquisition of Germany-based tyre company.\nOn Monday, it said wholly owned subsidiary would acquire Reifencom GmbH for 45.6 million euro in all cash deal and this deal is likely to be completed in 1-3 months.\nReifencom has turnover of 147 million euro in 2014 and has presence in Germany, Austria, Switzerland, Italy, France & Denmark.\nAdditionally, Sunrays Properties & Investment Company, one of the company's promoters, has released pledge on its 33.82 lakh shares on November 10.\nSunrays has 7.02 percent (3.57 crore shares) shareholding in the company as of today, out of which 2.35 percent (1.19 crore shares) stake has been pledged with Bajaj Finance after release of shares.\nAt 13:40 hours IST, the scrip of Apollo Tyres was quoting at Rs 161.50, up Rs 3.80, or 2.41 percent on the BSE.\nPosted by Sunil Shankar Matkar\n", "title": "Apollo Tyres extends gains on acquisition of German company", "link": "http://www.moneycontrol.com/news/buzzingstocks/apollo-tyres-extends-gainsacquisitiongerman-company_4193161.html", "time": "2.05 pm "}, {"date": " 17 Nov 2015", "content": "Nov 17, 2015, 10.01 AM  | Source: CNBC-TV18\nSuper Six chart picks for today\nGaurav Ratnaparkhi of Sharekhan is of the view that one may buy Larsen and Toubro (L&T) with a target of Rs 1435.\nLike this story, share it with millions of investors on M3\nSuper Six chart picks for today\nGaurav Ratnaparkhi of Sharekhan is of the view that one may buy Larsen and Toubro (L&T) with a target of Rs 1435.\nPost your opinion here\n08:00 am\nOn CNBC-TV18's show Super Six, market gurus Rajat Bose, Gaurav Ratnaparkhi and Gaurav Bissa, place their bets on two stocks each, thus offering investors a variety of options to choose from. Investors can read into the detailed analysis before agreeing to any or all the bets.\nRajat Bose of rajatkbose.com\nMy first stock is Apollo Hospital . Buy it, stop loss below Rs 1,265, target is Rs 1,293 and Rs 1,304. This stock has given a probable short-term bottom reversal formation and it has also shown considerably large volume activity in the last couple of hours, in the last session.\nMy second stock is Bank of Baroda (BoB). This too is a buy. Put your stop below Rs 171.80 and keep your targets at Rs 183 and Rs 187. This stock too showed good strength on both hourly and the daily charts and it has crossed 200 days exponential moving average on both the charts.\nGaurav Ratnaparkhi of Sharekhan\nI have a buy call on Larsen and Toubro (L&T). It has fallen significantly in last few weeks. However the pace of decline has decreased in last few sessions the same is evident from the daily momentum indicator as well as it is showing positive divergence and has triggered a fresh buy signal, overall this is a good opportunity to initiate fresh long position from short-term perspective. The stop loss can be placed at Rs 1,326 and target will be Rs 1,435.\nIn last few weeks, Ceat has fallen considerably from its weekly upper Bollinger band towards its crucial weekly moving averages. The moving averages are now acting as a cushion for the counter. The stock has formed a short-term base near these moving averages. On the hourly charts, it has formed an inverted head and shoulders pattern and has broken out on the upside. So pullback looks around the corner and one can buy the stock with stop loss of Rs 958 and the target will be Rs 1,050.\nGaurav Bissa of LKP Securities\nMy first recommendation today is buy on Glenmark Pharma . This stock after witnessing decent amount of correction which was led by fresh shorts, long unwinding has now seen some amount of short covering. All in all the stock is very cleverly positioned, one can buy this stock for a target price of Rs 1,000, keeping the stop loss at Rs 940.\nMy second recommendation is a buy on Apollo Tyres . The stock has seen good amount of correction from levels of Rs 195-200 to about Rs 155. Fresh shorts were seen getting built however, after small amount of short covering, fresh longs are seen getting built. All in all, it augurs well for the stock, one can buy the stock for target Rs 170 keeping the stop loss at around Rs 152.\n", "title": "Super Six chart picks for today", "link": "http://www.moneycontrol.com/news/stocksviews/super-six-chart-picks-for-today_4181301.html", "time": "8.55 am "}, {"date": " 16 Nov 2015", "content": "Nov 16, 2015, 09.48 PM  | Source: Moneycontrol.com\nApollo Tyres: Outcome of board meeting\nApollo Tyres in its meeting held on November 16, 2015, have transacted the business approved the shorter notice of the Meeting. Approved the Acquisition of Reifencom GmbH through a wholly owned subsidiary of the Company.\nLike this story, share it with millions of investors on M3\nApollo Tyres: Outcome of board meeting\nApollo Tyres in its meeting held on November 16, 2015, have transacted the business approved the shorter notice of the Meeting. Approved the Acquisition of Reifencom GmbH through a wholly owned subsidiary of the Company.\nPost your opinion here\n \nApollo Tyres Ltd has informed BSE that the Board of Directors of the Company at its meeting held on November 16, 2015, inter alia, have transacted the following business:1. Approved the shorter notice of the Meeting.2. Approved the Acquisition of Reifencom GmbH through a wholly owned subsidiary of the Company.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Apollo Tyres: Outcome of board meeting", "link": "http://www.moneycontrol.com/news/announcements/apollo-tyres-outcomeboard-meeting_4179241.html", "time": "9.48 pm "}, {"date": " 16 Nov 2015", "content": "Nov 16, 2015, 01.47 PM  | Source: Moneycontrol.com\nApollo Tyres gains 3%, to buy German co for euro 45.6 mn\nReifencom has turnover of 147 million euro in 2014 and has presence in Germany, Austria, Switzerland, Italy, France & Denmark.\nLike this story, share it with millions of investors on M3\nApollo Tyres gains 3%, to buy German co for euro 45.6 mn\nReifencom has turnover of 147 million euro in 2014 and has presence in Germany, Austria, Switzerland, Italy, France & Denmark.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of Apollo Tyres climbed 3.4 percent intraday Monday as India's second-largest tyre manufacturer will buy German-based tyre retail and distribution company.\nThe company said its wholly owned subsidiary will acquire Reifencom GmbH for 45.6 million euro in all cash deal, adding this deal is likely to be completed in 1-3 months.\nReifencom has turnover of 147 million euro in 2014 and has presence in Germany, Austria, Switzerland, Italy, France & Denmark.\n\"Acquisition will enable Apollo to improve its mix of distribution channels in Germany & Europe and aid in increasing visibility of Apollo and Vredestein tyres in the offline and especially the fast growing online retail space,\" Neeraj Kanwar, vice chairman and managing director said.\nMeanwhile, Apollo Tyres' July-September quarter consolidated profit increased 8.06 percent year-on-year to Rs 278.74 crore but revenue declined to Rs 2,979.98 crore in Q2FY16 from Rs 3,331.41 crore in same period of previous fiscal. Delayed onset of winters in Europe, resulted in lesser than expected sales and pre-orders for winter tyres, adversely impacted company's European operations.\nAt 12:37 hours IST, the scrip of Apollo Tyres was quoting at Rs 159.20, up Rs 4.10, or 2.64 percent on the BSE.\nPosted by Sunil Shankar Matkar\n", "title": "Apollo Tyres gains 3%, to buy German co for euro 45.6 mn", "link": "http://www.moneycontrol.com/news/buzzingstocks/apollo-tyres-gains-3-to-buy-german-co-for-euro-456-mn_4161061.html", "time": "12.53 pm "}]