[[{"date": " 16 Dec 2015", "content": "Dec 17, 2015, 09.22 AM  | Source: PTI\nDilip Shanghvi to make open offer to buy 26% Suzlon stake\nThe offer, that would begin on December 28 and close on January 8, 2016, comes after Shanghvi decided to acquire 23 percent stake in Suzlon with an equity investment of Rs 1,800 crore. The deal was announced earlier this year.\nLike this story, share it with millions of investors on M3\nDilip Shanghvi to make open offer to buy 26% Suzlon stake\nThe offer, that would begin on December 28 and close on January 8, 2016, comes after Shanghvi decided to acquire 23 percent stake in Suzlon with an equity investment of Rs 1,800 crore. The deal was announced earlier this year.\nPost your opinion here\n \nBillionaire Dilip Shanghvi- controlled entities along with promoters of Suzlon will make an open offer worth Rs 2,837 crore to acquire 26 percent stake in the wind turbine maker.\nThe offer, that would begin on December 28 and close on January 8, 2016, comes after Shanghvi decided to acquire 23 percent stake in Suzlon with an equity investment of Rs 1,800 crore. The deal was announced earlier this year.\nShanghvi-controlled entities along with Tulsi Tanti and other promoters of Suzlon would make the open offer to the shareholders for purchasing more than 157.64 crore shares, according to a filing to the BSE.\n\"... with the acquirers, to the public shareholders of Suzlon Energy Ltd for acquisition of upto 157,64,38,113 equity shares of face value of Rs 2 each at a price of Rs 18 per fully paid up equity share,\" Suzlon has informed BSE today.\nIndusInd Bank Ltd is the manager to the open offer. According to the sources, there was an understanding between Tanti and Shanghvi that the former would have absolute control over the company and latter's shareholding will remain below Tanti's holding. \nIndusInd Bank stock price\nOn December 18, 2015, at  11:54 hrs IndusInd Bank was quoting at Rs 938.75, down Rs 10.45, or 1.1 percent. The 52-week high of the share was Rs 988.50 and the 52-week low was Rs 752.60.\nThe company's trailing 12-month (TTM) EPS was at Rs 34.15 per share as per the quarter ended September 2015. The stock's price-to-earnings (P/E) ratio was 27.49. The latest book value of the company is Rs 173.57 per share. At current value, the price-to-book value of the company is 5.41.\n", "title": "Dilip Shanghvi to make open offer to buy 26% Suzlon stake", "link": "http://www.moneycontrol.com/news/business/dilip-shanghvi-to-make-open-offer-to-buy-26-suzlon-stake_4613721.html", "time": "9.25 pm "}, {"date": " 19 Nov 2015", "content": "Nov 19, 2015, 09.54 AM  | Source: CNBC-TV18\nStocks in news: Amtek Auto, Hero Moto, Religare, Intellect\nCoal India | Hero Motocorp | Ramco Systems | Aurobindo Pharma | Adani Ports | Simbhaoli Sugar and Intellect Design are stocks, which are in the news today.\nLike this story, share it with millions of investors on M3\nStocks in news: Amtek Auto, Hero Moto, Religare, Intellect\nCoal India | Hero Motocorp | Ramco Systems | Aurobindo Pharma | Adani Ports | Simbhaoli Sugar and Intellect Design are stocks, which are in the news today.\nPost your opinion here\nHere are stocks that are in news today:\nReligare Enterprises says Invesco to up stake in Religare Invesco AMC to 100 percent\nAlert: Religare Enterprises currently holds 51 percent stake and Invesco holds 49 percent stake in Religare Invesco AMC\nMphasis decentralises decision making to ride digital wave: ET\n-To give greater control of delivery to executives placed on-ground\nIndian Sugar Mills Association says\n-Welcome government decision to give Rs 4.50 per quintal of sugarcane crushed in sugar year 2016\n-Sugarcane subsidy will work out to be Rs 1,100 crore for sugar year 2016\n-Industry & farmers may seek further help if sugar prices do not improve\nParag Milk Foods Chairman Devendra Shah says\n-To market 'Go Almette' product in association with Hochland Group\n-Happy to launch 'Go Almette' in Mumbai, will soon launch in other metros\n-Partnership will build on 'Go' brands innovation approach\n-Have filed DRHP with SEBI for an IPO, awaiting approval\n-Have confidence about retail participation in the IPO\n-Will use IPO proceeds for expansion & growth\nOther stocks and sectors that are in news today:\n-Amtek may get Rs 6,000 crore from Tekfor sale: BS ( Amtek Auto may be in focus)\n- Glenmark Pharma , Sun Pharma , Cipla amongst companies exploring bids for a portfolio of Teva’s US Generic products: Wires\n- Suzlon Energy to issue 1.55 crore shares to 4000 convertible bonds\n- Jindal Stainless aims to cuts its Rs 8,580 crore debt by 64 percent through operational and financial restructuring: BS\n- Cairn India cuts capex by 40 percent on lower crude prices\n- Coal India unions oppose 10 percent stake sale in company: PTI\n-Aviation ministry extends deadline for stakeholder response on draft policy to November 30\n- Hero MotoCorp says retail sales crossed record 10 lakh units in festive season, up 11 percent (YoY)\n- Ramco Systems says ARSA endorses company as preferred next-gen MRO IT vendor\n- Intellect SEEC launches digital distribution suite for UK life & pension markets\n-Cabinet approves uniform gas marketing margin for supply to urea, LPG units\n- Aurobindo Pharma seeks shareholders' nod for issue of securities up to USD 600 million\n- Adani Ports : promoters create pledge on 1.6 crore shares on November 16\n- Simbhaoli Sugar says trading suspended w.e.f. November 24 on Simbhaoli Spirits-company merger\n-Cabinet secretary reviews prices & availability of essential commodities\n", "title": "Stocks in news: Amtek Auto, Hero Moto, Religare, Intellect", "link": "http://www.moneycontrol.com/news/stocksnews/stocksnews-amtek-auto-hero-moto-religare-intellect_4230121.html", "time": "8.22 am "}, {"date": " 18 Nov 2015", "content": "Nov 18, 2015, 10.37 PM  | Source: PTI\nSuzlon issues 1.55 cr shares for bonds worth $546.91 mn\nThe Securities Issue Committee of the Board of Directors today approved allotment of 1,55,82,147 equity shares of Rs 2 each, on conversion of 4,000 USD 546,916,000 Step-up Convertible Bonds due July 2019 of USD 1,000 each\nLike this story, share it with millions of investors on M3\nSuzlon issues 1.55 cr shares for bonds worth $546.91 mn\nThe Securities Issue Committee of the Board of Directors today approved allotment of 1,55,82,147 equity shares of Rs 2 each, on conversion of 4,000 USD 546,916,000 Step-up Convertible Bonds due July 2019 of USD 1,000 each\nPost your opinion here\n \nSuzlon Energy today said that it has issued 1.55 crore equity shares on conversion of 4,000 bonds worth USD 546.91 million.\n\"The Securities Issue Committee of the Board of Directors today approved allotment of 1,55,82,147 equity shares of Rs 2 each, on conversion of 4,000 USD 546,916,000 Step-up Convertible Bonds due July 2019 of USD 1,000 each\", Suzlon Energy Ltd has informed BSE.\nAccording to the statement, bonds are converted into equity shares at a price of Rs 15.46 per equity share with a fixed rate of exchange on conversion of Rs 60.225 to USD one in terms of Information Memorandum dated June 17, 2014.\nThis is done pursuant to the conversion notices received from certain bondholders of the USD 546,916,000 step-up Convertible Bonds due July 2019.\nPost aforesaid allotment, the paid-up capital of the company is Rs 997,83,51,018 divided into 498,91,75,509 equity shares of Rs 2 each.\nSuzlon Energy stock price\nOn December 18, 2015, at  11:55 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon issues 1.55 cr shares for bonds worth $546.91 mn", "link": "http://www.moneycontrol.com/news/business/suzlon-issues-155-cr-shares-for-bonds-worth-3654691-mn_4222161.html", "time": "10.37 pm "}, {"date": " 30 Oct 2015", "content": "Oct 31, 2015, 03.36 PM  | Source: PTI\nSuzlon reports Q2 loss of Rs 181 crore\n\"The group has posted a loss after share in minority interest of Rs 181.10 crore for the quarter ended September 30, 2015 as compared to net loss of Rs 656.21 crore for the quarter ended September 30, 2014,\" the company said in a BSE filing.\nLike this story, share it with millions of investors on M3\nSuzlon reports Q2 loss of Rs 181 crore\n\"The group has posted a loss after share in minority interest of Rs 181.10 crore for the quarter ended September 30, 2015 as compared to net loss of Rs 656.21 crore for the quarter ended September 30, 2014,\" the company said in a BSE filing.\nPost your opinion here\n \nSuzlon Energy Ltd today reported a consolidated loss of Rs 181.10 crore for the quarter ended September 30, 2015.\n\"The group has posted a loss after share in minority interest of Rs 181.10 crore for the quarter ended September 30, 2015 as compared to net loss of Rs 656.21 crore for the quarter ended September 30, 2014,\" the company said in a BSE filing.\nAccording to the statement, on January 22, 2015, AE Rotor Holding B.V., a step-down wholly owned subsidiary of the company, and its subsidiaries signed a binding agreement with Centerbridge Partners LP, USA to sell 100 per cent stake in Senvion SE.\nThe deal, which was subject to customary conditions, concluded on April 29, 2015 and therefore consolidated financial results of Senvion SE and its subsidiaries for the month of April 2015 have been considered for consolidation.\nAccordingly, the consolidated financial results for the quarter and half year ended September 30, 2015 are not comparable with the prior period, it said. As per the statement, the consolidated total income of the company increased to Rs 5,391.76 crore for the quarter under review from Rs 1,796.39 crore in the year-ago period.\nSuzlon Group Chairman Tulsi Tanti said, \"We continue to deliver on our sustainable growth and priorities outlined for FY16. We have efficiently capitalised on the opportunities in India. Government's thrust on clean energy supported by conducive policy actions has stimulated demand for renewables in India.\"\nSuzlon Group Chief Financial Officer (CFO) Kirti Vagadia said, \"We continue to demonstrate solid operating performance in Q2 FY16 with steadily increasing volumes and improved normalised EBITDA margins of 18 per cent.\" \"Our strong order book of Rs 6,812 crore gives us a clear visibility going forward.\nWe continue to control our fixed cost and net working capital in a disciplined manner. \"The significant improvement in our credit rating to investment grade has been a huge credibility booster to all our stakeholders,\" Vagadia added.\n", "title": "Suzlon reports Q2 loss of Rs 181 crore", "link": "http://www.moneycontrol.com/news/results/suzlon-reports-q2-lossrs-181-crore_3890181.html", "time": "8.48 pm "}, {"date": " 01 Aug 2015", "content": "Aug 01, 2015, 06.24 PM  | Source: PTI\nSuzlon posts Q1 net profit of Rs 1,047 cr\nThe company's total income was 2,627.71 crore in the quarter ended on June 30, 2015, compared to Rs 4,671.99 crore in the year ago period.\nLike this story, share it with millions of investors on M3\nSuzlon posts Q1 net profit of Rs 1,047 cr\nThe company's total income was 2,627.71 crore in the quarter ended on June 30, 2015, compared to Rs 4,671.99 crore in the year ago period.\nPost your opinion here\n \nWind turbine maker Suzlon Energy Ltd posted consolidated net profit of Rs 1,047.41 crore for the quarter ended on June 30. It had reported net loss of Rs 750.74 crore in the quarter ended on June 30, 2014, the Suzlon Energy Ltd in BSE filing.\nThe company's total income was 2,627.71 crore in the quarter ended on June 30, 2015, compared to Rs 4,671.99 crore in the year ago period.\nThe company said its consolidated net Debt (excluding Foreign currency convertible bonds) was down to Rs 7,010 crore from Rs 14,821 crore as of 31st March 2015.\nIt has also said that it has brought down interest cost down by 36 per cent quarter-on-quarter. The financial results for the first quarter of 2015-16 fiscal were approved by the board of directors of the company in its meeting held today.\nThe board also approved the proposal to issue securities (bonds) to the extent of Rs 5,000 crores subject to shareholders' approval. Suzlon Group Chairman Tulsi Tanti said: \"Our Q1 performance reflects our turnaround journey. Our strategic vision incorporates the government's renewable energy target of 175 GW by 2022 and the conducive policy landscape. This year, we expect to supply 100 turbines of the S111.\"\nThe board also approved appointment of Kirti J Vagadia as Group CFO with effect from August 1, 2015 and acceptance of resignation of Amit Agarwal as the CFO of the Company.\nThe proposal for formulation of Employee Stock Option Plan 2015 (the \"ESOP 2015\") of the Company for the employees of the Company and its subsidiaries, was also approved. Besides, the variation in the terms of Special Employee Stock Option Plan 2014 (the \"Special ESOP 2014\") of the Company by extending the exercise period by 2 (Two) years was also cleared by the Board.\nThe company scrip closed flat at Rs 21.90 on the BSE.\n", "title": "Suzlon posts Q1 net profit of Rs 1,047 cr", "link": "http://www.moneycontrol.com/news/results/suzlon-posts-q1-net-profitrs-1047-cr_2270161.html", "time": "2.06 pm "}], [{"date": " 12 Oct 2015", "content": "Oct 12, 2015, 12.25 PM  | Source: PTI\nSuzlon commissions of 50.40 MW wind power project\nThe project comprising of 24 WTGs (Wind Turbine Generators) of 2.1 MW each, is located in Tejuva, Jaisalmer, Rajasthan. \"It forms an integral part of Suzlon's Jaisalmer wind park, billed to be the country's largest wind park with a cumulative capacity over 1300 MW,\" it added.\nLike this story, share it with millions of investors on M3\nSuzlon commissions of 50.40 MW wind power project\nThe project comprising of 24 WTGs (Wind Turbine Generators) of 2.1 MW each, is located in Tejuva, Jaisalmer, Rajasthan. \"It forms an integral part of Suzlon's Jaisalmer wind park, billed to be the country's largest wind park with a cumulative capacity over 1300 MW,\" it added.\nPost your opinion here\n \nWind turbine maker Suzlon Group on Monday said it has completed commissioning of 50.40 mega watt (MW) wind power turnkey project for Ostro Energy Pvt Ltd which is owned by Actis.\n\"Suzlon has been responsible for the entire project lifecycle, from development, construction to commissioning and has also been contracted to undertake operations and maintenance services of the project for 12 years... \"The project will provide electricity to over 28,000 homes and curb 0.10 million tonnes of CO2 emissions annually,\" the company said in a BSE filing.\nThe project comprising of 24 WTGs (Wind Turbine Generators) of 2.1 MW each, is located in Tejuva, Jaisalmer, Rajasthan. \"It forms an integral part of Suzlon's Jaisalmer wind park, billed to be the country's largest wind park with a cumulative capacity over 1300 MW,\" it added.\nShares of Suzlon were trading at Rs 24.30 apiece, up 1.46 percent, from their previous close on the BSE.\nSuzlon Energy stock price\nOn December 18, 2015, at  11:56 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon commissions of 50.40 MW wind power project", "link": "http://www.moneycontrol.com/news/business/suzlon-commissions5040-mw-wind-power-project_3541501.html", "time": "12.25 pm "}, {"date": " 12 Oct 2015", "content": "Oct 12, 2015, 09.39 AM  | Source: Moneycontrol.com\nSuzlon commissions 50.40 MW wind power project for Ostro Energy\nSuzlon Group has completed the commissioning of 50.40 MW wind power turnkey project for Ostro Energy Pvt Ltd. The project will provide electricity to over 28,000 homes and curb 0.10 million tonnes of CO2 emissions annually.\nLike this story, share it with millions of investors on M3\nSuzlon commissions 50.40 MW wind power project for Ostro Energy\nSuzlon Group has completed the commissioning of 50.40 MW wind power turnkey project for Ostro Energy Pvt Ltd. The project will provide electricity to over 28,000 homes and curb 0.10 million tonnes of CO2 emissions annually.\nPost your opinion here\n \nSuzlon Energy Ltd has submitted to BSE a copy of Press Release dated October 12, 2015 titled ''Suzlon commissions 50.40 MW wind power project for Ostro Energy\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon commissions 50.40 MW wind power project for Ostro Energy", "link": "http://www.moneycontrol.com/news/announcements/suzlon-commissions-5040-mw-wind-power-project-for-ostro-energy_3538861.html", "time": "9.39 am "}, {"date": " 09 Oct 2015", "content": "Oct 09, 2015, 01.32 PM  | Source: CNBC-TV18\nTop buzzing midcap stocks to trade on October 9\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have Transport Corporation of India (TCI), Hindustan Zinc, United Spirits, Suzlon Energy, ELGI Equipments, Genesys International Corp & ICICI Bank.\nLike this story, share it with millions of investors on M3\nTop buzzing midcap stocks to trade on October 9\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have Transport Corporation of India (TCI), Hindustan Zinc, United Spirits, Suzlon Energy, ELGI Equipments, Genesys International Corp & ICICI Bank.\nPost your opinion here\n", "title": "Top buzzing midcap stocks to trade on October 9", "link": "http://www.moneycontrol.com/news/stocksviews/top-buzzing-midcap-stocks-to-tradeoctober-9_3505701.html", "time": "1.32 pm "}, {"date": " 09 Oct 2015", "content": "Home » News » Stocks to Watch\nOct 09, 2015, 11.17 AM  | Source: CNBC-TV18\nHere's why DLF, Future Group and Suzlon in top 10 Stocks\nStocks in news are: DLF, Future Group, Patanjali Group, Future Retail, Suzlon Energy, TCI Industries, Hindalco  Industries, Vedanta, 8K Miles Software Services, Elgi Equipments, ICICI Bank.\nLike this story, share it with millions of investors on M3\nHeres why DLF, Future Group and Suzlon in top 10 Stocks\nStocks in news are: DLF, Future Group, Patanjali Group, Future Retail, Suzlon Energy, TCI Industries, Hindalco  Industries, Vedanta, 8K Miles Software Services, Elgi Equipments, ICICI Bank.\nPost your opinion here\n \nPromoters of DLF Ltd, India’s largest developer by market value, will sell their 40 percent stake in a subsidiary that owns many of the company’s rent-generating assets and a few land assets to institutional, third-party investors, the company said on Thursday. The move facilitates the monetizing of the company’s rental assets through a stake sale to private equity investors or a Real Estate Investment Trust (REIT), and will also effectively reduce the debt on DLF’s books. An audit committee, after reviewing and evaluating many options to drive long-term growth of the rental business and avoid potential conflict of interest between the promoters and the company in relation to the rental business, recommended that the promoters sell their shareholding in the subsidiary DLF Cyber City Developers Ltd (DCCDL) to other institutional investors. With this, DLF promoter companies Rajdhani Investments and Agencies Pvt. Ltd, Buland Consultants and Investments Pvt. Ltd and Sidhant Housing and Development Company, which hold 40 percent equity shareholding in DCCDL will sell their stake to private equity (PE) investors. DLF Ltd will continue to hold its 60 percent stake in DCCDL. DLF promoters have a March 2016 deadline to convert their compulsorily convertible preference shares in the subsidiary DCCDL into equity shares. DLF didn’t disclose the capital it would raise through this exercise although agency cited people whom it didn’t name as saying that it would be between Rs.12,000 crore and Rs.14,000 crore.\nFuture Group to exclusively tie up with Patanjali Group tomorrow. Patanjali products will be exclusively sold in Group's stores. Retail distribution via Future Retail, Future Consumer Enterprise. Future Consumer's retail & distribution via Nilgiris, KB's & Aadhaar. Future Retail 's retail & distribution via Food Bazaar, Foodhall & Big Bazaar. Future Group will add huge customer base due to Patanjali brand.\nSuzlon gets assigned investment grade for first time in 5 years. CARE ratings assigns 'CARE BBB-' credit rating. CARE assigns Investment Grade Rating. Rating assigned for Suzlon's long-term bank facilities. Working cap limits worth Rs 4,936 crore. Rating of 'CARE A3' assigned for Suzlon's non-fund based working capital. Rating will be valid till September 2016. As on March 31, Group had a debt of Rs 17,810 crore.\nTCI Considering demerger of express delivery solutions business. Demerger from XPS business, Scheme of Arrangement: 1 share of TCI Express for 2 shares of company. Residual business post: supply chain division, freight business & shipping business. Value unlocking exercise, Company trades at a PE of 16x FY17e.\nHindalco and Vedanta : Alcoa third quarter below estimate, Lower aluminum prices. Aloca's Unfavorable currency effects. Alcoa stock dropped about 5 percent in extended trading. Thomson Reuters had projected 13 cents/share on USD 5.65 billion revenue. Earnings below street estimates. Revenue down by 11 percent at USD 5.57 billion. Profit at USD 44 million. EPS of 2 cents/share. Net income at USD 109 million and EPS 7 cents/share.\n8K miles sees strong second quarter. 8k miles provides cloud solutions. Continues to report over 100 percent growth in profit & revenues. Total income up by 21 perent at Rs 61.09 crore versus Rs 50.63 crore. EBITDA at Rs 21.15 crore versus Rs 15.87 crore. EBITDA Margins at 34.6 percent versus 31.35 percent. Profit After Tax rises by 21 percent at Rs 8.74 crore versus Rs 7.22 crore.\nElgi Equipments : Nalanda India Equity Fund buys 34.55 lakh shares at Rs 121.5/share. Large deal amounts to 2.1 percent equity stake for Rs 42 crore. As of June, institutions hold 26.7 percent stake in company. SBI MF, HDFC MF & ICICI Pru MF hold stake in company.\nThe other stocks in news are ICICI Bank and Hindalco .\n \n \n \n", "title": "Here's why DLF, Future Group and Suzlon in top 10 Stocks", "link": "http://www.moneycontrol.com/news/stockstowatch/heresdlf-future-groupsuzlontop-10-stocks_3501801.html", "time": "11.17 am "}, {"date": " 09 Oct 2015", "content": "Oct 09, 2015, 10.04 AM  | Source: PTI\nSuzlon gets rating boost from CARE\nRating agency CARE has assigned an investment grade credit rating to the Wind turbine manufacturer's outstanding bank facilities as well as to the proposed commercial paper instrument.\nLike this story, share it with millions of investors on M3\nSuzlon gets rating boost from CARE\nRating agency CARE has assigned an investment grade credit rating to the Wind turbine manufacturer's outstanding bank facilities as well as to the proposed commercial paper instrument.\nPost your opinion here\n \nWind turbine manufacturer Suzlon Group has secured an investment credit rating for its long-term loan facilities after about three years.\nRating agency CARE has assigned an investment grade credit rating to the Wind turbine manufacturer's outstanding bank facilities as well as to the proposed commercial paper instrument.\nThe company said in a statement that rating agency CARE has assigned BBB- credit rating assigned for long-term bank facilities and fund-based working capital limits.\nInstruments with 'CARE BBB' rating are considered to have moderate degree of safety regarding timely servicing of financial obligations. Such instruments carry moderate credit risk.\nSuzlon Group Chief Financial Officer Kirti Vagadia said, \"We are pleased to announce that we have been upgraded to Investment grade (BBB-) from D rating (in 2012).\"\n\"The rating clearly demonstrates our restored credibility on account of significant deleveraging, strong industry outlook, our sizable order-book, order pipe-line and strong operating performance. We have maintained strict discipline from the beginning of the current financial year towards timely payment of all our financial obligations,\" Vagadia said.\nInstruments with 'CARE D' rating are in default or are expected to be in default soon. The wind turbine manufacturer further said 'CARE A3' credit rating was assigned for its non-fund based working capital limits and proposed commercial paper.\nInstruments with 'CARE A3' rating are considered to have moderate degree of safety regarding timely payment of financial obligations. Such instruments carry higher credit risk as compared to instruments rated in the two higher categories.\nSuzlon Energy stock price\nOn December 18, 2015, at  11:57 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon gets rating boost from CARE", "link": "http://www.moneycontrol.com/news/business/suzlon-gets-rating-boostcare_3493221.html", "time": "10.04 am "}, {"date": " 08 Oct 2015", "content": "Oct 08, 2015, 12.32 PM  | Source: Moneycontrol.com\nCARE assigns investment grade (BBB-) rating to Suzlon\nSuzlon Group has announced that rating agency CARE has assigned an investment grade credit rating to its outstanding banks facilities as well as to the proposed commercial paper instrument.\nLike this story, share it with millions of investors on M3\nCARE assigns investment grade (BBB-) rating to Suzlon\nSuzlon Group has announced that rating agency CARE has assigned an investment grade credit rating to its outstanding banks facilities as well as to the proposed commercial paper instrument.\nPost your opinion here\n \nSuzlon Energy Ltd has submitted to BSE a copy of Press Release dated October 08, 2015 titled \"CARE assigns Investment Grade (BBB-) rating to Suzlon\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "CARE assigns investment grade (BBB-) rating to Suzlon", "link": "http://www.moneycontrol.com/news/announcements/care-assigns-investment-grade-(bbb-)-rating-to-suzlon_3483401.html", "time": "12.32 pm "}], [{"date": " 06 Oct 2015", "content": "Oct 06, 2015, 11.08 AM  | Source: Moneycontrol.com\nSuzlon Energy up 4% on repeat order from Orange Renewable\n\"Suzlon Group has won a repeat turnkey order from Orange Renewable for 100.8 MW to be installed in Beluguppa, Andhra Pradesh,\" said the country's largest turbine maker.\nLike this story, share it with millions of investors on M3\nSuzlon Energy up 4% on repeat order from Orange Renewable\n\"Suzlon Group has won a repeat turnkey order from Orange Renewable for 100.8 MW to be installed in Beluguppa, Andhra Pradesh,\" said the country's largest turbine maker.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of Suzlon Energy gained 3.7 percent intraday Tuesday on getting repeat order from Orange Renewable.\n\"Suzlon Group has won a repeat turnkey order from Orange Renewable for 100.8 MW to be installed in Beluguppa, Andhra Pradesh,\" said the country's largest turbine maker.\nSuzlon will offer operation and maintenance service for an initial period of 12 years through an integrated services package, it adds.\nThe project will be commissioned from FY16-17. Orange Renewable is a subsidiary of AT Holdings, Singapore.\n\"This is a second project with Suzlon and demonstrates belief in Suzlon as a technology partner,\" Sudhir Nunes, CEO, Orange says.\nAt 09:22 hours IST, the scrip of Suzlon Energy was quoting at Rs 22.20, up Rs 0.50, or 2.30 percent on the BSE.\nPosted by Sunil Shankar Matkar\n", "title": "Suzlon Energy up 4% on repeat order from Orange Renewable", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-energy4repeat-orderorange-renewable_3435761.html", "time": "9.35 am "}, {"date": " 06 Oct 2015", "content": "Oct 06, 2015, 09.14 AM  | Source: Moneycontrol.com\nSuzlon Group wins repeat order of 100.8 MW from Orange Renewable\nSuzlon Group has won repeat turnkey order from Orange Renewable for 100.8 MW to be installed in Beluguppa, Andhra Pradesh, India.\nLike this story, share it with millions of investors on M3\nSuzlon Group wins repeat order of 100.8 MW from Orange Renewable\nSuzlon Group has won repeat turnkey order from Orange Renewable for 100.8 MW to be installed in Beluguppa, Andhra Pradesh, India.\nPost your opinion here\n \nSuzlon Energy Ltd has submitted to BSE a copy of Press Release dated October 06, 2015 titled ''Suzlon Group Wins Repeat Order of 100.8 MW from Orange Renewable\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Group wins repeat order of 100.8 MW from Orange Renewable", "link": "http://www.moneycontrol.com/news/announcements/suzlon-group-wins-repeat-order1008-mworange-renewable_3435661.html", "time": "9.14 am "}, {"date": " 29 Sep 2015", "content": "Sep 29, 2015, 03.34 PM  | Source: PTI\nSuzlon completes commissioning of wind power turnkey proj\n\"The project will provide electricity to over 50,000 homes and curb 0.21 million tonnes of CO2 emissions annually. Suzlon will offer operations and maintenance for 20 years through an Integrated Service Package contract,\" the company said in a statement.\nLike this story, share it with millions of investors on M3\nSuzlon completes commissioning of wind power turnkey proj\n\"The project will provide electricity to over 50,000 homes and curb 0.21 million tonnes of CO2 emissions annually. Suzlon will offer operations and maintenance for 20 years through an Integrated Service Package contract,\" the company said in a statement.\nPost your opinion here\n \nWind turbine maker Suzlon Energy on Tuesday said it has completed the commissioning of 100.8 MW wind power turnkey project for CLP India. The project is located at Tejuva, Jaisalmer in Rajasthan.\n\"The project will provide electricity to over 50,000 homes and curb 0.21 million tonnes of CO2 emissions annually. Suzlon will offer operations and maintenance for 20 years through an Integrated Service Package contract,\" the company said in a statement.\nElaborating on the project, the firm said: \"The project comprises of 48 WTGs (Wind Turbine Generator) of Suzlon's robust S97- 2.1 MW wind turbines... designed to optimally harness the available wind resources and deliver higher energy, productivity, improved serviceability and higher return on investment (ROI) to customers.\n\"Suzlon leveraged its end-to-end wind solutions expertise to oversee the project completion from start to end.\"\nSuzlon Group Chief Sales Officer Ishwar Mangal said, \"Given the positive change in the Indian renewable energy landscape, our focus this year is to cater to the Indian market and enhance our market share.\"\nShares of Suzlon Energy were trading 0.25 percent up at Rs 20.30 apiece during afternoon session on the BSE.\nSuzlon Energy stock price\nOn December 18, 2015, at  11:57 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon completes commissioning of wind power turnkey proj", "link": "http://www.moneycontrol.com/news/business/suzlon-completes-commissioningwind-power-turnkey-proj_3308341.html", "time": "12.21 pm "}, {"date": " 23 Sep 2015", "content": "Sep 23, 2015, 02.40 PM  | Source: PTI\nSuzlon bags 105 MW turnkey contracts from SMEs, PSUs\n\"Suzlon has been awarded orders for a combined capacity of 105 MW from a mix of SME and PSU customers, on turnkey basis, in this quarter,\" the company said in a statement. Under the contracts, Suzlon will install a total of 50 turbines of 2.1 MW product platform in the key windy states, it said.\nLike this story, share it with millions of investors on M3\nSuzlon bags 105 MW turnkey contracts from SMEs, PSUs\n\"Suzlon has been awarded orders for a combined capacity of 105 MW from a mix of SME and PSU customers, on turnkey basis, in this quarter,\" the company said in a statement. Under the contracts, Suzlon will install a total of 50 turbines of 2.1 MW product platform in the key windy states, it said.\nPost your opinion here\n \nWind turbine manufacturer Suzlon on Wednesday said it has bagged contracts from SMEs and public sector undertakings (PSU) to supply 50 turbines of 2.1 MW each in various parts of the country.\n\"Suzlon has been awarded orders for a combined capacity of 105 MW from a mix of SME and PSU customers, on turnkey basis, in this quarter,\" the company said in a statement. Under the contracts, Suzlon will install a total of 50 turbines of 2.1 MW product platform in the key windy states, it said.\nSuzlon will supply its multi-megawatt S95-90m, S97- 90m, S97-120m turbines and will leverage on its turnkey wind solutions expertise to oversee the project operations from start to end, the statement further said.\nThe projects will be located across Andhra Pradesh, Gujarat, Karnataka, Madhya Pradesh and Tamil Nadu.\n\"We continue to have a strong focus on the Indian market as it offers a favourable renewable energy environment. We will leverage our manufacturing facilities across India and continue to partner with our clients to contribute towards renewable energy portfolio,\" Suzlon Chairman Tulsi Tanti said.\nHe added, \"We are confident that our business will add value to the energy security needs of our country.\" The company said that many of these orders have been placed by SMEs for captive usage thus enabling them to freeze their long term captive power cost and incur substantial savings.\n \nSuzlon Energy stock price\nOn December 18, 2015, at  11:58 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon bags 105 MW turnkey contracts from SMEs, PSUs", "link": "http://www.moneycontrol.com/news/business/suzlon-bags-105-mw-turnkey-contractssmes-psus_3212901.html", "time": "2.40 pm "}, {"date": " 03 Aug 2015", "content": "Aug 03, 2015, 01.25 PM  | Source: Moneycontrol.com\nSuzlon surges 18% on stellar Q1, net profit at Rs 1047 cr\nThe company's total income was 2,627.71 crore in first quarter compared to Rs 4,671.99 crore year-on-year.\nLike this story, share it with millions of investors on M3\nSuzlon surges 18% on stellar Q1, net profit at Rs 1047 cr\nThe company's total income was 2,627.71 crore in first quarter compared to Rs 4,671.99 crore year-on-year.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of Suzlon surged 18 percent intraday Monday riding on its April-June quarter. The wind turbine maker’s Q1 consolidated net profit was at Rs 1,047.41 crore from a net loss of Rs 750.74 crore in the year-ago period.\nThe company's total income was 2,627.71 crore in first quarter compared to Rs 4,671.99 crore year-on-year. The company said its consolidated net debt (excluding foreign currency convertible bonds) was down to Rs 7,010 crore from Rs 14,821 crore as of 31 March 2015. It has also said that it has brought down interest cost down by 36 percent quarter-on-quarter.\nThe board also approved proposal to issue securities (bonds) to the extent of Rs 5,000 crore subject to shareholders' approval. Suzlon Group Chairman Tulsi Tanti said, \"Our Q1 performance reflects our turnaround journey. Our strategic vision incorporates the government's renewable energy target of 175 GW by 2022 and the conducive policy landscape. This year, we expect to supply 100 turbines of the S111.\"\nAt 13:23 hrs Suzlon Energy was at Rs 24.70, up Rs 2.80, or 12.79 percent on thr BSE.\n(With inputs from PTI)\n", "title": "Suzlon surges 18% on stellar Q1, net profit at Rs 1047 cr", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-surges-18stellar-q1-net-profit-at-rs-1047-cr_2293081.html", "time": "11.14 am "}, {"date": " 27 Jul 2015", "content": "Jul 27, 2015, 10.59 AM  | Source: Moneycontrol.com\nBank of Baroda, Guj Pipavav, Elecon Engg top sells: Tata MF\nBank Of Baroda, Gujarat Pipavav Port and Elecon Engineering Company were the top sells by the fund, while Power Grid Corporation, Federal Bank and Suzlon Energy were the top buys.\nLike this story, share it with millions of investors on M3\nBank of Baroda, Guj Pipavav, Elecon Engg top sells: Tata MF\nBank Of Baroda, Gujarat Pipavav Port and Elecon Engineering Company were the top sells by the fund, while Power Grid Corporation, Federal Bank and Suzlon Energy were the top buys.\nPost your opinion here\n \nTata Mutual Fund  has decreased its weightage in information technology, manufacturing and services. However, it has increased its investments in automotive, utilities and chemicals.\nBank Of Baroda ,  Gujarat Pipavav Port and  Elecon Engineering Company were the top sells by the fund, while Power Grid Corporation ,  Federal Bank and  Suzlon Energy were the top buys.\nA study of the scheme for the quarter of April-June 2015 shows that in the information technology space, the fund sold Infosys, Wipro, Cyient and also exited from Persistent Systems. However, it bought Tata Consultancy Services and HCL Technologies.\nIt sold Bharat Forge, Metalyst Forgings, Astral Poly Technik and exited from Lovable Lingerie, Sarla Performance Fibers and Ramkrishna Forgings in the manufacturing segment, while it introduced Sundram Fasteners. (View - All Bulk Deals by Mutual Funds ).\nIn the services pack, the fund sold Jet Airways, Blue Dart Express and exited from Gujarat Pipavav Port. Whereas, in the same pack it bought Container Corporation of India.\nThe fund purchased Tata Motors, Maruti Suzuki India and Tata Motors (DVR) in the automotive sector. While, it sold Eicher Motors, MRF, Hero Motocorp and exited from Exide Industries. (Check out - Which sectors are attracting Fund Managers? ).\nIt bought Power Grid Corporation of India in the utilities segment.\nIn the chemicals pack, the fund bought Solar Industries India, Bayer CropScience and Asian Paints. It also introduced Kansai Nerolac Paints and Rallis India. While, it sold Finolex Industries, UPL and Castrol India from the same pack.\nTable of Stocks bought/ sold by Tata Mutual Fund...contd on Page 2\n For more Mutual Fund Action in Market click here\nQ\n", "title": "Bank of Baroda, Guj Pipavav, Elecon Engg top sells: Tata MF", "link": "http://www.moneycontrol.com/news/mfanalysis/bankbaroda-guj-pipavav-elecon-engg-top-sells-tata-mf_2150981.html", "time": "10.59 am "}, {"date": " 23 Jul 2015", "content": "Jul 23, 2015, 03.32 PM  | Source: Reuters\nBanks opt for offbeat tactics to tackle $49 bn of bad debts\nUnder pressure to do more to cut a USD 49 billion mountain of bad debt, India's state-owned banks are reversing years of lax recovery efforts, naming and shaming smaller borrowers and even using big TV screens at shopping malls to advertise seized assets for sale.\nLike this story, share it with millions of investors on M3\nBanks opt for offbeat tactics to tackle $49 bn of bad debts\nUnder pressure to do more to cut a USD 49 billion mountain of bad debt, India's state-owned banks are reversing years of lax recovery efforts, naming and shaming smaller borrowers and even using big TV screens at shopping malls to advertise seized assets for sale.\nPost your opinion here\n \nUnder pressure to do more to cut a USD 49 billion mountain of bad debt, India's state-owned banks are reversing years of lax recovery efforts, naming and shaming smaller borrowers and even using big TV screens at shopping malls to advertise seized assets for sale.\nIndia's bad debt pile, dominated by corporate loans, is at its highest in a decade, swollen by an economic slowdown, loose lending and, in many cases, banks' own failure to do enough to chase down rogue debtors.\nNow, bank executives say pressure - from a government needing to accelerate economic recovery and from a central bank that wants company owners to take more responsibility - has left little choice but to get tougher and faster.\nTactics include targeting smaller borrowers with aggressive 'name and shame' campaigns, with placards and groups of bank employees protesting outside offices, for example, and putting pressure on investors or executives at larger firms.\nP.K. Malhotra, a deputy managing director at the State Bank of India , the country's largest bank, said his team received extra training, including in psychology, and was systematically chasing up payments, as others in the bank accelerated sales of seized assets.\n\"The focus (is) on getting court cases expedited. Less on the paperwork and more on the fieldwork,\" said Malhotra.\nExecutives say it's too early to measure overall success, but there have been some wins for India's bruised banks.\nSuzlon Energy this year sold its German unit, Senvion, for 1 billion euros (USD 1.1 billion) in cash - less than what it paid to buy the asset in a deal completed in 2011. It crystallised a huge loss after banks piled pressure on the loss-making wind-turbine maker to cut its debt.\nMore than two dozen lenders led by SBI are looking for an investor in Electrosteel Steels Ltd , whose near-USD 1.4 billion bank loan is strained. Rather than 'evergreening' the loan - a process of regular review and renew - lenders are getting involved in the buyer talks, an individual with direct knowledge of the matter told Reuters.\nEARLY WARNINGS\nGross bad loans at Indian banks rose to 3.1 trillion rupees (USD 48.83 billion) as of end-March, or 4.6 percent of total loans, according to central bank data. Including loans that are stressed but not yet classified as bad, total troubled loans made up 11 percent of total lending.\nBanks say they are now moving faster to bring that down, stepping in at the first sign of trouble, sending out more officers to chase borrowers and putting more people on the job through specialised branches. Some are trying to speed up the sale of seized assets by advertising them on large screens at shopping malls.\n\"These days people are getting on to the job the moment you have an early warning signal that something may happen in a company and you have thousands of crores at stake,\" said a senior banker at a big state-run bank. India uses crore to denote a unit of 10 million.\nSBI has set up branches focussed solely on recovering loans, and, to speed up cumbersome paperwork, encourages managers to snap pictures of themselves on seized assets - proof of the change of ownership. It plans to set up a web portal to showcase all the seized assets available for auction.\n\"Companies can sometimes fall in love with their assets, but bankers can't afford to do that,\" said SBI's Malhotra.\nUnion Bank of India Chairman Arun Tiwari said his state-run lender has changed its system to put three separate general managers in charge of recovering different classes of loans - large, middle and small.\n\"You have to go out in the field,\" he said.\nSBI stock price\nOn December 18, 2015, at  11:59 hrs State Bank of India was quoting at Rs 230.10, down Rs 0.9, or 0.39 percent. The 52-week high of the share was Rs 335.90 and the 52-week low was Rs 220.60.\nThe company's trailing 12-month (TTM) EPS was at Rs 18.32 per share as per the quarter ended September 2015. The stock's price-to-earnings (P/E) ratio was 12.56. The latest book value of the company is Rs 165.49 per share. At current value, the price-to-book value of the company is 1.39.\n", "title": "Banks opt for offbeat tactics to tackle $49 bn of bad debts", "link": "http://www.moneycontrol.com/news/business/banks-opt-for-offbeat-tactics-to-tackle-3649-bnbad-debts_2105481.html", "time": "8.11 am "}], [{"date": " 01 Jul 2015", "content": "Jul 01, 2015, 11.50 AM  | Source: PTI\nSuzlon Group installs 10,000th wind turbine generator\n\"This milestone reinforces the confidence our customers have in Suzlon and also in its products and project execution capabilities. We will continuously work at reducing the cost of energy by about 15 percent by 2020 and heavily invest in R&D and innovation,\" Tulsi Tanti, Chairman, Suzlon Group said in the statement.\nLike this story, share it with millions of investors on M3\nSuzlon Group installs 10,000th wind turbine generator\n\"This milestone reinforces the confidence our customers have in Suzlon and also in its products and project execution capabilities. We will continuously work at reducing the cost of energy by about 15 percent by 2020 and heavily invest in R&D and innovation,\" Tulsi Tanti, Chairman, Suzlon Group said in the statement.\nPost your opinion here\n \nThe Suzlon Group  on Wednesday said it has installed its 10,000th wind turbine generator during the first half of 2015. \"Suzlon Group announced a significant milestone achievement of installing its 10,000th WTG (wind turbine generator) during the first half of 2015,\" the company said in a release.\n\"Suzlon has come a long way since its maiden turbine installation in Gujarat in 1995,\" it added.\n\"This milestone reinforces the confidence our customers have in Suzlon and also in its products and project execution capabilities. We will continuously work at reducing the cost of energy by about 15 percent by 2020 and heavily invest in R&D and innovation,\" Tulsi Tanti, Chairman, Suzlon Group said in the statement.\nHe added that the group is confident that wind energy will play a pivotal role in changing the global energy landscape and Suzlon is best positioned to tap this growing opportunity for a greener tomorrow.\nThe products like S97-120m hub height hybrid tower and the upcoming S111-2.1MW Turbine, the largest rotor diameter WTG, are industry game changers, engineered for low wind sites, it said. Suzlon Energy rose 1.8 percent to Rs 22.60 on BSE. \nSuzlon Energy stock price\nOn December 18, 2015, at  11:59 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon Group installs 10,000th wind turbine generator", "link": "http://www.moneycontrol.com/news/business/suzlon-group-installs-10000th-wind-turbine-generator_1738681.html", "time": "11.49 am "}, {"date": " 01 Jul 2015", "content": "Jul 01, 2015, 11.10 AM  | Source: Moneycontrol.com\nSuzlon Energy installs 10kth wind turbine generator; up 3%\nSuzlon Group has cumulative installations of over 14 GW of wind energy capacity with operations across over 17 countries and customer base of more than 1700\nLike this story, share it with millions of investors on M3\nSuzlon Energy installs 10kth wind turbine generator; up 3%\nSuzlon Group has cumulative installations of over 14 GW of wind energy capacity with operations across over 17 countries and customer base of more than 1700\nPost your opinion here\nMoneycontrol Bureau\n \nWind turbine manufacturer, Suzlon Energy  rose 3 percent intraday Wednesday. The company has achieved a milestone by installing its 10000th (WTG) Wind Turbine Generator during the first half of 2015.\n \nSuzlon Group has cumulative installations of over 14 GW of wind energy capacity with operations across over 17 countries and customer base of more than 1700.\n \nTulsi Tanti, Chairman, Suzlon Group said, \"This milestone reinforces the confidence our customers have on Suzlon and also on its products and project execution capabilities.\"\n \n\"I am confident that wind energy will play a pivotal role in changing the global energy landscape and Suzlon is best positioned to tap this growing opportunity for a greener tomorrow,” he added.\n \nIn the month of June, Suzlon Group won another order for 90.30 MW turnkey project from its existing customer, ReNew Power, wherein the company will install its S97 90m WTGs with rated capacity of 2.1MW at Ellutla site Ananthpur district, Andhra Pradesh.\n \nAt 10:43 hrs Suzlon Energy was quoting at Rs 22.65, up Rs 0.45, or 2.03 percent on the BSE.\n \n", "title": "Suzlon Energy installs 10kth wind turbine generator; up 3%", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-energy-installs-10kth-wind-turbine-generator3_1738301.html", "time": "11.10 am "}, {"date": " 01 Jul 2015", "content": "Jul 01, 2015, 09.57 AM  | Source: Moneycontrol.com\nSuzlon achieves milestone by installing its 10000th Wind Turbine Generator\nSuzlon Energy has achieved a milestone by installing its 10,000th Wind Turbine Generator.\nLike this story, share it with millions of investors on M3\nSuzlon achieves milestone by installing its 10000th Wind Turbine Generator\nSuzlon Energy has achieved a milestone by installing its 10,000th Wind Turbine Generator.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated July 01, 2015, titled \"Suzlon achieves a milestone by installing its 10,000th Wind Turbine Generator\".Source : BSE\n", "title": "Suzlon achieves milestone by installing its 10000th Wind Turbine Generator", "link": "http://www.moneycontrol.com/news/announcements/suzlon-achieves-milestone-by-installing-its-10000th-wind-turbine-generator_1737701.html", "time": "9.57 am "}, {"date": " 23 Jun 2015", "content": "Jun 23, 2015, 02.04 PM  | Source: CNBC-TV18\nTop buzzing midcap stocks to trade on June 23\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have public sector banks like Bank of India, United Bank, IDBI, IOB, Canara Bank, Dena Bank. We also have L&T, Sun TV, Lupin, Arvind, Moser Baer, Suzlon, Ujaas Energy and Indosolar.\nLike this story, share it with millions of investors on M3\nTop buzzing midcap stocks to trade on June 23\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have public sector banks like Bank of India, United Bank, IDBI, IOB, Canara Bank, Dena Bank. We also have L&T, Sun TV, Lupin, Arvind, Moser Baer, Suzlon, Ujaas Energy and Indosolar.\nPost your opinion here\n", "title": "Top buzzing midcap stocks to trade on June 23", "link": "http://www.moneycontrol.com/news/buzzingstocks/top-buzzing-midcap-stocks-to-tradejune-23_1607581.html", "time": "1.44 pm "}, {"date": " 22 Jun 2015", "content": "Jun 22, 2015, 10.54 AM  | Source: Moneycontrol.com\nLupin up 2%, replaces Tata Power in Sensex today\nShares of Lupin climbed nearly 2 percent in early trade Monday after it entered into 30-share BSE Sensex today. However, the Bombay Stock Exchange removed Tata Power from its benchmark.\nLike this story, share it with millions of investors on M3\nLupin up 2%, replaces Tata Power in Sensex today\nShares of Lupin climbed nearly 2 percent in early trade Monday after it entered into 30-share BSE Sensex today. However, the Bombay Stock Exchange removed Tata Power from its benchmark.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of  Lupin climbed nearly 2 percent in early trade Monday after it entered into 30-share BSE Sensex today. The Bombay Stock Exchange removed  Tata Power from its benchmark.\nThe exchange announced this change on May 22, 2015. Since then the drug maker gained 4.6 percent and the private power generation company slipped 5 percent in one month period.\nAdditionally,  Adani Power  is dropped from the BSE 100 Index today while  Aurobindo Pharma and  Tata Motors DVR  are added in the same index with effect from today.\nThe exchange added Ajanta Pharma , Suzlon Energy , Dewan Housing Corporation ,  NCC and  Tata Motors DVR in BSE 200 index. It removed Sanofi India , Hindustan Copper ,  Amtek Auto and Jaiprakash Power Ventures .\nEven in Bankex, the exchange removed  Canara Bank and Bank of India . The BSE also made major changes in BSE 500 Index.\nAt 09:28 hours IST, the scrip of Lupin was quoting at Rs 1,843.70, up Rs 27.25, or 1.50 percent while Tata Power Company declined 0.07 to Rs 72.10 on the BSE.\nPosted by Sunil Shankar Matkar\n", "title": "Lupin up 2%, replaces Tata Power in Sensex today", "link": "http://www.moneycontrol.com/news/buzzingstocks/lupin2-replaces-tata-powersensex-today_1586741.html", "time": "9.45 am "}, {"date": " 21 Jun 2015", "content": "Jun 22, 2015, 08.00 AM  | Source: PTI\nLupin to replace Tata Power on Sensex from today\nDrugmaker Lupin will replace private sector electricity producer Tata Power on the BSE benchmark index Sensex from tomorrow.\nLike this story, share it with millions of investors on M3\nLupin to replace Tata Power on Sensex from today\nDrugmaker Lupin will replace private sector electricity producer Tata Power on the BSE benchmark index Sensex from tomorrow.\nPost your opinion here\n \nDrugmaker  Lupin will replace private sector electricity producer  Tata Power on the BSE benchmark index Sensex from tomorrow.\nSince May 22, when the announcement was made by BSE, shares of Tata Power have lost nearly 5 percent, while Lupin gained 4.6 percent.\nBesides, a host of changes would also be effective in various other indices, where  Adani Power would be dropped from the BSE 100 index.\nThe BSE-100, an index of the top-100 listed companies in the country, would see  Aurobindo Pharma and  Tata Motors (DVR) coming in, while BSE-200 would get five new entries -- Ajanta Pharma , Suzlon Energy , Dewan Housing ,  NCC India and Tata Motors (DVR).\nThose moving out of BSE-100 include Sanofi India , Hindustan Copper ,  Amtek Auto and Jaiprakash Power Ventures .\nThe reconstitution in BSE indices will be effective from June 22, BSE had said in a statement last month.\nFurther, a host of changes would also be effective in various other indices such as BSE 200 and BSE 500.\n", "title": "Lupin to replace Tata Power on Sensex from today", "link": "http://www.moneycontrol.com/news/marketnews/lupin-to-replace-tata-powersensextoday_1580681.html", "time": "2.57 pm "}, {"date": " 18 Jun 2015", "content": "Jun 18, 2015, 01.00 PM  | Source: CNBC-TV18\nTop buzzing midcap stocks to trade on June 18\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have Asian Paints, Himatsingka Seide, Orchid Chemicals, Strides Arcolab, Shasun Pharma, Cipla, Suzlon Energy, Ujaas Energy, Tech Mahindra and Eicher Motors.\nLike this story, share it with millions of investors on M3\nTop buzzing midcap stocks to trade on June 18\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have Asian Paints, Himatsingka Seide, Orchid Chemicals, Strides Arcolab, Shasun Pharma, Cipla, Suzlon Energy, Ujaas Energy, Tech Mahindra and Eicher Motors.\nPost your opinion here\n", "title": "Top buzzing midcap stocks to trade on June 18", "link": "http://www.moneycontrol.com/news/buzzingstocks/top-buzzing-midcap-stocks-to-tradejune-18_1540221.html", "time": "12.43 pm "}, {"date": " 12 Jun 2015", "content": "Jun 13, 2015, 12.43 PM  | Source: PTI\nSebi to begin fresh probe in 10 years old IPO scam\nThe regulator will re-investigate the matter pertaining to Jayesh P Khandwala, proprietor of Zealous Trading Company, its role in IPOs of IDFC, Sasken and Suzlon, its alleged direct or indirect transactions, relations with other entities and the alleged gains made by him. The matter first came to light in 2005.\nLike this story, share it with millions of investors on M3\nSebi to begin fresh probe in 10 years old IPO scam\nThe regulator will re-investigate the matter pertaining to Jayesh P Khandwala, proprietor of Zealous Trading Company, its role in IPOs of IDFC, Sasken and Suzlon, its alleged direct or indirect transactions, relations with other entities and the alleged gains made by him. The matter first came to light in 2005.\nPost your opinion here\n \nMarkets regulator Sebi will re-investigate a nearly 10-year-old case of alleged IPO-related irregularities by some operators as 'inconsitencies' have come to the fore in its earlier order.\nThe regulator will re-investigate the matter pertaining to Jayesh P Khandwala, proprietor of Zealous Trading Company, its role in IPOs of IDFC , Sasken  and Suzlon , its alleged direct or indirect transactions, relations with other entities and the alleged gains made by him. The matter first came to light in 2005.\nThe Securities and Exchange Board of India (Sebi) has decided to re-investigate the matter as 'inconsistencies' have been found in the case. \"...it is appropriate that Sebi look into these objections/inconsistencies and relationships among various players in a fresh investigation,\" Sebi Whole Time Member Prashant Saran said in his order.\nEarlier, Sebi had prima facie found that Khandwala had made unlawful gains in the IPO demat scam.\nThousands of fictitious demat accounts were created to corner shares meant for the retail investors. The Sebi investigation into the IPO demat scam had found that Khandwala provided finance to various operators to make applications in the retail category of these initial share sale programmes.\nUpon allotment of shares in these IPOs the operators subsequently transferred these shares and corresponding refunds to Khandwala who in turn disposed of the said shares and made an unlawful gain. \n", "title": "Sebi to begin fresh probe in 10 years old IPO scam", "link": "http://www.moneycontrol.com/news/marketnews/sebi-to-begin-fresh-probe10-years-old-ipo-scam_1428741.html", "time": "8.42 pm "}, {"date": " 04 Jun 2015", "content": "Jun 05, 2015, 07.48 AM  | Source: Moneycontrol.com\nTrending in trade: 4 stocks that rocked Dalal Street\nAndrew Holland of Ambit Investment Advisors said emerging market nervousness is on account of Fed rate hike fears and that global fears may result in a correction to sub-8000 level on the Nifty.\nLike this story, share it with millions of investors on M3\nTrending in trade: 4 stocks that rocked Dalal Street\nAndrew Holland of Ambit Investment Advisors said emerging market nervousness is on account of Fed rate hike fears and that global fears may result in a correction to sub-8000 level on the Nifty.\nPost your opinion here\n \nMoneycontrol Bureau\nThe 30-share BSE Sensex fell 23.78 points to 26813.42, continuing downtrend for the third consecutive session. The 50-share NSE Nifty was down 4.45 points at 8130.65. The broader markets closed flat too. Andrew Holland of Ambit Investment Advisors said emerging market nervousness is on account of Fed rate hike fears and that global fears may result in a correction to sub-8000 level on the Nifty.\n", "title": "Trending in trade: 4 stocks that rocked Dalal Street", "link": "http://www.moneycontrol.com/news/buzzingstocks/trendingtrade-4-stocks-that-rocked-dalal-street_1399816.html", "time": "5.31 pm "}, {"date": " 04 Jun 2015", "content": "Jun 04, 2015, 03.44 PM  | Source: PTI\nSuzlon wins ReNew Power's Andhra turnkey project\nIt's expected to provide electricity to 56,000 households and help check 0.195 million tonnes of CO2 emission annually.\nLike this story, share it with millions of investors on M3\nSuzlon wins ReNew Powers Andhra turnkey project\nIt's expected to provide electricity to 56,000 households and help check 0.195 million tonnes of CO2 emission annually.\nPost your opinion here\n \nWind turbine manufacturer Suzlon  on Thursday said it has bagged a 90.30 MW turnkey project from ReNew Power.\n\"Suzlon Group... has won another order for 90.30 MW turnkey project from its existing customer, ReNew Power, an independent power producer (IPP),\" the company said in a\nstatement.\n\"It will install its S97 90m WTGs (wind turbine generators) with rated capacity of 2.1 MW... in Ananthpur district, Andhra Pradesh.\"  The project will be jointly developed by ReNew Power and Suzlon, where the latter will act as the turnkey EPC partner.\nIt's expected to provide electricity to 56,000 households and help check 0.195 million tonnes of CO2 emission annually.\nSuzlon Group Chairman Tulsi Tanti said: \"Suzlon & ReNew share a common resolve to enhance India's renewable energy portfolio and have successfully collaborated in the past few years. We are glad to once again partner with ReNew for this project in Andhra Pradesh.\"\n\"Our mission is to play a pivotal role in meeting India's growing energy needs, which requires us to partner with companies such as Suzlon that have a strong foothold in the Indian market,\" said ReNew Power Chairman & CEO Sumant Sinha.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:00 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon wins ReNew Power's Andhra turnkey project", "link": "http://www.moneycontrol.com/news/business/suzlon-wins-renew-powers-andhra-turnkey-project_1399653.html", "time": "3.27 pm "}, {"date": " 04 Jun 2015", "content": "Jun 04, 2015, 01.48 PM  | Source: CNBC-TV18\nTop buzzing midcap stocks to trade on June 4\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have - Tata Steel, Suzlon Energy, Prestige Estates, Bank of India, Eicher Motor and Nestle.\nLike this story, share it with millions of investors on M3\nTop buzzing midcap stocks to trade on June 4\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have - Tata Steel, Suzlon Energy, Prestige Estates, Bank of India, Eicher Motor and Nestle.\nPost your opinion here\n", "title": "Top buzzing midcap stocks to trade on June 4", "link": "http://www.moneycontrol.com/news/stocksviews/top-buzzing-midcap-stocks-to-tradejune-4_1399620.html", "time": "1.32 pm "}, {"date": " 04 Jun 2015", "content": "Jun 04, 2015, 10.39 AM  | Source: Moneycontrol.com\nSuzlon gains 4%; bags repeat order of 90MW from ReNew Power\nSuzlon Group has won another order for 90.30 MW turnkey project from its existing customer, ReNew Power. Suzlon will install its S97 90m WTGs with rated capacity of 2.1MW at Ellutla site Ananthpur district, Andhra Pradesh.\nLike this story, share it with millions of investors on M3\nSuzlon gains 4%; bags repeat order of 90MW from ReNew Power\nSuzlon Group has won another order for 90.30 MW turnkey project from its existing customer, ReNew Power. Suzlon will install its S97 90m WTGs with rated capacity of 2.1MW at Ellutla site Ananthpur district, Andhra Pradesh.\nPost your opinion here\n \nMoneycontrol Bureau\nWind turbine maker,  Suzlon Energy gained nearly 4 percent intraday Thursday on the back of bagging new order from ReNew Power.\nSuzlon Group has won another order for 90.30 MW turnkey project from its existing customer, ReNew Power. Suzlon will install its S97 90m WTGs with rated capacity of 2.1MW at Ellutla site Ananthpur district, Andhra Pradesh.\nSuzlon is witnessing strong traction in order inflow and this recent 90 MW order from ReNew Power, bolsters its new order intake in Q1 FY 2016 to over 190 MW from leading IPPs.\nThe order of 90 MW from ReNew Power in Andhra Pradesh in the fourth repeat order from ReNew and the second order in the Q1FY16, as per company filing on the BSE.\nMe Tulsi Tanti, Chairman, Suzlon Group said, “Suzlon and ReNew share a common resolve to enhance India’s renewable energy portfolio and have successfully collaborated in the past few years.”\nSuzlon Energy’s net loss increased to Rs 1212 crore during March 2015 against Rs 603 crore in a year ago period.\nSuzlon Energy was quoting at Rs 21.50, up Rs 0.70, or 3.37 percent on the BSE.\nPosted by Rakesh Patil\n", "title": "Suzlon gains 4%; bags repeat order of 90MW from ReNew Power", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-gains-4-bags-repeat-order90mwrenew-power_1399457.html", "time": "9.51 am "}, {"date": " 04 Jun 2015", "content": "Jun 04, 2015, 09.25 AM  | Source: Moneycontrol.com\nSuzlon wins another 90 MW order from ReNew Power\nSuzlon Group has won another order for 90.30 MW turnkey project from its existing customer, ReNew Power. Suzlon will install its S97 90m WTGs with rated capacity of 2.1MW at Ellutla site Ananthpur district, Andhra Pradesh.\nLike this story, share it with millions of investors on M3\nSuzlon wins another 90 MW order from ReNew Power\nSuzlon Group has won another order for 90.30 MW turnkey project from its existing customer, ReNew Power. Suzlon will install its S97 90m WTGs with rated capacity of 2.1MW at Ellutla site Ananthpur district, Andhra Pradesh.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE about a Press Release dated June 04, 2015 titled \"Suzlon continues strong traction in order; wins another 90 MW order from ReNew Power\"Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon wins another 90 MW order from ReNew Power", "link": "http://www.moneycontrol.com/news/announcements/suzlon-wins-another-90-mw-orderrenew-power_1399442.html", "time": "9.25 am "}, {"date": " 02 Jun 2015", "content": "Jun 02, 2015, 02.23 PM  | Source: Moneycontrol.com\nSuzlon Energy consolidated Mar '15 sales at Rs 4,926.38 crore\nSuzlon Energy has reported a consolidated total income from operations of Rs 4,926.38 crore and a net loss of Rs 1,212.06 crore for the quarter ended Mar '15\nLike this story, share it with millions of investors on M3\nSuzlon Energy consolidated Mar 15 sales at Rs 4,926.38 crore\nSuzlon Energy has reported a consolidated total income from operations of Rs 4,926.38 crore and a net loss of Rs 1,212.06 crore for the quarter ended Mar '15\nPost your opinion here\n \nSuzlon Energy has reported a consolidated total income from operations of Rs 4,926.38 crore and a net loss of Rs 1,212.06 crore for the quarter ended Mar '15.\nFor the quarter ended Mar 2014 the consolidated total income from operations was Rs 6,645.05 crore and net loss was Rs 603.45 crore.\nSuzlon Energy shares closed at 23.85 on June 01, 2015 (BSE) and has given 76.54% returns over the last 6 months and -1.24% over the last 12 months.\nSuzlon Energy\n", "title": "Suzlon Energy consolidated Mar '15 sales at Rs 4,926.38 crore", "link": "http://www.moneycontrol.com/news/results/suzlon-energy-consolidated-mar-15-sales-at-rs-492638-crore_1397060.html", "time": "2.23 pm "}], [{"date": " 01 Jun 2015", "content": "Jun 01, 2015, 09.19 AM  | Source: CNBC-TV18\nHere's a list of top 10 stocks in news today\nHere's a list of top 10 stocks in news today due to their earnings.\nLike this story, share it with millions of investors on M3\nHeres a list of top 10 stocks in news today\nHere's a list of top 10 stocks in news today due to their earnings.\nPost your opinion here\n08:00 am\nLarsen and Toubro 's consolidated net profit dragged 27.13 percent at Rs 2069.6 crore in January-March from Rs 2840.4 crore in corresponding quarter last fiscal. During the quarter, its net sales was slightly up 3.7 percent at Rs 28,022.6 crore from Rs 27,024.1 crore as certain sectoral constraints slowed down pace of execution. In Q4FY15, there was an one-time gain of Rs 98.4 crore. “Profit was effected mainly due to challenges faced during execution of international projects in the hydrocarbon sector,” the company said in a statement. On a consolidated basis, its EBITDA was down 16.3 percent at Rs 3,609 crore against Rs 4,311 crore year-on-year. Operating margin, during the quarter, stood at 12.9 percent versus 16 percent year on year. On a standalone basis, its net profit slipped 24.3 percent to Rs 2060.6 against Rs 2723.5 crore year on year while sales was down 5.5 percent at Rs 18967.9 crore versus Rs 20079.1 crore year on year.The order intake for the fourth quarter was also higher at Rs 47582 crore, up 39 percent year on year. International order inflow in Q4 was at Rs 11364 crore, which constituted 24 percent of the order inflow for the quarter. Consolidated order book of the group stood at Rs 232649 crore as at March 31, 2015, higher by 28 percent year on year. International order book constituted 26 percent of the total\norder book.\nSun Pharmaceutical  Industries fourth quarter consolidated profit shot up 124.63 percent sequentially (down 44 percent year-on-year) to Rs 888 crore. Weak operational performance dented bottomline on year-on-year basis. This was the first quarter when combined earnings reported (Sun Pharma and Ranbaxy). Total income declined by 11.1 percent quarter-on-quarter (up 51.7 percent on yearly basis) to Rs 6,157 crore during January-March quarter, the company said in its filing. The drug major missed street expectations on every front. According to the average of estimates of analysts polled by CNBC-TV18, profit was estimated at Rs 1,660 crore on revenue of Rs 7,561.7 crore for the quarter.   Operating profit for the quarter was Rs 892 crore, down 58.8 percent sequentially (down 50.4 percent year-on-year) and margin declined 1670 basis points Q-o-Q (down 2990 bps Y-o-Y) to 14.5 percent in the quarter gone by. Analysts had estimated operating profit at Rs 2,512.7 crore and margin at 33.2 percent for the quarter. Consolidated other income in March quarter came in at Rs 383.7 crore against Rs 193.8 crore in the year-ago period and loss of Rs 73.28 crore in December quarter. The pharma company received tax gain of Rs 600 crore in fourth quarter against tax expenses of Rs 120 crore year-on-year and Rs 1,028.96 crore quarter-on-quarter. Finance cost was Rs 124.8 crore in Q4, up sharply compared to Rs 3.91 crore in the corresponding quarter of last fiscal and down compared to Rs 152.94 crore in previous quarter.\nState utility  Power Grid Corporation posted a 20 percent rise in its standalone net profit at Rs 1,412.48 crore for the quarter ended March 31, 2015. The company's standalone net profit stood at Rs 1,175.84 crore in the January-March quarter of the previous fiscal, Power Grid Corporation stated in a BSE filing. According to the statement, for 2014-15, the company's consolidated net profit rose to Rs 5,046.25 crore from Rs 4,547.58 crore in the previous fiscal. The company's consolidated total income has increased to Rs 18,233.04 crore million during 2014-15 from Rs 16,146.12 crore for 2013-14. In a separate filing, the company said the Board of Directors at its meeting held on May 30 has recommended final dividend of Rs 1.31 per share.\nCipla 's fourth quarter profit is expected to increase 29 percent year-on-year to Rs 335.8 crore and revenue to jump 16.4 percent to Rs 2,827.2 crore, according to a CNBC-TV18 poll. Operating profit may climb 42 percent on yearly basis to Rs 581 crore and margin may expand 436 basis points to 20.6 percent for the quarter ended March 2015.\nJet Airways  narrowed its net loss to Rs 1,728.99 crore for the three months ended March 2015, helped by lower expenses, fall in aviation fuel costs and higher income from operations.  The carrier, which has completed the first year of its strategic alliance with Etihad, had a net loss of Rs 2,513.57 crore in the year-ago period.  However, total income from operations jumped to Rs 5,064.52 crore in the fourth quarter ended March 2015 from Rs 4,566.17 crore in the same period a year ago.\nGlenmark Pharmaceuticals  Ltd reported a consolidated net profit of Rs 10.61 crore for the fourth quarter that ended on March 31, 2015. The company had posted a net profit of Rs 43.06 crore for the corresponding quarter a year ago. \"The net profit is not comparable due to exceptional item of Rs 187.08 crore in the fourth quarter on account of the settlement claim including legal expenses arrived with the State of Texas by Glenmark Generics Inc,\" Glenmark Pharmaceuticals said in a statement. The company's consolidated net sales rose to Rs 1,753.79 crore for the fourth quarter, up 4.28 per cent, as against Rs 1,681.74 crore in the year-ago period, Glenmark Pharma said in a filing to the BSE. For the year ended March 2015, the company posted consolidated a net profit of Rs 475.31 crore, compared to Rs 542.27 crore in 2013-14. Consolidated net sales of the company for the year rose to Rs 6,595.25 crore, against Rs 5,983.85 crore in fiscal year 2013-14.\nSun TV  reported a modest 2.74 percent increase in its net profit at Rs 202.99 crore for the fourth quarter ended March 31, 2015. The company had reported a net profit of Rs 197.57 crore for January-March period of last year. Income from operations of the Kalanithi Maran-owned Sun TV Network in the quarter under review was at Rs 548.58 crore, an increase of 5.45 percent from Rs 520.18 crore in the corresponding quarter last year, the company said in a BSE filing. During fiscal 2014-15, the Sun TV net profit stood at Rs 737.23 crore, against net profit of Rs 716.96 crore in previous financial year. Net sales in 2014-15 were at Rs 2,243.62 crore as compared with net sales of Rs 2,096.78 crore in the previous fiscal.\nReliance Communications  Ltd, India's fourth-biggest mobile carrier by customers, saw quarterly profit rise 46 percent over the year before, helped by more subscribers using their smartphones to browse the Internet. The company, controlled by tycoon Anil Ambani, made 2.28 billion rupees in profit during the quarter eneded March 31 2015, compared with 1.56 billion rupees the same quarter last year. Analysts were expecting it to make 2.04 billion rupees. Reliance Communications, which has also been in talks with Russia's Sistema for possible joint ventures, said its total data customer base grew 26.2 percent over last year, to 33.7 million. The company's net income from operations came in at 56.83 billion rupees, up from 53.71 billion rupees the year before. Average revenue per user, a key measure of health for telecom companies, was up 14.8 percent at 147 rupees over last year.\nIRB Infrastructure Developers  Ltd (IRB) on Friday reported a 26.53 per cent jump in consolidated net profit at Rs 138.21 crore for the quarter ended March, 2015 on higher income. The company had reported a net profit of Rs 109.23 crore for the corresponding quarter a year ago, it said in a statement. Total income from operations during the quarter rose 12.18 per cent to Rs 990.44 crore from Rs 882.87 crore a year ago. Total expenses of the company declined to Rs 591.81 crore from Rs 560.15 crore in the year-ago period. For the full year, the company reported an 18.24 per cent jump in net profit at Rs 542.90 crore as against Rs 459.12 crore in fiscal year 2013-14. Meanwhile, IRB said it had recently bagged a Rs 2,650 crore Agra-Etawah bypass project from the National Highways Authority of India (NHAI).\nWind turbine maker Suzlon Energy 's consolidated losses widened to Rs 1,212.06 crore during the March quarter due to a fall in income and provision for impairment of goodwill following sale of its German subsidiary Senvion. The company had reported a consolidated net loss of Rs 603.45 crore in the year-ago period, Suzlon Energy said in BSE filing. The company's consolidated total income during the quarter stood at Rs 4,926.38 crore, a decline of 25.8 percent from the comparable period. \"The company has made provision for impairment of investment in standalone financial results and impairment of goodwill in consolidated financial results (out of impairment of goodwill, Rs 2,451 crore is on account of post acquisition profits) and the same has been disclosed under exceptional items,\" the company said in the filing.\nSadbhav Engineering  said its standalone net profit rose by 8 per cent to Rs 38.87 crore for the quarter ended March 31, 2015. The firm had posted a net profit of Rs 36.02 crore in the year-ago period, it said in a BSE filing. Total standalone income of the civil engineering construction firm rose by 21 per cent to Rs 967.45 crore in the January-March quarter of the last fiscal from Rs 798.69 crore in the same quarter of the 2013-14 fiscal, it added. Sadbhav's total expenses during the reported quarter rose by 23 per cent to Rs 886.52 crore from Rs 723.89 crore. For the entire 2014-15, its standalone net profit grew by 7 per cent to Rs 113.73 crore from Rs 106.16 crore in 2013-14. Total standalone income of the company rose by 26 per cent to Rs 2,969.85 crore from Rs 2,358.12 crore during the same period, whereas total expenses rose to Rs 2,751.32 crore from Rs 2,156.12 crore.\n \n", "title": "Here's a list of top 10 stocks in news today", "link": "http://www.moneycontrol.com/news/buzzingstocks/hereslisttop-10-stocksnews-today_1395605.html", "time": "9.19 am "}, {"date": " 30 May 2015", "content": "May 30, 2015, 04.19 PM  | Source: PTI\nSuzlon's loss widens to Rs 1,212 cr in Q4\nCompany's losses widened to Rs 1,212.06 crore during the March quarter due to a fall in income and provision for impairment of goodwill following sale of its German subsidiary Senvion.\nLike this story, share it with millions of investors on M3\nSuzlons loss widens to Rs 1,212 cr in Q4\nCompany's losses widened to Rs 1,212.06 crore during the March quarter due to a fall in income and provision for impairment of goodwill following sale of its German subsidiary Senvion.\nPost your opinion here\n \nWind turbine maker Suzlon Energy 's consolidated losses widened to Rs 1,212.06 crore during the March quarter due to a fall in income and provision for impairment of goodwill following sale of its German subsidiary Senvion.\nThe company had reported a consolidated net loss of Rs 603.45 crore in the year-ago period, Suzlon Energy said in BSE filing.\nThe company's consolidated total income during the quarter stood at Rs 4,926.38 crore, a decline of 25.8 percent from the comparable period.\n\"The company has made provision for impairment of investment in standalone financial results and impairment of goodwill in consolidated financial results (out of impairment of goodwill, Rs 2,451 crore is on account of post acquisition profits) and the same has been disclosed under exceptional items,\" the company said in the filing.\n\"We undertook various transformational steps such as Senvion sale and equity infusion to deleverage and embark on a growth trajectory. The board has further approved Suzlon's venture into solar space,\" Suzlon Group Chairman Tulsi Tanti said in a statement.\nFor the year ended March 2015, the company's consolidated net loss widened to Rs 9,157.69 crore.\nFor year ended March 2014, the company's consolidated net loss was at Rs 3,519.97 crore.\nThe company further said its Board has given approval to embark further in the renewable sector by venturing into the solar space.\n\"Our results for FY15 were largely impacted by working capital challenges, which have now been addressed. Our business operations are now adequately funded with requisite working capital facilities to ramp up volumes,\" said Kirti Vagadia, Head of Finance, Suzlon Group.\nThe company's consolidated order book was at 1.12 GW, worth about Rs 6,886 crore.\nIt further said that it has completed the sale of Senvion for \"l billion euro and the proceeds to be primarily utilized towards debt reduction.\"\n\"Senvion to give Suzlon licence for off-shore technologies for the Indian market, while Suzlon to give Senvion the S111-2.1 MW license for the USA market,\" the statement added.\nThe shares of the company today a closed 0.59 percent down at Rs 25.20 apiece on the BSE.\n", "title": "Suzlon's loss widens to Rs 1,212 cr in Q4", "link": "http://www.moneycontrol.com/news/results/suzlons-loss-widens-to-rs-1212-crq4_1395310.html", "time": "2.34 pm "}, {"date": " 23 May 2015", "content": "May 25, 2015, 10.11 AM  | Source: PTI\nBSE drops Tata Power from Sensex; Lupin to come in\nPrivate sector electricity producer Tata Power will move out of the stock market benchmark index Sensex and will be replaced by drugmaker Lupin.\nLike this story, share it with millions of investors on M3\nBSE drops Tata Power from Sensex; Lupin to come in\nPrivate sector electricity producer Tata Power will move out of the stock market benchmark index Sensex and will be replaced by drugmaker Lupin.\nPost your opinion here\n \nPrivate sector electricity producer Tata Power  will move out of the stock market benchmark index Sensex and will be replaced by drugmaker Lupin .\nBesides, Adani Power  would be dropped from the S&P BSE 100 index, while various changes have been made to a host of other BSE indices as well.\nThe S&P BSE-100, an index of the top 100 listed companies in the country, would see Aurobindo Pharma  and Tata Motors  (DVR) coming in, while the S&P BSE-200 would get five new entries -- Ajanta Pharma , Suzlon Energy , Dewan Housing , NCC  India and Tata Motors (DVR).\nIncidentally, market watchdog Sebi is considering a new framework for regualating the index providers to put in place uniform set of guidelines for any changes in various indices.\nThe reconstitution in BSE indices will be effective from June 22, the exchange said in a statement.\nFurther, a host of changes have also been made in various other indices of BSE such as BSE 200 and BSE 500.\nIn addition, sectoral indices for bankex and Teck would also see some changes.\nIn the BSE 200 index, Suzlon Energy, Ajanta Pharma , Dewan Housing Finance Corp, NCC and Tatamotors-Dvr would be replaced by Sanofi India, Hindustan Copper, Amtek Auto and Jaiprakash Power Ventures.\n", "title": "BSE drops Tata Power from Sensex; Lupin to come in", "link": "http://www.moneycontrol.com/news/marketnews/bse-drops-tata-powersensex-lupin-to-come-in_1390696.html", "time": "12.34 pm "}, {"date": " 20 May 2015", "content": "May 20, 2015, 03.49 PM  | Source: Moneycontrol.com\nSuzlon Energy's FY15 results on May 29, 2015\nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on May 29, 2015, to approve the Audited Financial Results of the Company on Standalone and Consolidated basis for the financial year ended on March 31, 2015.\nLike this story, share it with millions of investors on M3\nSuzlon Energys FY15 results on May 29, 2015\nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on May 29, 2015, to approve the Audited Financial Results of the Company on Standalone and Consolidated basis for the financial year ended on March 31, 2015.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on May 29, 2015, to approve the Audited Financial Results of the Company on Standalone and Consolidated basis for the financial year ended on March 31, 2015.Further, as per Company's Code of Conduct to regulate, monitor and report trading by Insiders (the \"Code\") as required to be implemented in terms of the Securities and Exchange Board of India (Prohibition of Insider Trading) Regulations, 2015, the Trading Window of the Company has been closed from May 19, 2015 till May 31, 2015 (both days inclusive) for the purpose of declaration of the Audited Financial Results of the Company.Source : BSE\n", "title": "Suzlon Energy's FY15 results on May 29, 2015", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energys-fy15-resultsmay-29-2015_1388463.html", "time": "3.49 pm "}, {"date": " 18 May 2015", "content": "May 18, 2015, 04.04 PM  | Source: Moneycontrol.com\nSuzlon Group to supply 98MW to Mytrah Energy\nSuzlon Group today  announced  that  Suzlon  will  supply  98MW  project  to  Mytrah  at Nazeerabad in Ranga Reddy district of Telangana state.\nLike this story, share it with millions of investors on M3\nSuzlon Group to supply 98MW to Mytrah Energy\nSuzlon Group today  announced  that  Suzlon  will  supply  98MW  project  to  Mytrah  at Nazeerabad in Ranga Reddy district of Telangana state.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated May 18, 2015, titled \"Suzlon Group to supply 98MW to Mytrah Energy\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Group to supply 98MW to Mytrah Energy", "link": "http://www.moneycontrol.com/news/announcements/suzlon-group-to-supply-98mw-to-mytrah-energy_1386988.html", "time": "4.04 pm "}, {"date": " 15 May 2015", "content": "May 15, 2015, 02.23 PM  | Source: Moneycontrol.com\nSuzlon Energy rises 8%; to invest Rs 21000cr in Andhra\nThe company is going to invest Rs 21,000 crore in Andhra Pradesh over a period of five years.\nLike this story, share it with millions of investors on M3\nSuzlon Energy rises 8%; to invest Rs 21000cr in Andhra\nThe company is going to invest Rs 21,000 crore in Andhra Pradesh over a period of five years.\nPost your opinion here\n \nMoneycontrol Bureau\nThe share of  Suzlon Energy gained more than 8 percent intraday Friday on the back of its investment plan of Rs 21000 crore.\nThe company is going to invest Rs 21,000 crore in Andhra Pradesh over a period of five years.\nOn Wednesday, Suzlon group has won new order of 90MW turnkey project from its existing customer, ReNew Power.\nSuzlon will install its revolutionary S97 120m Hybrid Tower WTGs (wing turbine generator) with rated capacity of 2.1MW in Ratlam District, Madhya Pradesh (MP).\nThe company will install 29 WTGs at the site Kode and 14 WTGs at Limbwas site in Ratlam district. The project is scheduling for commissioning by March 2016.\nAt 13:49 hrs Suzlon Energy was quoting at Rs 25.40, up Rs 1.30, or 5.39 percent on the BSE.\nPosted by Rakesh Patil\n", "title": "Suzlon Energy rises 8%; to invest Rs 21000cr in Andhra", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-energy-rises-8-to-invest-rs-21000crandhra_1385439.html", "time": "2.23 pm "}, {"date": " 15 May 2015", "content": "May 15, 2015, 09.42 AM  | Source: Moneycontrol.com\nStocks in news: Ranbaxy, Suzlon, Wockhardt, Arvind, DLF\nStocks in news: Ranbaxy | Suzlon Energy | Wockhardt | Nitesh Estates | Arvind | Sequent Scientific | ICICI Bank | Gulf Oil | Mastek | KNR Constructions and Nectar Life are stocks, which are in news today.\nLike this story, share it with millions of investors on M3\nStocks in news: Ranbaxy, Suzlon, Wockhardt, Arvind, DLF\nStocks in news: Ranbaxy | Suzlon Energy | Wockhardt | Nitesh Estates | Arvind | Sequent Scientific | ICICI Bank | Gulf Oil | Mastek | KNR Constructions and Nectar Life are stocks, which are in news today.\nPost your opinion here\nHere are stocks that are in news today:\nMaharashtra Government Mulls Transport Policy With Pedestrian As Pivot: PTI\nArvind  Says Gujarat High Court Approves Demerger Of Realty Arm To Arvind Infra     \nExim Bank provides USD 1 bn Line of Credit to finance hydro-power, irrigation & infrastructure projects in Nepal: PTI\nCBI arrests Asst Director of Doordarshan Hanumant Rao from Vijaywada for allegedly accepting bribe of Rs 1.5 lakh\nFinance Minister Arun Jaitley says CAG not stated anything against Nitin Gadkari\nInvestors Know Our Actual Position On Retail FDI\nI Expect What Every Indian Expects  From RBI\nWill Set Up PDMA After Consultations Are Completed\nEconomy Is At A Recovering Stage, Growth Has Picked Up\nCoal & Power minister Piyush Goyal says\nGovt to approve policy on 100 GW solar power in few days\nOne Year In Govt Has Ended On A Positive Note\nIndia Now Has Sufficient Coal In Most Power Plants\nHave Been Able To Start Stranded Projects In Both Coal & Gas-based Power Plants\nGovt Committed To Serve The Poor & Farmers, Dedicated To Serve Youth & Women\nWPI & CPI Inflation Are Under Control\nOne Year Report Card Shows Govt's Commitment On Black Money Bill\nGovt Has Demonstrated Transparency In Procedure To Get In Ease Of Doing Biz\nCoal Auction To Bring Rs 1.93 Lakh Cr Over The Mining Period\n22,000 Circuit km Achievement In Transmission Is Historic Achievement\n42 Days Of Coal India Production Up By 11%\nCoal India Increased Production By 7% In FY14\n8.4% Growth Crossed In Power Generation In The Last 1 Year\nAll Targets Of Renewable Energy Were Met In The Last One Year\n1.75 Lakh MW By 2022 Is The Target For Renewable Energy Generation\nWorking On Energy Security Plan For India\nDelighted With Response Received On Energy Saving & Conservation\nIndia's Energy Consumption Will See A Saving Of 10% With Energy Conservation\nSahara Case Update:\nSupreme Court Reserves Order On Sahara's Plea To Release Subrata Roy On Bail\nDirects Sahara To Submit Investor Repayment Plan In Two Weeks\nAlert: SEBI Estimates Total Outstanding Dues At Rs 36,000 Cr\nI-T Dept Moves SC, Claims Tax Dues Of Rs 8,000 Cr\nCNBC-TV18 Exclusive: Sources Say\ne-Commerce Industry Divided Over FDI\nGovt Meet With e-Commerce Industry Inconclusive\nGovt To Explore Different Models Of FDI In e-Commerce In Next 2 Months\nFlipkart Opposes e-Commerce FDI In Business-to-Consumer (B2C), Retail\nMany Domestic Players Aligned To Flipkart View\nForeign Players Like Amazon Favour FDI In B2C, Retail\n60 e-Commerce Players Were Present In FDI Meet With DIPP\ne-Commerce Players Also Raised Issues Of State Level Taxation\ne-Commerce Players Looking To Set Up A Separate Industry Body\nCNBC-TV18 Exclusive: Sources Say\nBanks Seek Relaxation From RBI On 5:25 Rule For Refinancing Infra Loans\nBanks Yet To Refinance Projects Under 5:25 Rule\nBanks Reluctant To Make Provisions For NPV Losses\nCNBC-TV18 Alert: NPV Is Net Present Value\nRBI's Norms Requires Banks To Maintain NPV Under 5:25 Rule\nJP Assoc, GMR Infra & Lanco Infra Among Cos Awaiting Restructuring Nod\nCNBC-TV18 Alert: RBI Had Extended 525 To Existing Projects In December 2014 \n \nIDF-NBFCs Can Invest Into Sectors Where There Is No Presence Of Project Authority\nIDF-NBFCs Can Invest In Non-PPP & PPP Projects Without A Project Authority\nIDF-NBFCs Can Invest Into These Projects Provided These Are Post COD Projects\nCNBC-TV18 Alert: COD Is Commercial Operations Date\nInvestments In Non-PPP Projects Shall Be Risk Weighted\nMax Exposure On Individual Projects For IDF-NBFC To Be At 50% Total Cap Funds\nAdditional Exposure Up To 10% Can Be Taken At Discretion Of IDF-NBFC Board\nRBI May Permit Additional 15% If Financial Position Of IDF-NBFC Is Satisfactory\nMet Dept Says Monsoon May Hit Kerala Coast Around May 30\nTata Steel Says\nExpect To Recognise Non-cash Write-down Of Rs 5,000 Cr For Q4\nWrite-down Will be Related To Long Products UK Biz in European Arm\nTotal Impairment Charge For FY15 Could Be Rs 6,500 Cr\nDetails Of Impairment Will Be Reported In Earnings Scheduled On May 20\nCCI: From PTI\nFinds  DLF Guilty Of Unfair & Abusive Biz Practices In A Fresh Case\nAsks DLF To Cease & Desist From Indulging In Unfair Trade Practices\nCCI Did Not Impose Any Monetary Fine On DLF For Unfair Trade Practices\nRural Development Minister Birender Singh Says Govt Will Re-promulgate Land Acquisition Ordinance For the Third Time: PTI\nRanbaxy sued for manipulating USFDA rules\nUS class action asserts Ranbaxy manipulated\nGoldman and Nitesh Estates to jointly invest up to Rs 1600 cr in Realty\n(Nitesh was in the news yesterday for buying a mall in Pune)\nRecalls over 93000 bottles of Captotrill tablets from US\nRecall over failing to meet specifications for thickness\n", "title": "Stocks in news: Ranbaxy, Suzlon, Wockhardt, Arvind, DLF", "link": "http://www.moneycontrol.com/news/stocksnews/stocksnews-ranbaxy-suzlon-wockhardt-arvind-dlf_1385145.html", "time": "7.51 am "}, {"date": " 13 May 2015", "content": "May 13, 2015, 11.34 AM  | Source: Moneycontrol.com\nSuzlon group awarded 90MW order by ReNew Power\nSuzlon group has won new order of 90MW turnkey project from its existing customer, ReNew Power.\nLike this story, share it with millions of investors on M3\nSuzlon group awarded 90MW order by ReNew Power\nSuzlon group has won new order of 90MW turnkey project from its existing customer, ReNew Power.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated May 13, 2015 titled \"Suzlon group awarded 90MW order by ReNew Power\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon group awarded 90MW order by ReNew Power", "link": "http://www.moneycontrol.com/news/announcements/suzlon-group-awarded-90mw-order-by-renew-power_1382876.html", "time": "11.34 am "}, {"date": " 08 May 2015", "content": "May 08, 2015, 10.26 PM  | Source: PTI\nCCI approves Shanghvi's deal with Suzlon\nThe deal, announced in February this year, would see Shanghvi acquiring at least 23 percent stake in Suzlon which has been grappling with tough business conditions.\nLike this story, share it with millions of investors on M3\nCCI approves Shanghvis deal with Suzlon\nThe deal, announced in February this year, would see Shanghvi acquiring at least 23 percent stake in Suzlon which has been grappling with tough business conditions.\nPost your opinion here\n \nCompetition Commission has cleared billionaire Dilip Shanghvi's proposed Rs 1,800-crore stake buy in wind turbine maker Suzlon Energy .\nThe deal, announced in February this year, would see Shanghvi acquiring at least 23 per cent stake in Suzlon which has been grappling with tough business conditions.\nIn a tweet today, the Competition Commission of India (CCI) said it has approved \"acquisition of shares in Suzlon by Aalok D Shanghvi & Others\".\nSuzlon has entered into definitive agreements with Dilip Shanghvi Family and Associates (DSA) for equity investments of Rs 1,800 crore in the company. Post allotment, DSA would have 23 per cent stake in the wind turbine maker while the Tanti Family would have 24 per cent shareholding.\nWhen the deal was announced in February, Suzlon Group Chairman Tulsi Tanti had said that support from Shanghvi and family would help in creating a long term sustainable value for the stakeholders.\n", "title": "CCI approves Shanghvi's deal with Suzlon", "link": "http://www.moneycontrol.com/news/economy/cci-approves-shanghvis-dealsuzlon_1379471.html", "time": "8.15 pm "}, {"date": " 30 Apr 2015", "content": "Apr 30, 2015, 10.34 PM  | Source: PTI\nSuzlon Energy completes sale of its German arm Senvion\nMorgan Stanley acted as the financial advisor to Suzlon for this transaction and a Linklaters team led by Dusseldorf based corporate partner Dr. Klaus Marinus Hoenig acted as legal advisors. Suzlon Energy shares were trading 0.42 percent up at Rs 24.10 apiece in the morning session on the BSE.\nLike this story, share it with millions of investors on M3\nSuzlon Energy completes sale of its German arm Senvion\nMorgan Stanley acted as the financial advisor to Suzlon for this transaction and a Linklaters team led by Dusseldorf based corporate partner Dr. Klaus Marinus Hoenig acted as legal advisors. Suzlon Energy shares were trading 0.42 percent up at Rs 24.10 apiece in the morning session on the BSE.\nPost your opinion here\n \nWind turbine maker Suzlon Energy  on Thursday said it has completed 100 percent stake sale of its German arm Senvion to US-based Venture Capital fund Centerbridge Partners.\nIn a BSE filing, Suzlon Group said it has completed \"100 percent stake sale of Senvion SE, a wholly-owned subsidiary to Centerbridge Partners\". It further said: \"The transaction closure follows the binding agreement signed with Centerbridge Partners on 22nd January for a total cash consideration of 1 billion euro and future potential earn out of up to an additional 50 million euro.\"\nDebt-laden Suzlon had announced selling of its German subsidiary for a minor loss mainly to cut debt.\nSuzlon had acquired Senvion (earlier known as REpower) for over Rs 7,300 crore in 2007. Suzlon Group said sale of Senvion SE is aligned with its strategy to reduce the debt and focus on the home market and high growth market like US and emerging markets like China, Brazil, South Africa, Turkey and Mexico.\n\"The completion of the sale transaction has enabled Suzlon to raise around Rs 7,000 crore in cash, of which a substantial portion is intended to be utilised towards debt reduction and volume growth,\" it added.\n\"The successful completion of the transaction of Senvion sale, paves the way for the group to ramp up volumes rapidly. We are now in a strong liquidity position to tap the opportunity available in India, other emerging markets and the US,\" Suzlon Group Chairman Tulsi Tanti said.\nMorgan Stanley acted as the financial advisor to Suzlon for this transaction and a Linklaters team led by Dusseldorf based corporate partner Dr. Klaus Marinus Hoenig acted as legal advisors. Suzlon Energy shares were trading 0.42 percent up at Rs 24.10 apiece in the morning session on the BSE. \n \nSuzlon Energy stock price\nOn December 18, 2015, at  12:02 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\nREAD MORE ON   Suzlon Energy\nSet email alert for\n", "title": "Suzlon Energy completes sale of its German arm Senvion", "link": "http://www.moneycontrol.com/news/business/suzlon-energy-completes-saleits-german-arm-senvion_1371913.html", "time": "1.18 pm "}, {"date": " 30 Apr 2015", "content": "Apr 30, 2015, 08.37 AM  | Source: Moneycontrol.com\nSuzlon completes Senvion sale\nSuzlon Group has announced the completion of 100 percent stake sale of Senvion SE, a wholly owned subsidiary to Centerbridge Partners. The completion of the sale transaction has enabled Suzlon to raise approximately Rs 7000 crore  in cash, of which a substantial portion is intended to be utilized towards debt reduction and volume growth.\nLike this story, share it with millions of investors on M3\nSuzlon completes Senvion sale\nSuzlon Group has announced the completion of 100 percent stake sale of Senvion SE, a wholly owned subsidiary to Centerbridge Partners. The completion of the sale transaction has enabled Suzlon to raise approximately Rs 7000 crore  in cash, of which a substantial portion is intended to be utilized towards debt reduction and volume growth.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated April 29, 2015, titled \"Suzlon completes Senvion sale\".  Suzlon Group has announced the completion of 100 percent stake sale of Senvion SE, a wholly owned subsidiary to Centerbridge Partners. The completion of the sale transaction has enabled Suzlon to raise approximately Rs 7000 crore  in cash, of which a substantial portion is intended to be utilized towards debt reduction and volume growth.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon completes Senvion sale", "link": "http://www.moneycontrol.com/news/announcements/suzlon-completes-senvion-sale_1371822.html", "time": "8.37 am "}, {"date": " 28 Apr 2015", "content": "Apr 28, 2015, 08.49 AM  | Source: Moneycontrol.com\nTata MF buys engg, pharma, IT; sells bank\nPunjab National Bank, Gujarat Pipavav Port and ONGC were the top sells, while Ashok Leyland, Power Grid Corporation and Suzlon Energy were the top buys.\nLike this story, share it with millions of investors on M3\nTata MF buys engg, pharma, IT; sells bank\nPunjab National Bank, Gujarat Pipavav Port and ONGC were the top sells, while Ashok Leyland, Power Grid Corporation and Suzlon Energy were the top buys.\nPost your opinion here\n \nTata Mutual Fund has slashed its exposure in banking & financial services, manufacturing & tobacco. However, it has enhanced its exposure in engineering & capital goods, pharmaceuticals and information technology.\nPunjab National Bank , Gujarat Pipavav Port  and ONGC  were the top sells, while Ashok Leyland , Power Grid Corporation  and  Suzlon Energy  were the top buys.\nA study of the scheme for the quarter of Januray-March 2015 shows that in the banking & financial services, the fund sold Punjab National Bank, ICICI Bank and Oriental Bank of Commerce and exited Union Bank of India and ING Vysya Bank. However, the fund bought Housing Development Finance Corporation, IndusInd Bank and Sundaram Finance and added Cholamandalam Investment and Finance Company, LIC Housing Finance and DCB Bank.\nIn the manufacturing pack, it sold Bharat Electronics, KPR Mill and Lovable Lingerie. It also exited from Welspun India, Max India and Jain Irrigation Systems. However, the fund bought Ramkrishna Forgings and Centum Electronics in the same pack. The house also added Centum Electronics and Ramkrishna Forgings.(View - All Bulk Deals by Mutual Funds )\nThe fund sold ITC in the tobacco pack.\nIn the engineering & capital goods space, the fund bought Siemens, Alstom T&D India and Adani Ports and Special Economic Zone. It also introduced National Buildings Construction Corporation, ILandFS Transportation Networks, Suzlon Energy and Swaraj Engines in the same sector. Meanwhile, the fund sold Cummins India, IRB Infrastructure Developers and\nThermax.\nThe fund introduced Cadila Healthcare, Pfizer and Abbott India and purchased Lupin, Divis Laboratories and Strides Arcolab in the pharmaceutical segment. However, it sold Ipca Laboratories and exited Torrent Pharmaceuticals in the same space. (Check out - Which sectors are attracting Fund Managers? )\nIn the information technology sector, it bought Infosys, HCL Technologies and NIIT Technologies, while it sold Persistent Systems, Tata Consultancy Services and Tech Mahindra. Meanwhile, it also introduced Tata Elxsi in the same space.\nTable of Stocks bought/ sold by Tata Mutual Fund...contd on Page 2\nFor more Mutual Fund Action in Market click here\nQ\n", "title": "Tata MF buys engg, pharma, IT; sells bank", "link": "http://www.moneycontrol.com/news/mfanalysis/tata-mf-buys-engg-pharma-it-sells-bank_1368689.html", "time": "8.49 am "}], [{"date": " 06 Apr 2015", "content": "Apr 06, 2015, 09.05 AM  | Source: CNBC-TV18\nHere are top 10 stocks to focus on April 6\nHere are top 10 stocks to focus on April 6 - Idea Cellular, Aban Offshore, IGL, Reliance Infra, Tata Power, Sun Pharma, Coal India, TVS Motor, Hero Moto and Tata Motors.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to focus on April 6\nHere are top 10 stocks to focus on April 6 - Idea Cellular, Aban Offshore, IGL, Reliance Infra, Tata Power, Sun Pharma, Coal India, TVS Motor, Hero Moto and Tata Motors.\nPost your opinion here\n", "title": "Here are top 10 stocks to focus on April 6", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-focusapril-6_1349377.html", "time": "8.47 am "}, {"date": " 25 Mar 2015", "content": "Mar 25, 2015, 02.47 PM  | Source: Reuters\nSun Pharma open to large acquisitions post Ranbaxy deal\nThe company will look to invest more than USD 300 million in research and development and is not considering any job cuts post the close of the deal, Managing Director Dilip Shanghvi told reporters in Mumbai.\nLike this story, share it with millions of investors on M3\nSun Pharma open to large acquisitions post Ranbaxy deal\nThe company will look to invest more than USD 300 million in research and development and is not considering any job cuts post the close of the deal, Managing Director Dilip Shanghvi told reporters in Mumbai.\nPost your opinion here\n \nSun Pharmaceutical Industries Ltd , India's largest drugmaker by sales, said on Wednesday its USD 3.2 billion acquisition of smaller rival Ranbaxy Laboratories Ltd  will not restrict it from making further large acquisitions.\nThe company will look to invest more than USD 300 million in research and development and is not considering any job cuts post the close of the deal, Managing Director Dilip Shanghvi told reporters in Mumbai.\nShanghvi, who founded Sun Pharma and is one of the country's richest men, added that the company's \"most important focus\" would be to win confidence of regulators.\nSun Pharma's third-quarter profit was hit by costs incurred to address observations raised by the US Food and Drug Administration after an inspection of the company's manufacturing plant in western India.\n\"Every investment I have made outside of Sun is financial, I have no interest in running those businesses,\" said Shanghvi, who invested USD 290 million for a 23 percent stake in wind turbine maker Suzlon Energy  Ltd last month.\nThe company's shares were up 1 percent in afternoon trading on Wednesday, while the benchmark index was down 0.16 percent.\nSun Pharma stock price\nOn December 18, 2015, at  12:04 hrs Sun Pharmaceutical Industries was quoting at Rs 797.95, down Rs 4.65, or 0.58 percent. The 52-week high of the share was Rs 1200.70 and the 52-week low was Rs 706.40.\nThe latest book value of the company is Rs 94.62 per share. At current value, the price-to-book value of the company was 8.43.\n", "title": "Sun Pharma open to large acquisitions post Ranbaxy deal", "link": "http://www.moneycontrol.com/news/business/sun-pharma-open-to-large-acquisitions-post-ranbaxy-deal_1339212.html", "time": "2.26 pm "}, {"date": " 23 Mar 2015", "content": "Mar 23, 2015, 11.31 AM  | Source: Moneycontrol.com\nSuzlon receives shareholders and CDR EG approval for Senvion sale\nSuzlon Energy has received shareholders and CDR EG (Empowered Group) approval for Senvion sale and issue of upto 100 Crores equity shares on preferential basis\nLike this story, share it with millions of investors on M3\nSuzlon receives shareholders and CDR EG approval for Senvion sale\nSuzlon Energy has received shareholders and CDR EG (Empowered Group) approval for Senvion sale and issue of upto 100 Crores equity shares on preferential basis\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated March 23, 2015, titled \"Suzlon receives shareholders and CDR EG (Empowered Group) approval for Senvion sale and issue of upto 100 Crores equity shares on preferential basis\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon receives shareholders and CDR EG approval for Senvion sale", "link": "http://www.moneycontrol.com/news/announcements/suzlon-receives-shareholderscdr-eg-approval-for-senvion-sale_1336796.html", "time": "11.31 am "}, {"date": " 21 Mar 2015", "content": "Mar 21, 2015, 11.22 AM  | Source: Moneycontrol.com\nVan Eck Associates Corp sells 24.18 shares of Suzlon Energy\nOn March 20, 2015 Van Eck Associates Corporation sold 2,24,18,094 shares of Suzlon Energy.\nLike this story, share it with millions of investors on M3\nVan Eck Associates Corp sells 24.18 shares of Suzlon Energy\nOn March 20, 2015 Van Eck Associates Corporation sold 2,24,18,094 shares of Suzlon Energy.\nPost your opinion here\n \nOn March 20, 2015 Van Eck Associates Corporation sold 2,24,18,094 shares of  Suzlon Energy 27.19 on the NSE.\nOn Friday, Suzlon Energy ended at Rs 27, down Rs 1.65, or 5.76 percent.\nThe share touched its 52-week high Rs 36.80 and 52-week low Rs 10.32 on 12 June, 2014 and 27 March, 2014, respectively.\n", "title": "Van Eck Associates Corp sells 24.18 shares of Suzlon Energy", "link": "http://www.moneycontrol.com/news/buzzingstocks/van-eck-associates-corp-sells-2418-sharessuzlon-energy_1335805.html", "time": "11.22 am "}, {"date": " 17 Mar 2015", "content": "Mar 17, 2015, 03.13 PM  | Source: Moneycontrol.com\nSuzlon Energy up 4%; HDFC Sec initiates coverage with buy\nShares of Suzlon Energy gained 4.4 percent intraday on Tuesday after brokerage house HDFC Securities initiated coverage with a buy and target price of Rs 34 apiece.\nLike this story, share it with millions of investors on M3\nSuzlon Energy up 4%; HDFC Sec initiates coverage with buy\nShares of Suzlon Energy gained 4.4 percent intraday on Tuesday after brokerage house HDFC Securities initiated coverage with a buy and target price of Rs 34 apiece.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of  Suzlon Energy gained 4.4 percent intraday on Tuesday after brokerage house HDFC Securities initiated coverage with a buy on the stock and set a target price of Rs 34 apiece.\nHaving faced multiple crises over FY09-14, the brokerage believes Suzlon is on the cusp of a turnaround. Suzlon has aggressively reduced debt from its heavily levered balance sheet by divesting its German subsidiary Senvion (for Euro 1 billion) and via a preferential issue of Rs 1,800 crore to Dilip Shanghvi and Associates (DSA).\n\"These developments will enable the company to not only reduce debt but also provide much needed working capital to ramp up business in the rapidly growing Indian wind energy market,\" said HDFC Securities in its note.\nWith the NDA government’s ambitious plans for renewable energy, the brokerage expects favourable policy environment for wind power to continue, adding it is among a handful of listed companies levered to India’s fast growing renewables industry.\nThe Indian wind energy market is set for a big leap as accelerated depreciation (AD) and generation based incentives (GBI) have been re-introduced. The NDA government has ambitious plans of adding 38GW over FY15-22.\nSuzlon has the best overall product offering and it lost market share primarily owing to funding constraints.\nAided by significant operating and financial leverage, HDFC Securities expects Suzlon’s earnings to grow manifold over the next few years.\n\"As 25 percent of Suzlon’s expenses are fixed in nature (FY16E), we expect a quantum jump in profits as volumes ramp up. We expect Suzlon to achieve profit before tax break-even in FY16E (1,250MW of sales, 150 percent increase over FY15E), which implies 35 percent market share. This looks plausible, given the company’s order book of 1,147MW. With a capacity of 3.6GW, Suzlon can further ramp up volumes without incurring significant capex,\" it explained.\nAt 14:37 hours IST, the scrip of Suzlon Energy was quoting at Rs 26.55, up Rs 0.55, or 2.12 percent on the BSE.\nPosted by Sunil Shankar Matkar\nALSO READ\n", "title": "Suzlon Energy up 4%; HDFC Sec initiates coverage with buy", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-energy4-hdfc-sec-initiates-coveragebuy_1331575.html", "time": "3.13 pm "}, {"date": " 09 Mar 2015", "content": "Mar 09, 2015, 11.53 AM  | Source: Moneycontrol.com\nSuzlon Energy gains 4.5%, may sell forging & foundry unit\nInvestors continued to lap up shares of Suzlon Energy on Monday as the debt-laden wind-turbine manufacturer may sell its forging & foundry unit.\nLike this story, share it with millions of investors on M3\nSuzlon Energy gains 4.5%, may sell forging & foundry unit\nInvestors continued to lap up shares of Suzlon Energy on Monday as the debt-laden wind-turbine manufacturer may sell its forging & foundry unit.\nPost your opinion here\n \nInvestors continued to lap up shares of  Suzlon Energy on Monday as the debt-laden wind-turbine manufacturer may sell its forging & foundry unit. The stock gained 4.5 percent intraday.\n\"Suzlon is keen to sell its forging and foundry company, in which it invested Rs 1,000 crore, and component units and office complexes worth about Rs 1,000 crore as it exits non-core areas and continues its fund-raising drive,\" said a media report.\nThe forging plant is in Baroda and the foundry plant is in Coimbatore.\nMeanwhile, the world’s fifth largest wind turbine manufacturer Suzlon, on January 22, had sold 100 percent stake in Senvion SE (a wholly owned subsidiary of the Suzlon Group) to Centerbridge Partners LP, USA. The deal was valued at euro 1 billion (approximately Rs 7,200 crore) equity value in an all cash transaction and future earn out of upto an additional euro 50 million (approximately Rs 360 crore).\nThe cash starved Suzlon, on February 13, signed definitive agreements with Dilip Shanghvi Family and Associates (DSA) for equity investments of Rs 1,800 crore in Suzlon Energy Limited. Post allotment, DSA shareholding will be 23 percent shares (based on current shareholding), while the Tanti Family will hold 24 percent shares.\nAt 11:24 hours IST, the scrip of Suzlon Energy was quoting at Rs 27.15, up Rs 0.70, or 2.65 percent on the BSE.\nALSO READ\n", "title": "Suzlon Energy gains 4.5%, may sell forging & foundry unit", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-energy-gains-45-may-sell-forgingfoundry-unit_1323607.html", "time": "11.53 am "}], [{"date": " 27 Feb 2015", "content": "Feb 27, 2015, 09.06 AM  | Source: CNBC-TV18\nHere are top 10 stocks to focus on February 27\nHere are top 10 stocks to focus on February 27 - GMR Infra, Century Textiles, Bank of Baroda, Punjab National Bank, Bank of India, Canara Bank, IDBI Bank, Rolta, BEL and Tata Power.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to focus on February 27\nHere are top 10 stocks to focus on February 27 - GMR Infra, Century Textiles, Bank of Baroda, Punjab National Bank, Bank of India, Canara Bank, IDBI Bank, Rolta, BEL and Tata Power.\nPost your opinion here\n", "title": "Here are top 10 stocks to focus on February 27", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-focusfebruary-27_1315256.html", "time": "8.55 am "}, {"date": " 25 Feb 2015", "content": "Feb 25, 2015, 10.20 AM  | Source: Moneycontrol.com\nGlobal mkts mixed; green Nifty opening seen today\nGlobally, the US markets closed the trading day at 15-year highs after the US Federal Reserve Chairperson Janet Yellen said the central bank will remain patient on rate hikes.\nLike this story, share it with millions of investors on M3\nGlobal mkts mixed; green Nifty opening seen today\nGlobally, the US markets closed the trading day at 15-year highs after the US Federal Reserve Chairperson Janet Yellen said the central bank will remain patient on rate hikes.\nPost your opinion here\n \nThe Indian equity market is expected to open in the green today after yet another volatile trading day. The SGX Nifty, an indicator of the market opening, was trading at 8794, up 21 points.\nGlobally, the US markets closed the trading day at 15-year highs after the US Federal Reserve Chairperson Janet Yellen said the central bank will remain patient on rate hikes.\nAsian trade is mixed with Japan’s Nikkei relatively under performing as the dollar-yen fell closer to the 118 levels.\nEuropean equities, meanwhile, ended in positive territory after the approval of Greece’s bailout extension plan helped.\nBack home, battling numerous litigations, the government has deferred the next round of coal block auctions. Coal Secretary Anil Swarup said the auctions, which were supposed to start today, will now be held on March 4.\nAnd after Suzlon , Sun Pharma 's Dipil Shanghvi is set to step up his investment drive as a 47 percent stake in  Hindustan Oil Exploration Company (HOEC) is next on his radar.\nIn other asset classes, Brent Crude slipped to USD 58 per barrel and precious metal gold edged marginally higher after Yellen’s comments on considering any hike on a \"meeting-by-meeting basis.\"\n", "title": "Global mkts mixed; green Nifty opening seen today", "link": "http://www.moneycontrol.com/news/marketcues/global-mkts-mixed-green-nifty-opening-seen-today_1312994.html", "time": "7.43 am "}, {"date": " 24 Feb 2015", "content": "Feb 24, 2015, 01.55 PM  | Source: Moneycontrol.com\nSuzlon Energy completes installing and commissioning of over 350 MW project\nSuzlon Group has successfully completed installing and commissioning of over 350 MW wing energy in Brazil over a period of 16 months ending Nov 2014 with bulk of 309 MW being added in CY 2014.\nLike this story, share it with millions of investors on M3\nSuzlon Energy completes installing and commissioning of over 350 MW project\nSuzlon Group has successfully completed installing and commissioning of over 350 MW wing energy in Brazil over a period of 16 months ending Nov 2014 with bulk of 309 MW being added in CY 2014.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated February 24, 2015, titled \"Suzlon partners Brazil's resolve in meeting the country's power need by adding 350 MW of wind energy capacity\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Energy completes installing and commissioning of over 350 MW project", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-completes-installingcommissioningover-350-mw-project_1312061.html", "time": "1.55 pm "}, {"date": " 24 Feb 2015", "content": "Feb 24, 2015, 12.51 PM  | Source: PTI\nSuzlon up 7% on buzz of financial security from Shanghvi\nShares of Suzlon Energy today surged over 7 percent amid reports that Sun Pharma's Dilip Shanghvi will provide as much as Rs 3,800 crore of security that will help the wind turbine maker in availing credits.\nLike this story, share it with millions of investors on M3\nSuzlon up 7% on buzz of financial security from Shanghvi\nShares of Suzlon Energy today surged over 7 percent amid reports that Sun Pharma's Dilip Shanghvi will provide as much as Rs 3,800 crore of security that will help the wind turbine maker in availing credits.\nPost your opinion here\n \nShares of  Suzlon Energy today surged over 7 percent amid reports that Sun Pharma 's Dilip Shanghvi will provide as much as Rs 3,800 crore of security that will help the wind turbine maker in availing credits.\nFollowing the buzz, shares of Suzlon jumped 7.32 percent to Rs 27.10 on the BSE. On the NSE, it climbed 7.32 percent to Rs 27.10.\nDilip Shanghvi is the founder and managing director of Sun Pharmaceuticals. As per reports, Dilip Shanghvi will provide as much as Rs 3,800 crore (USD 610 million) of security for Suzlon Energy to help the maker of wind turbines fill orders and return to profit.\nThe security from the Shanghvi family will make it easier for Suzlon to obtain more bank guarantees and letters of credit to ramp up its business, it said.\nMeanwhile, earlier this month, Suzlon signed definitive pacts with DSA for equity investment of Rs 1,800 crore in the company, amounting to 23 percent stake. DSA also announced an open offer to acquire 26 percent stake in Suzlon at Rs 18 per share aggregating to Rs 2,837 crore.\n", "title": "Suzlon up 7% on buzz of financial security from Shanghvi", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon7buzzfinancial-securityshanghvi_1311968.html", "time": "12.51 pm "}, {"date": " 18 Feb 2015", "content": "Feb 18, 2015, 12.20 PM  | Source: CNBC-TV18\nHere are Prakash Diwan's top trading ideas\nWatch the interview of Prakash Diwan of Altamount Capital Management with Latha Venkatesh & Sonia Shenoy on CNBC-TV18, in which he shared his reading and outlook on market and specific stocks.\nLike this story, share it with millions of investors on M3\nHere are Prakash Diwans top trading ideas\nWatch the interview of Prakash Diwan of Altamount Capital Management with Latha Venkatesh & Sonia Shenoy on CNBC-TV18, in which he shared his reading and outlook on market and specific stocks.\nPost your opinion here\nWatch the interview of Prakash Diwan of Altamount Capital Management with Latha Venkatesh & Sonia Shenoy on CNBC-TV18, in which he shared his reading and outlook on specific stocks.\nBelow is the verbatim transcript of Prakash Diwan's interview with CNBC-TV18.\nSKS Microfinance\nSKS Microfinance  has done very well, rallied and everybody has enjoyed the kind of runup but the bout of profit taking has been quite severe without much of negative triggers. Even if we see the numbers, there is nothing to upset long-term investors and given the fact that the government is now working so hard on the last mile connectivity with the people with the payment mechanism, the potential continues to be very strong for SKS to grow it's book and all its securitisation has been at very good rates. The kind of mess up that we have had has already kind of exercised of sorts, there is nothing pending in terms of litigation against the company.\nMy sense is any fresh borrowing could improve ROEs dramatically, that means the stock is undervalued as compared to a lot of these non-banking financial companies (NBFCs). So it went up, it has come down, so these are stocks, which quietly again rise up. At these levels\nnot only it is likely to play catch up but the growth is also going to be end of compounded annual growth rate (CAGR) of at least about 30-35 percent. So I don’t think we should miss out on that.\nSuzlon Energy & Pipavav Defence\nI would touch Suzlon Energy  and Pipavav Defence . Disclosure is, I have exposure to Suzlon at least. Very clearly it is a company that could breathe into. The best part is the positivity around it; everybody is going to support it. State Bank of India  (SBI) gets Rs 6000 crore off and that itself is big. The day results were announced, people thought it were\ngreat numbers that SBI went up 6 percent but it was also on the back of this news that Rs 6000 crore is going to released from the Suzlon debt. So, these are very positive things.\nIt makes a lot of sense for anybody who has got capital to revive this business because it is one of the best placed businesses given the government’s focus on reviving them. The rest all plays put together might not add up to the capacity that Suzlon has on the wind energy\nside. So, it is great news but the dynamics and the open offer will take time to settle down. According to me Rs 18 is just the start; I don’t see revisions come up.\nIt is the same story with Pipavav Defence. It is one of the most established businesses. It would take about 4-5 years to set that kind of a base up. So, a group like Mahindra and Mahindra  which has always been very focused onto defence has to get into it and at some stage will find it cheap to grow inorganically rather than spend too much of time. So, they have the capabilities to scale up which SKIL is struggling with for whatever reasons. So, it is a great combination out there as well.\nCement\nAll large cement players are offering a very good opportunity for some sort of a re-rating except people have issues with valuation in some of them. If I were to pay top dollar I would still go with UltraTech Cement .\nIf I had to stick my neck out in the high premium it would still be UltraTech because of the kind of footprint that it has developed. So, Ambuja Cements  and ACC  put together might be able to counter UltraTech. It has got great strength but the smaller ones are where the\npromise lies, where your EV/EBITDA per tonne is much more scalacble in terms of profit. Mangalam Cement  disappointed, my favourite is Prism Cement . The domesticfication is so perfect, everything is in place and it is backed by a developer group. So there is always captive business on that side.\n", "title": "Here are Prakash Diwan's top trading ideas", "link": "http://www.moneycontrol.com/news/marketoutlook/hereprakash-diwans-top-trading-ideas_1306489.html", "time": "9.25 am "}, {"date": " 18 Feb 2015", "content": "Feb 18, 2015, 09.01 AM  | Source: Moneycontrol.com\nEmerging India Focus sells 2.72 cr shares of Suzlon Energy\nOn February 16, 2015 Emerging India Focus Fund - FCCB sold 2,72,68,752 shares of Suzlon Energy.\nLike this story, share it with millions of investors on M3\nEmerging India Focus sells 2.72 cr shares of Suzlon Energy\nOn February 16, 2015 Emerging India Focus Fund - FCCB sold 2,72,68,752 shares of Suzlon Energy.\nPost your opinion here\n \nOn February 16, 2015 Emerging India Focus Fund - FCCB sold 2,72,68,752 shares of Suzlon Energy at Rs 22.34 on the NSE.\nOn Monday,  Suzlon Energy ended at Rs 22.95, up Rs 3.80, or 19.84 percent.\nThe share touched its 52-week high Rs 36.80 and 52-week low Rs 10.32 on 12 June, 2014 and 27 March, 2014, respectively.\nThe latest book value of the company is Rs 8.37 per share. At current value, the price-to-book value of the company was 2.74.\n", "title": "Emerging India Focus sells 2.72 cr shares of Suzlon Energy", "link": "http://www.moneycontrol.com/news/buzzingstocks/emerging-india-focus-sells-272-cr-sharessuzlon-energy_1306463.html", "time": "9.01 am "}, {"date": " 18 Feb 2015", "content": "Feb 18, 2015, 08.50 AM  | Source: CNBC-TV18\nHere are top 10 stocks to focus on February 18\nHere are top 10 stocks to focus on February 18 - ITC, Pipavav Defence, JP Associates, Hindalco, Infosys, Suzlon, Rel Power, Hero Motocorp, Reliance Industries and Bharti Airtel. Our research team is also tracking HDIL, DB Realty, Oberoi Realty, Lupin, Tata Motors, HCL Infosystems, Eicher Motors, Concor, Gateway Distriparks and Saint Gobain.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to focus on February 18\nHere are top 10 stocks to focus on February 18 - ITC, Pipavav Defence, JP Associates, Hindalco, Infosys, Suzlon, Rel Power, Hero Motocorp, Reliance Industries and Bharti Airtel. Our research team is also tracking HDIL, DB Realty, Oberoi Realty, Lupin, Tata Motors, HCL Infosystems, Eicher Motors, Concor, Gateway Distriparks and Saint Gobain.\nPost your opinion here\n", "title": "Here are top 10 stocks to focus on February 18", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-focusfebruary-18_1306461.html", "time": "8.39 am "}], [{"date": " 16 Feb 2015", "content": "Feb 16, 2015, 03.01 PM  | Source: CNBC-TV18\nCheckout stocks that are buzzing most today\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have  Infosys, Sun pharma, Suzlon, Opto Circuits, Cox & Kings, CESC, Unitech, Essar Shipping, HDIL and DB Realty.\nLike this story, share it with millions of investors on M3\nCheckout stocks that are buzzing most today\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have  Infosys, Sun pharma, Suzlon, Opto Circuits, Cox & Kings, CESC, Unitech, Essar Shipping, HDIL and DB Realty.\nPost your opinion here\n", "title": "Checkout stocks that are buzzing most today", "link": "http://www.moneycontrol.com/news/stocksviews/checkout-stocks-thatbuzzing-most-today-_1304366.html", "time": "3.01 pm "}, {"date": " 16 Feb 2015", "content": "Home » News » Stocks to Watch\nFeb 16, 2015, 03.05 PM  | Source: CNBC-TV18\nSix in Sixty: Stocks you should keep on your radar\nCNBC-TV18's Sonia Shenoy lists out stocks that you should focus on.\nFinancial Markets Anchor & Research Analyst\nLike this story, share it with millions of investors on M3\nSix in Sixty: Stocks you should keep on your radar\nCNBC-TV18's Sonia Shenoy lists out stocks that you should focus on.\nPost your opinion here\n", "title": "Six in Sixty: Stocks you should keep on your radar", "link": "http://www.moneycontrol.com/news/stockstowatch/sixsixty-stocks-you-should-keepyour-radar_1304365.html", "time": "2.53 pm "}, {"date": " 16 Feb 2015", "content": "Feb 16, 2015, 12.33 PM  | Source: Moneycontrol.com\nSuzlon shrugs off weak Q3, climbs 18% on deal with Shanghvi\nDilip Shanghvi has agreed to buy a 23 percent stake in Indian wind turbine maker Suzlon Energy for about USD 290 million.\nLike this story, share it with millions of investors on M3\nSuzlon shrugs off weak Q3, climbs 18% on deal with Shanghvi\nDilip Shanghvi has agreed to buy a 23 percent stake in Indian wind turbine maker Suzlon Energy for about USD 290 million.\nPost your opinion here\n \nMoneycontrol Bureau\nShares of  Suzlon Energy surged over 18 percent intraday on Monday despite increasing loss in December quarter. What is driving the stock is a deal with  Sun Pharmaceutical founder Dilip Shanghvi.\nShanghvi has agreed to buy a 23 percent stake in Indian wind turbine maker Suzlon Energy for about USD 290 million.\nThe India's second-richest man will pay Rs 1800 crore through Dilip Shanghvi Family and Associates (DSA) for 1 billion new shares in Suzlon, issued by way of a preferential allotment. Shanghvi's investment firm and Suzlon will also form a wind farm joint venture for the development of 450 megawatt (MW) of wind farms, a company statement said.\nLoss-making Suzlon has been under pressure over the last few years due to a slowdown in global turbine sales and a growing debt pile. It was forced to restructure USD 1.8 billion of debt after defaulting on a USD 200 million convertible bond redemption in 2012.\nThe deal will provide Suzlon with much needed liquidity and the company said it would also use the cash to tap opportunities in India and growth markets like the United States, China, Brazil, South Africa, Turkey and Mexico.\nMeanwhile, the debt-laden wind turbine maker reported a widening of consolidated net loss at Rs 6,538.68 crore for the third quarter ended December 2014 on the back of sale of its overseas subsidiary Senvion.\nIts total income declined marginally to Rs 4,977.18 crore during the October-December quarter as against Rs 5,052.2 crore in the third quarter of FY14. Last month, the company had sold Senvion to Centrebridge Partners LP for Rs 7,200 crore as part of its strategy to hive off non-core businesses and reduce debt burden of over Rs 17,000 crore.\nAt 09:38 hrs Suzlon Energy was at Rs 21.75, up Rs 2.60, or 13.58 percent on the BSE.\n(With inputs from agencies)\n", "title": "Suzlon shrugs off weak Q3, climbs 18% on deal with Shanghvi", "link": "http://www.moneycontrol.com/news/buzzingstocks/suzlon-shrugs-off-weak-q3-climbs-18dealshanghvi_1304089.html", "time": "9.54 am "}, {"date": " 16 Feb 2015", "content": "Feb 16, 2015, 09.00 AM  | Source: CNBC-TV18\nHere are top 10 stocks to keep an eye on February 16\nHere are top 10 stocks to keep an eye on February 16 - Union Bank, BPCL, ONGC, Oil India, Hindalco, Suzlon, Sun Pharma, SBI, Bhushan Steel and Eicher Motor. Our research team is also tracking a host of other earnings reactions like Essar Shipping, Den Networks, Prime Focus, KSK Energy, Tilaknagar Industries, Dredging Corp, GMR Infra and JK Cement.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to keep an eye on February 16\nHere are top 10 stocks to keep an eye on February 16 - Union Bank, BPCL, ONGC, Oil India, Hindalco, Suzlon, Sun Pharma, SBI, Bhushan Steel and Eicher Motor. Our research team is also tracking a host of other earnings reactions like Essar Shipping, Den Networks, Prime Focus, KSK Energy, Tilaknagar Industries, Dredging Corp, GMR Infra and JK Cement.\nPost your opinion here\n", "title": "Here are top 10 stocks to keep an eye on February 16", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-keepeyefebruary-16_1304050.html", "time": "8.48 am "}, {"date": " 14 Feb 2015", "content": "Feb 14, 2015, 03.51 PM  | Source: PTI\nSuzlon's Q3 net loss widens to Rs 6,538.68 crore\nSuzlon had reported a loss of Rs 1,075.25 crore in the corresponding period a year ago. Its total income declined marginally to Rs 4,977.18 crore during the October-December quarter as against Rs 5,052.2 crore in the third quarter of FY14\nLike this story, share it with millions of investors on M3\nSuzlons Q3 net loss widens to Rs 6,538.68 crore\nSuzlon had reported a loss of Rs 1,075.25 crore in the corresponding period a year ago. Its total income declined marginally to Rs 4,977.18 crore during the October-December quarter as against Rs 5,052.2 crore in the third quarter of FY14\nPost your opinion here\n \nDebt-laden wind turbine maker  Suzlon today reported a widening of consolidated net loss at Rs 6,538.68 crore for the third quarter ended December 2014 on the back of sale of its overseas subsidiary Senvion.\nThe company had reported a loss of Rs 1,075.25 crore in the corresponding period a year ago. Its total income declined marginally to Rs 4,977.18 crore during the October-December quarter as against Rs 5,052.2 crore in the third quarter of FY14.\n\"The huge loss during the quarter is on account of the notional loss to the extent of around Rs 6,000 crore on the sale of our overseas subsidiary Senvion last month,\" the company's Chairman Tulsi Tanti told PTI here today. Last month, the company had sold Senvion to Centrebridge Partners LP for Rs 7,200 crore as part of its strategy to hive off non-core businesses and reduce debt burden of over Rs 17,000 crore.\n\"Most of the proceeds of this deal will be used to pay off our debt. Besides, we are also looking at selling stake in SE Forge, another non-core business,\" he said. However, he did not disclose further details on how much the company is expecting from the sale of subsidiary. \"It is too premature to talk about this.\nBut we will be using the funds raised through the sale for repaying our debt,\" Tanti said. The company has also sold stake in its manufacturing capacity in China as well as in US-based Big Sky wind farm. Meanwhile, the company has also signed definitive agreements with Dilip Shanghvi Family and Associates (DSA) for equity investments of Rs 1,800 crore in Suzlon Energy.\nPost allotment, DSA shareholding will be 23 per cent shares (based on current shareholding), while the Tanti Family will hold 24 per cent shares. Management control will remain with Tanti family by virtue of pooling arrangement for voting. \"All the strategic initiatives are extremely crucial and will pave the way for our growth.\nThese bold steps will strengthen our capital structure permanently, enabling significant de-leveraging and liquidity to ramp up volumes rapidly,\" he said. The proceeds of both the transactions are expected to be received before March 31, he added. Both Suzlon and Sanghvi will form a joint venture to develop 450 MW with farm, a move that will mark the latter's foray into the renewable energy business.\nBesides, the Sanghvi Family and Associates will provide project specific non-fund capital for two years, which will be utilised for execution and capacity utilisation, Tanti said.\n", "title": "Suzlon's Q3 net loss widens to Rs 6,538.68 crore", "link": "http://www.moneycontrol.com/news/results/suzlons-q3-net-loss-widens-to-rs-653868-crore_1303276.html", "time": "3.07 pm "}, {"date": " 13 Feb 2015", "content": "Feb 13, 2015, 09.31 AM  | Source: CNBC-TV18\nStocks in news: SBI, M&M, BHEL, Coal India, ICICI, Cipla\nSBI | M&M | Lupin | BHEL | Coal India | ICICI Bank | Sun Pharma | Cipla | Suzlon Energy | Tata Steel | Ahluwalia Contract | NRB Bearing | Sunil Hitech | Trident | Jayaswal Neco | Amtek Auto | Claris Life | SpiceJet | Gitanjali Gems | Mangalore Chemicals | Gillette India | Future Retail  and Titan are stocks, which are in the news today.\nLike this story, share it with millions of investors on M3\nStocks in news: SBI, M&M, BHEL, Coal India, ICICI, Cipla\nSBI | M&M | Lupin | BHEL | Coal India | ICICI Bank | Sun Pharma | Cipla | Suzlon Energy | Tata Steel | Ahluwalia Contract | NRB Bearing | Sunil Hitech | Trident | Jayaswal Neco | Amtek Auto | Claris Life | SpiceJet | Gitanjali Gems | Mangalore Chemicals | Gillette India | Future Retail  and Titan are stocks, which are in the news today.\nPost your opinion here\n \nHere are stocks that are in news today:\nResults Today: Mahindra and Mahindra , SBI , BPCL , IOC , HPCL , Oil India , REC , SAIL , Reliance Communications , Suzlon Energy , Unitech , United Breweries, NBCC, Eicher Motors, BGR Energy Systems, Gujarat State Petronet, GVK Power, IVRCL, MCX, MOIL, MphasiS, MRPL, OFSS, Punj Lloyd, Puravankara Projects, ABG Shipyard, Bosch, Clutch Auto, DD Realty, Dishman Pharma, Dwarikesh Sugar, Educomp Solutions, Ashiana Housing, Bank of Maharashtra, Eros International, Ess Dee Aluminium, Fortis Healthcare, Gammon India, Golden Tobacco, HT Media, IL&FS Transportation, LT Foods, Lumax Auto, Man Industries, MIRC Electronics, Nestle, Orbit Corporation, Orchid Chemicals, Panacea Biotec, Patel Engineering, Phoenix Mills, Pipavav Defence, Pratibha Industries, Seamec, Sical Logistics, Simbhaoli Sugars, Simplex Projects, SREI Infrastructure Finance, Subros, Venus Remedies\nAviation/tyre stocks in focus\n-Competition Commission probing airlines, tyre makers for alleged cartels\n-If any cartels were found, fines of as much as 10 percent of a company’s revenue or profit could be imposed: TOI\nICICI Bank\n-ICICI Bank and Prudential PLC are looking to sell 5 percent stake in their insurance JV, ICICI Pru Life to PE firms and sovereign wealth funds\n-This is in anticipation of Parliament clearing the ordinance raising the foreign investment cap in the sector to 49 percent: ET\n-In asset purchase agreement with Johnson & Johnson\n-To acquire Savlon & Shower to shower from Johnson & Johnson\n-In advanced negotiations to invest about USD 30 million (Rs 187 crore) in online jewellery retailer CaratLane for 15 percent equity stake: ET\n-The deal is likely to be signed in a few weeks\n-Values CaratLane's Rs 1,200 crore\n-CaratLane was last valued at Rs 750 crore in October 2014, when Tiger Global invested USD 31 million in it\nPharma stocks in focus\n-Pharma exports may miss target on regulatory delays\n-Industry body Pharmexcil expects growth to be only half of 10 percent target for FY15: ET\n-Is in the process of scrapping its insurance partner Aviva for a venture with Birla Sun Life Insurance as it is losing traction amid uncertain future\n-The UK parent declared that it plans to exit India: ET\nAmulya Leasing & Finance : Board meeting on February 23\n-The proposal of merger of Apollo Pipes (a 50.96 percent subsidiary Company) with the company\n-The proposal to raise funds for business expansion/diversification through various means like private equity fund, preferential allotment/public offering of warrants/equity shares, preference shares, debentures, ADR/GDR etc\n-Tata Steel Europe to acquire Nordic Strip Products Services Centres\n-Tata Steel Europe to acquire 3 service centres in Sweden, Finland & Norway\n-Tata Steel Europe to acquire remaining 50 percent stake in service centre Norsk Stal Tynnplater in Norway\n \n-Net sales aided by higher volumes & strong aluminium realisation\n-Aluminium LME has been moving with strength\n-Copper LME has corrected USD 2,000 per tonne in past 6 months\n-Parent company enters inter-conditional agreement with Novartis AG\n-GSK Plc will acquire Novartis’ vaccines business and manufacturing units\n-GSK Plc will sell rights to marketed oncology portfolio to Novartis\n-Transaction will be profit neutral for the company\nSun Pharma 's Sudhir Valia to invest Rs 100 crore in Pay Point\n-Sudhir Valia to acquire 50 percent stake in Pay Point\nAlert: Pay Point has applied for payments bank licence\nAlert: Valia's investment in Pay Point is in his personal capacity\n-NASSCOM guidance understated by 2-3 percent due to currency impact\n-Business environment continues to remain volatile\n-Europe business continues to see pressure\n-Seeing marginal uptick in North America market\n-Will have more clarity on FY16 outlook by April\n-Attrition is coming down, may come to 12-14 percent in next 2-3 quarters\nIndiGo President Aditya Ghosh says\n-Not in talks with foreign investors w.r.t. stake sale\n-Nothing new on IPO; have no plans to list airline yet\n-Looking at expanding company's international fleet\n-Will largely remain a domestic carrier\n-Consolidated net profit down 16.2 percent at Rs 3,262.5 crore versus Rs 3,894 crore (YoY)\n-Consolidated net sales up 4.9 percent at Rs 17,763 crore versus Rs 16,928 crore (YoY)\n-Consolidated EBITDA down 15.2 percent at Rs 3,480 crore versus Rs 4,104 crore (YoY)\n-Consolidated operating margin at 19.6 percent versus 24.2 percent (YoY)\n-Net loss at Rs 21.8 crore versus profit of Rs 6.6 crore (YoY)\n-Total income down 12.1 percent at Rs 142 crore versus Rs 161.6 crore (YoY)\n \n-Net profit at Rs 7.6 crore versus loss of Rs 55.8 crore (YoY)\n-Net sales up 18.1 percent at Rs 296 crore versus Rs 250.6 crore (YoY)\n-Net loss at Rs 35.9 crore versus loss of Rs 12.4 crore (YoY)\n-Total income down 30.5 percent at Rs 134.7 crore versus Rs 193.9 crore (YoY)\n-Net loss at Rs 52.3 crore versus profit of Rs 20 crore (YoY)\n-Total income at Rs 1,029.3 crore versus Rs 1,027.4 crore (YoY)\n-EBITDA loss at Rs 35 crore versus EBITDA of Rs 58 crore (YoY)\n-Net profit at Rs 5.3 crore versus loss of Rs 8 crore (QoQ)\n-Total income up 4.3 percent at Rs 2,655 crore versus Rs 2,546 crore (QoQ)\n-EBITDA up 16.6 percent at Rs 309 crore versus Rs 265 crore (QoQ)\n-Operating margin at 11.6 percent versus 10.4 percent (QoQ)\n-Net profit at Rs 2 crore versus loss of Rs 3.6 crore (YoY)\n-Total income down 37.8 percent at Rs 87.6 crore versus Rs 140.9 crore (YoY)\nAlert: UB Holdings had exceptional gain of Rs 75.6 crore in Q3FY14\n-Net profit at Rs 36.9 crore versus Rs 11 crore (YoY)\n-Net sales up 16.7 percent at Rs 498 crore versus Rs 426.6 crore (YoY)\n-Consolidated net profit at Rs 20.6 crore versus Rs 20.9 crore (YoY)\n-Consolidated net sales up 46.2 percent at Rs 1,867.6 crore versus Rs 1,277.2 crore (YoY)\n-Consolidated net profit up 90.1 percent at Rs 96 crore versus Rs 50.5 crore (YoY)\n-Consolidated total income up 25 percent at Rs 3,449.7 crore versus Rs 2,759.6 crore (YoY)\n \n-Consolidated net profit down 15.1 percent at Rs 76.9 crore versus Rs 90.6 crore (YoY)\n-Consolidated total income down 23.3 percent at Rs 598.4 crore versus Rs 780.2 crore (YoY)\n \n-Net loss at Rs 29.3 crore versus profit of Rs 27.9 crore (YoY)\n-Total income at Rs 284.5 crore versus Rs 840.5 crore (YoY)\n-Net profit at Rs 844 crore versus loss of Rs 6.1 crore (YoY)\n-Total income down 17.2 percent at Rs 232.3 crore versus Rs 280.6 crore (YoY)\n-1-time gain at Rs 1,083.4 crore versus 1-time loss of Rs 14 crore (YoY)\n-Net loss at Rs 17.5 crore versus profit of Rs 6.2 crore (YoY)\n-Income from operations down 0.9 percent at Rs 161 crore versus Rs 162.5 crore (YoY)\n-Net loss at Rs 22.8 crore versus loss of Rs 21.5 crore (YoY)\n-Net sales up 6.9 percent at Rs 880 crore versus Rs 822.9 crore (YoY)\n-Net profit up 6.1 percent at Rs 15.7 crore versus Rs 14.8 crore (YoY)\n-Total income up 5.4 percent at Rs 45.2 crore versus Rs 42.9 crore (YoY)\n-Consolidated net profit up 15.3 percent at Rs 328 crore versus Rs 284 crore (YoY)\n-Consolidated revenue up 6.5 percent at Rs 2,765 crore versus Rs 2,596 crore (YoY)\n-Consolidated EBITDA up 18.5 percent at Rs 554 crore versus Rs 467 crore (YoY)\n-Consolidated operating margin at 20 percent versus 18 percent (YoY)\n-Cipla to acquire 60 percent stake in Jay Precision Pharma for Rs 96 crore\nCipla says\n-Jay Precision is existing supplier of respiratory devices to company\n-Deal with Jay Precision aimed at integrating the value chain\n-Net loss at Rs 275 crore versus loss of Rs 172.8 crore (YoY)\n-Total income down 27.5 percent at Rs 1,311.2 crore versus Rs 1,808 crore (YoY)\n-Consolidated net profit at Rs 89.8 crore versus Rs 17.7 crore (YoY)\n-Consolidated total income up 23.1 percent at Rs 182.6 crore versus Rs 148.3 crore (YoY)\n-Tax writeback of Rs 37.3 crore versus tax expense of Rs 1 crore (YoY)\n-Net profit at Rs 329.2 crore\n-Total income at Rs 416.4 crore (YoY)\n-Consolidated net profit up 17.4 percent at Rs 108.5 crore versus Rs 92.4 crore (QoQ)\n-Consolidated total income down 3.1 percent at Rs 4914.5 crore versus Rs 5071.6 crore (QoQ)\n \n-Net profit down 9.2 percent at Rs 70.8 crore versus Rs 78 crore (YoY)\n-Total income up 24.6 percent at Rs 1,119 crore versus Rs 898.2 crore (YoY)\n \n-Net loss at Rs 16.6 crore versus profit of Rs 24.5 crore (YoY)\n-Total income up 22.4 percent at Rs 278 crore versus Rs 227.2 crore (YoY)\n-Net loss at Rs 125 crore versus loss of Rs 100.6 crore (YoY)\n-Total income up 5.7 percent at Rs 213.6 crore versus Rs 202 crore (YoY)\n-Net profit down 8.5 percent at Rs 54.9 crore versus Rs 60 crore (YoY)\n-Total income up 23.6 percent at Rs 821.4 crore versus Rs 664.8 crore (YoY)\n-Amtek India changes name to Magnum Castings\n-Net loss at Rs 44.5 crore versus profit of Rs 23.9 crore (YoY)\n-Total income down 18.9 percent at Rs 703 crore versus Rs 864.9 crore (YoY)\n-Extraordinary items at Rs 73.1 crore\n-Net loss at Rs 730.8 crore versus loss of Rs 834.2 crore (QoQ)\n-Total income down 4 percent at Rs 817 crore versus Rs 850.7 crore (QoQ)\n-Consolidated net loss at Rs 32.7 crore versus loss of Rs 29.7 crore (YoY)\n-Consolidated total income down 1.5 percent at Rs 581.7 crore versus Rs 590.5 crore (YoY)\n-Consolidated net profit down 46.4 percent at Rs 115 crore versus Rs 214 crore (YoY)\n-Consolidated total income up 6.2 percent at Rs 1,701 crore versus Rs 1,601.7 crore (YoY)\n-Consolidated EBITDA down 27.3 percent at Rs 265 crore versus Rs 365 crore (YoY)\n-Consolidated operating margin at 15.6 percent versus 22.8 percent (YoY)\n-Net profit down 52.7 percent at Rs 24.1 crore versus Rs 50.9 crore (YoY)\n-Total income down 8.8 percent at Rs 931.3 crore versus Rs 1,020.9 crore (YoY)\n-Net profit down 69.4 percent at Rs 212.6 crore versus Rs 694.8 crore (YoY)\n-Net sales down 28.2 percent at Rs 6,078 crore versus Rs 8,462.4 crore (YoY)\n-EBITDA down 70.2 percent at Rs 294 crore versus Rs 986 crore (YoY)\n-Operating margin at 4.7 percent versus 11.4 percent (YoY)\n-Power EBIT at Rs 458.7 crore versus Rs 1,208 crore (YoY)\n-Power EBIT margin at 9.4 percent versus 16.5 percent (YoY)\n-BHEL says outstanding order book at Rs 1.04 lakh crore as on December 31\n-Consolidated net profit up 3.4 percent at Rs 60.1 crore versus Rs 58.1 crore (YoY)\n-Consolidated total income up 25.7 percent at Rs 684.4 crore versus Rs 544.3 crore (YoY)\n-Consolidated EBITDA up 3.4 percent at Rs 154 crore versus Rs 149 crore (YoY)\n-Consolidated operating margin at 22.5 percent versus 27.4 percent (YoY)\n-Net profit up 20.9 percent at  Rs 108.2 crore versus Rs 89.5 crore (YoY)\n-Total income down 9.1 percent at Rs 944.4 crore versus Rs 1,039.3 crore (YoY)\n-EBITDA down 1.6 percent at Rs 192 crore versus Rs 195 crore (YoY)\n-Operating margin at 20.3 percent versus 18.8 percent (YoY)\n-Net profit up 44.4 percent at Rs 9.1 crore versus Rs 6.3 crore (YoY)\n-Total income up 15 percent at Rs 417.2 crore versus Rs 362.7 crore (YoY)\n-Net profit up 41.4 percent at Rs 12.3 crore versus Rs 8.7 Crore (YoY)\n-Total income up 10.2 percent at Rs 166.4 crore versus Rs 151 crore (YoY)\n-Net profit at Rs 13.6 crore versus Rs 2.5 crore (YoY)\n-Total income up 11 percent at Rs 267.2 crore versus Rs 240.7 crore (YoY)\n-Consolidated net loss at Rs 641.7 crore versus loss of Rs 503.2 crore (YoY)\n-Consolidated total income down 9 percent at Rs 2181.4 crore versus Rs 2397.4 crore (YoY)\nOther stocks and sectors that are in news today:\n-RBI says FIIs/FPIs can now invest up to 49 percent in Lupin\n-Telecom stocks in focus: Supreme Court to hear telecom companies' plea for licence extension on February 18\n- BHEL / NALCO / NMDC : Government official says cabinet approved stake sale in BHEL, NALCO & NMDC: NewsRise\n- Sun Pharma / Suzlon : Dilip Shanghvi to pick stake in Suzlon: ET\n- Bank of India plans to pick up nearly 20 percent stake in a payments bank: ET\n- PNB has raised Rs 1500 crore through Basel III compliant perpetual debt instruments in the nature of debentures for inclusion in additional Tier I capital at an annual coupon of 9.15% per annum\n- Agro Dutch Industries : The consortium lenders of the company has taken over the possession of Can unit situated at Punjab under SARFESI Act, 2002\n- Axis Bank allotted unsecured redeemable non convertible subordinated debentures (Basel - III compliant Tier II debentures) aggregating to Rs 850 crore\n- KSS entering into an agreement for opening a new division of Film distribution in the state of Delhi, UP and Punjab\n- Kansai Nerolac seeks shareholder approval to subdivide equity share of the company having a face value of Rs 10 each into 10 equity shares of face value of Re 1 each\n- Ravi Kumar Distilleries approved selling the stake of the company in SV Distilleries Private Limited, Bidar\n- UltraTech Cement says no proposal to buy grinding unit of Binani Cements\n- Vakrangee appointed national business correspondent across India for State Bank of India\n- Sadbhav Engineering has signed an agreement with  Gammon Infrastructure Projects to sell 19.99 percent stake in Mumbai Nasik Expressway for Rs 72 crore: ET\n- Spicejet is working to sharply reduce the number of vice-presidents to five from 20 as it seeks to rationalize staff: ET\n", "title": "Stocks in news: SBI, M&M, BHEL, Coal India, ICICI, Cipla", "link": "http://www.moneycontrol.com/news/stocksnews/stocksnews-sbi-mm-bhel-coal-india-icici-cipla_1301428.html", "time": "8.30 am "}, {"date": " 12 Feb 2015", "content": "Feb 12, 2015, 10.17 PM  | Source: CNBC-TV18\nMineral-based projects will get sorted in 2 yrs: JSW Steel\nSajjan Jindal, Chairman & MD, JSW Steel says with iron-ore and mining ordinances, it has become very clear that now it will be through the auction route, through a transparent route. So, I think over the next two years, all these large projects which are mineral based will get sorted out.\nLike this story, share it with millions of investors on M3\nMineral-based projects will get sorted in 2 yrs: JSW Steel\nSajjan Jindal, Chairman & MD, JSW Steel says with iron-ore and mining ordinances, it has become very clear that now it will be through the auction route, through a transparent route. So, I think over the next two years, all these large projects which are mineral based will get sorted out.\nPost your opinion here\nExcerpts from India Business Hour on CNBC-TV18 Watch the full show Âť\nThe new Narendra Modi government is doing a lot to make it easier to do business in the country. But it has miles to go before India's ranking in this area improves significantly. That's the word from captains of Indian industry including Sajjan Jindal, Dilip Shanghvi and Tulsi Tanti, who together command a market capitalisation of nearly Rs 5 lakh crore.\nHowever, speaking at a conference on how to build a new India organised by Antique, these captains agreed that the government's efforts would not amount to much unless corporate India pitched in.\nHere's a list of areas the industry bigwigs believe have seen some progress, and some areas where a lot still needs to be done.\nSajjan Jindal, Chairman & MD, JSW Steel  - On govt boosting industry confidence\nProp up the confidence level that we are with you, we want to support you, we want industry, we want manufacturing and that is what this government has done - whether it is the Prime Minister or his colleagues - they are giving this confidence back to the investor community and that is the first very important step.\nIn the UPA-II where we suffered, there was no clarity of thought whether the government wanted projects to happen. One wing or one arm was saying we have to move forward and the other one was saying no we have to go back.\nThis government is putting all these things into order. Similarly on the ordinances that they issued on iron-ore and mining minerals, it has become very clear that now it will be through the auction route, through a transparent route. So, I think over the next two years my belief is that all these large projects which are mineral based will get sorted out.\nAshwin Dani, VC & MD, Asian Paints  - On demand on the ground\nSignals are very clear that on the ground demand is yet to pick up and until the demand really picks up I think the consumer industry is still not feeling the positive vibes that we see in the environment.\nDilip Shanghvi, Founder, Sun Pharma  - On employable and skilled youth\nWe see that availability of graduates from college who are employable is limited. So, typically most of the people that we hire they go through an extensive training programme .So, I think the important focus before we can become a supplier of products globally is to look at education and create capacity in our education system to generate employable youth.\nOn the other side, you have industry problem of not getting enough people of the skill that they require. We have to find a way to bridge this because manufacturing unlike services require specific skills and capability for us to succeed and to be able to compete globally. The other issue is the issue of innovation for our business. Philosophically, as a country we have never given premium for original thinking. It is easier to copy, safer to copy because you have less risk of failure.\nSajjan Jindal, Chairman & MD, JSW Steel - On dumping\nWe don't have very quick redressal system on dumping. So when, for example lets take an example of Russia and Ukraine where their currencies have crashed by nearly 100 percent they have become double of what it used to be. Demand within Russia and Ukraine has collapsed. So, they are now dumping steel into India. Our government does not have a very quick mechanism or even the industry is not prepared to apply to the government to take a very quick action on this redressal to bring in countervailing duties or bringing in anti-dumping or safeguard duties. So, now the industry is working together to create this concept. We are already in discussion with the government.\nDilip Shanghvi, Founder, Sun Pharma - On R&D\nI think there are lot of bureaucratic restrictions in research. So, for doing animal experiments, for import of large animals, for doing lets say phase 1, phase 2 studies, human studies, lets say when you are doing clinical trial for cancer drug. So there would be some deaths in clinical trial possibly because of the drug, the number of deaths would be lower than it would have been otherwise if they were not treated. However, the regulatory process that is now in place for any company to do clinical trial in India and the kind of responsibility on the sponsor for any kind of potential - say like normally in India you can't do a placebo control study. Globally you can do placebo control study. So, large number of unrealistic restrictions prevent the industry to be able to invest in research.\nTulsi Tanti, Chairman & MD, Suzlon Group - On policy initiative and target versus momentum\nTwo, three policy initiatives already government has taken which has accelerated investment into the industry. However, when we see the size of the target versus the momentum it is not good enough.\n200 gigawatt target and even countries future requirement, 30 percent energy we have home resources – green and solar. Huge potential is there. We have technology within the country. We are exporting technology to developed economies also. More focus is required on financeable PPA and security of the payment. That is the key bottleneck to unlock the size of the market.\nJSW Steel stock price\nOn December 18, 2015, at  12:09 hrs JSW Steel was quoting at Rs 1032.40, down Rs 12.1, or 1.16 percent. The 52-week high of the share was Rs 1087.95 and the 52-week low was Rs 801.00.\nThe company's trailing 12-month (TTM) EPS was at Rs 36.21 per share as per the quarter ended September 2015. The stock's price-to-earnings (P/E) ratio was 28.51. The latest book value of the company is Rs 1030.07 per share. At current value, the price-to-book value of the company is 1.00.\nALSO READ\n", "title": "Mineral-based projects will get sorted in 2 yrs: JSW Steel", "link": "http://www.moneycontrol.com/news/business/mineral-based-projects-will-get-sorted2-yrs-jsw-steel_1301251.html", "time": "10.17 pm "}, {"date": " 23 Jan 2015", "content": "Jan 23, 2015, 01.32 PM  | Source: CNBC-TV18\nTop buzzing midcap stocks to trade on January 23\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have SPARC, Dish TV, HCL Info, Tata Metaliks, Havells, Polaris, Ipca Labs, Tata Coffee, Zuari Agro, Suzlon Energy.\nLike this story, share it with millions of investors on M3\nTop buzzing midcap stocks to trade on January 23\nHere are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have SPARC, Dish TV, HCL Info, Tata Metaliks, Havells, Polaris, Ipca Labs, Tata Coffee, Zuari Agro, Suzlon Energy.\nPost your opinion here\n", "title": "Top buzzing midcap stocks to trade on January 23", "link": "http://www.moneycontrol.com/news/buzzingstocks/top-buzzing-midcap-stocks-to-tradejanuary-23_1282336.html", "time": "1.25 pm "}], [{"date": " 22 Jan 2015", "content": "Jan 22, 2015, 12.47 PM  | Source: CNBC-TV18\nCheck out the stocks that are buzzing the most on Jan 22\nCheck out the stocks that are buzzing the most on January 22 – Suzlon, Hitachi Homes, Kohinoor Foods, GSFC, Kaveri Seeds, Global Offshore, Supreme Petro and L&T Finance.\nLike this story, share it with millions of investors on M3\nCheck out the stocks that are buzzing the most on Jan 22\nCheck out the stocks that are buzzing the most on January 22 – Suzlon, Hitachi Homes, Kohinoor Foods, GSFC, Kaveri Seeds, Global Offshore, Supreme Petro and L&T Finance.\nPost your opinion here\n", "title": "Check out the stocks that are buzzing the most on Jan 22", "link": "http://www.moneycontrol.com/news/buzzingstocks/check-outstocks-thatbuzzingmostjan-22_1281044.html", "time": "12.39 pm "}, {"date": " 22 Jan 2015", "content": "Jan 22, 2015, 09.03 AM  | Source: Moneycontrol.com\nSuzlon signs agreement with Centrebridge Partners LP for 100% sale of Senvion SE\nSuzlon Group today signed a binding agreement with Centerbridge Partners LP, USA to sell 100 percent stake in Senvion SE, a wholly owned subsidiary of the Suzlon Group. The deal is valued at EUR 1 billion (approx Rs 7200cr) equity value in an all cash transaction and future earn out of upto an additional EUR 50 million.\nLike this story, share it with millions of investors on M3\nSuzlon signs agreement with Centrebridge Partners LP for 100% sale of Senvion SE\nSuzlon Group today signed a binding agreement with Centerbridge Partners LP, USA to sell 100 percent stake in Senvion SE, a wholly owned subsidiary of the Suzlon Group. The deal is valued at EUR 1 billion (approx Rs 7200cr) equity value in an all cash transaction and future earn out of upto an additional EUR 50 million.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that \"Suzlon signs binding agreement with Centrebridge Partners LP for 100% sale of Senvion SE\"  Suzlon Group today signed a binding agreement with Centerbridge Partners LP, USA to sell 100 percent stake in Senvion SE, a wholly owned subsidiary of the Suzlon Group. The deal is valued at EUR 1 billion (approx Rs 7200cr) equity value in an all cash transaction and future earn out of upto an additional EUR 50 million. Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon signs agreement with Centrebridge Partners LP for 100% sale of Senvion SE", "link": "http://www.moneycontrol.com/news/announcements/suzlon-signs-agreementcentrebridge-partners-lp-for-100-salesenvion-se_1280879.html", "time": "9.03 am "}, {"date": " 22 Jan 2015", "content": "Jan 22, 2015, 06.48 PM  | Source: Moneycontrol.com\nSuzlon sells German arm Senvion for euro 1 bn; to cut debt\nSuzlon said it will repay domestic term loans worth Rs 5000 crore with the proceeds from the sale of its German arm Senvion\nLike this story, share it with millions of investors on M3\nSuzlon sells German arm Senvion for euro 1 bn; to cut debt\nSuzlon said it will repay domestic term loans worth Rs 5000 crore with the proceeds from the sale of its German arm Senvion\nPost your opinion here\n \nMoneycontrol Bureau\nWind turbine maker  Suzlon has sold its German arm Senvion to US-based private equity firm Centerbridge Partners for 1 billion euro in an all cash deal.\nSuzlon said it expects the deal to be completed by the end of March.\nThe deal will help Suzlon reduce Rs 5000 crore of debt on its balance sheet.\nThe company said it will repay domestic term loans worth Rs 5000 crore with the proceeds from the sale.\nSuzlon said it will use Senvion’s offshore technology by paying a license fee.\n\"The proceeds would be used for debt repayment thereby reducing interest cost and augment business growth,\" Tulsi Tanti, Chairman, Suzlon Group said in the media release.\n\"We will focus on high growth markets like India, USA and other emerging economy markets. With our market leadership, right technology, proven project execution capabilities and best in class services, we are best positioned to tap the high growth potential in home market,\" he said.\nAccording to data collated by CNBC-TV18,  State Bank of India and  IDBI Bank are the biggest lenders to Suzlon. SBI’s exposure is around Rs 3500-3600 crore, while that of IDBI Bank is around Rs 2000 crore.\nBank of Baroda ,  Indian Overseas Bank and  Punjab National Bank together have an exposure of around Rs 2800 crore.\nSuzlon had restructured loans worth Rs 9500 crore in October 2012. The recast involved a back ended repayment plan at a reduced interest rate, and a 2-year moratorium on principal and term debt interest payment.\nAmong private lenders Axis Bank has an exposure of around Rs 400 crore, ICICI Bank has an exposure of around Rs 350-380 crore and Yes Bank has loaned around Rs 200 crore.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:10 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\nALSO READ\n", "title": "Suzlon sells German arm Senvion for euro 1 bn; to cut debt", "link": "http://www.moneycontrol.com/news/business/suzlon-sells-german-arm-senvion-for-euro-1-bn-to-cut-debt_1280878.html", "time": "9.01 am "}, {"date": " 21 Jan 2015", "content": "Jan 21, 2015, 08.57 AM  | Source: CNBC-TV18\nHere are top 10 stocks to keep an eye on January 21\nHere are top 10 stocks to keep an eye on January 21 - HDFC, HDFC Bank, ICICI Bank, Mahindra & Mahindra Financials, Suzlon Energy, Tata Motors, Natco Pharma, Crompton Greaves, Excel Crop Care & Praj Industries.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to keep an eye on January 21\nHere are top 10 stocks to keep an eye on January 21 - HDFC, HDFC Bank, ICICI Bank, Mahindra & Mahindra Financials, Suzlon Energy, Tata Motors, Natco Pharma, Crompton Greaves, Excel Crop Care & Praj Industries.\nPost your opinion here\n", "title": "Here are top 10 stocks to keep an eye on January 21", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-keepeyejanuary-21_1279656.html", "time": "8.42 am "}, {"date": " 20 Jan 2015", "content": "Jan 20, 2015, 09.12 AM  | Source: CNBC-TV18\nHere are top 10 stocks to focus on January 20\nHere are top 10 stocks to focus on January 20 – Sintex Industries, JSW Energy, banks, Hindustan Unilever (HUL), Mindtree, CCL Products, Sasken Communication, Kesoram Industries, Hindustan Zinc, Vedanta, MRF, Cairn India, Adani Power, Lanco Infra and Suzlon.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to focus on January 20\nHere are top 10 stocks to focus on January 20 – Sintex Industries, JSW Energy, banks, Hindustan Unilever (HUL), Mindtree, CCL Products, Sasken Communication, Kesoram Industries, Hindustan Zinc, Vedanta, MRF, Cairn India, Adani Power, Lanco Infra and Suzlon.\nPost your opinion here\n", "title": "Here are top 10 stocks to focus on January 20", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-focusjanuary-20_1278521.html", "time": "8.59 am "}], [{"date": " 05 Dec 2014", "content": "Dec 05, 2014, 03.07 PM  | Source: Moneycontrol.com\nSuzlon's arm Senvion SE erects 6.2 M152 Prototype\nSenvion SE, a wholly owned subsidiary of Suzlon, erected the prototype of the Senvion 6.2M152 with the largest rotor diameter in the product range on December 3, 2014.\nLike this story, share it with millions of investors on M3\nSuzlons arm Senvion SE erects 6.2 M152 Prototype\nSenvion SE, a wholly owned subsidiary of Suzlon, erected the prototype of the Senvion 6.2M152 with the largest rotor diameter in the product range on December 3, 2014.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated December 05, 2014, titled \"Suzlon's arm Senvion SE has erected the 6.2 M152 Prototype: Largest rotor diameter in the Product Range\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon's arm Senvion SE erects 6.2 M152 Prototype", "link": "http://www.moneycontrol.com/news/announcements/suzlons-arm-senvion-se-erects-62-m152-prototype_1245632.html", "time": "3.07 pm "}, {"date": " 04 Dec 2014", "content": "Dec 04, 2014, 09.06 AM  | Source: CNBC-TV18\nHere are top 10 stocks to focus on December 4\nHere are top 10 stocks to focus on December 4 - Ashok Leyland, Apollo Tyres, NBCC, HDFC Bank, ICICI Bank, MBL Infra, SAIL, Ranbaxy, Dr Reddy's and Sadbhav Engineering.\nLike this story, share it with millions of investors on M3\nHere are top 10 stocks to focus on December 4\nHere are top 10 stocks to focus on December 4 - Ashok Leyland, Apollo Tyres, NBCC, HDFC Bank, ICICI Bank, MBL Infra, SAIL, Ranbaxy, Dr Reddy's and Sadbhav Engineering.\nPost your opinion here\n", "title": "Here are top 10 stocks to focus on December 4", "link": "http://www.moneycontrol.com/news/stocksviews/heretop-10-stocks-to-focusdecember-4_1244436.html", "time": "9.01 am "}, {"date": " 02 Dec 2014", "content": "Dec 02, 2014, 09.28 AM  | Source: Moneycontrol.com\nSuzlon Energy: Kirti Vagadia appointed as new CFO of Senvion SE\nThe Supervisory Board of Senvion SE, a wholly owned subsidiary of the Suzlon Group, the world\u0092s fifth-largest manufacturer of wind turbines, has appointed Kirti Vagadia as the company\u0092s new Chief Financial Officer.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Kirti Vagadia appointed as new CFO of Senvion SE\nThe Supervisory Board of Senvion SE, a wholly owned subsidiary of the Suzlon Group, the world\u0092s fifth-largest manufacturer of wind turbines, has appointed Kirti Vagadia as the company\u0092s new Chief Financial Officer.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated December 01, 2014, titled \"Kirti Vagadia appointed new CFO of Senvion SE\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Energy: Kirti Vagadia appointed as new CFO of Senvion SE", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-kirti-vagadia-appointed-as-new-cfosenvion-se_1242475.html", "time": "9.28 am "}, {"date": " 18 Nov 2014", "content": "Nov 18, 2014, 03.37 PM  | Source: Moneycontrol.com\nSuzlon Energy: Outcome of securities issue committee meeting\nSuzlon Energy Ltd has informed BSE that the Securities Issue Committee of the Board of Directors of the Company has, at its meeting held on November 18, 2014, approved allotment of securities of the Company.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Outcome of securities issue committee meeting\nSuzlon Energy Ltd has informed BSE that the Securities Issue Committee of the Board of Directors of the Company has, at its meeting held on November 18, 2014, approved allotment of securities of the Company.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Securities Issue Committee of the Board of Directors of the Company has, at its meeting held on November 18, 2014, approved allotment of securities of the Company.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Energy: Outcome of securities issue committee meeting", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-outcomesecurities-issue-committee-meeting_1231701.html", "time": "3.37 pm "}, {"date": " 03 Nov 2014", "content": "Nov 03, 2014, 06.44 PM  | Source: PTI\nSuzlon sees more orders on accelerated depreciation booster\nThe accelerated depreciation scheme, that would provide relief for wind energy projects, came into force from mid-September.\nLike this story, share it with millions of investors on M3\nSuzlon sees more orders on accelerated depreciation booster\nThe accelerated depreciation scheme, that would provide relief for wind energy projects, came into force from mid-September.\nPost your opinion here\n \nWind turbine maker Suzlon Energy  expects to receive additional orders worth about Rs 3,250 crore this fiscal on the back of government re-instating the accelerated depreciation scheme.\nThe accelerated depreciation scheme, that would provide relief for wind energy projects, came into force from mid-September.\nAccording to sources, Suzlon expects to receive additional orders to the tune of 500 MW, worth about Rs 3,250 crore, in the current fiscal on account of AD scheme.\nOn a conservative basis, setting up 1 MW of wind energy generation capacity costs about Rs 6.5 crore. Accelerated depreciation (AD) refers to calculation that allows for higher deductions towards deprecation in the early life time of an asset.\nWhen contacted, Suzlon Group Head of Finance Kirti Vagadia told PTI, \"We expect to receive more orders in third and fourth quarters on account of accelerated depreciation (scheme)\".\nHowever, he did not divulge size of expected orders. The scheme, which had benefited the wind energy sector, was withdrawn by the earlier government in 2012.\n\"To encourage the wind energy programme, there is an accelerated depreciation. There was a confusion whether we have extended it or not. Members wanted it to be extended. I am, therefore, continuing with that accelerated depreciation,\" Finance Minister Arun Jaitley had informed the Lok Sabha in July while replying to a debate on the Finance Bill.\nAt the end of September, Suzlon's order book was worth USD 6.3 billion, with emerging markets alone accounting for about USD 1.1 billion. In terms of capacity, the order book\\\\ stood at around 4,600 MW.\nSuzlon saw its consolidated net loss narrowing to Rs 656.21 crore in the three months ended September from Rs 782.37 crore recorded in the year-ago period.\nThis figure is after taking into account 'share in minority interest'.\nIn the second quarter (ended September) of current fiscal, the wind turbine maker's total income climbed to Rs 5,378.89 crore from Rs 4,808.90 crore in the same period a year ago.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:13 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon sees more orders on accelerated depreciation booster", "link": "http://www.moneycontrol.com/news/business/suzlon-sees-more-ordersaccelerated-depreciation-booster_1218360.html", "time": "6.44 pm "}, {"date": " 01 Nov 2014", "content": "Nov 01, 2014, 11.59 AM  | Source: PTI\nSuzlon Q2 loss at Rs 656 cr; logs rise in income\nSuzlon plans to list its German subsidiary Senvion on the London Stock Exchange through an initial public offer which is likely to garner close to Rs 7,000 crore.\nLike this story, share it with millions of investors on M3\nSuzlon Q2 loss at Rs 656 cr; logs rise in income\nSuzlon plans to list its German subsidiary Senvion on the London Stock Exchange through an initial public offer which is likely to garner close to Rs 7,000 crore.\nPost your opinion here\n \nWind turbine maker  Suzlon Energy on Friday posted net loss of Rs 656.21 crore for the second quarter ended September 30, 2014-15.\nThe company had reported a net loss of Rs 782.37 crore for the July-September quarter, 2013-14.\nIts total income in Q2, 2014-15 increased from Rs 4,820.54 crore a year ago to Rs 5,391.76 crore.\nSuzlon plans to list its German subsidiary Senvion on the London Stock Exchange through an initial public offer which is likely to garner close to Rs 7,000 crore.\nThe company renamed its subsidiary REpower as Senvion, last year. REpower, which was founded in 2001, was acquired by Suzlon Energy in December 2009.\n\"Globally, we will leverage Senvion's leadership in off-shore technology to capitalise on the growing demand in the offshore segment. The Indian market has witnessed a positive impact of the government's thrust on clean energy and policy reforms,\" Suzlon Group Chairman Tulsi Tanti said in a statement.\n\"We have launched new products and will continue to invest in technology to provide clean and affordable energy for all,\" he added.\nMeanwhile, Suzlon which is planning a business revival strategy has set a target of raising Rs 1,000 crore through the sale of its non-core assets during the current fiscal.\nThe company's order-book on September 30 stood at USD 6.3 billion.\nSuzlon shares closed at Rs 13.45, up 1.97 percent, on the BSE.\n", "title": "Suzlon Q2 loss at Rs 656 cr; logs rise in income", "link": "http://www.moneycontrol.com/news/results/suzlon-q2-loss-at-rs-656-cr-logs-riseincome_1216775.html", "time": "11.59 am "}, {"date": " 31 Oct 2014", "content": "Oct 31, 2014, 09.44 PM  | Source: Moneycontrol.com\nSuzlon Energy: Outcome of board meeting\nSuzlon Energy at its meeting held on October 31, 2014, has approved the Reconstitution of the Audit Committee of the Board with effect from October 31, 2014, which shall now comprise of members V. Raghuraman, Independent Director - Chairman, V. Subramanian, Independent Director - Member and Medha Joshi, Nominee Director - Member.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Outcome of board meeting\nSuzlon Energy at its meeting held on October 31, 2014, has approved the Reconstitution of the Audit Committee of the Board with effect from October 31, 2014, which shall now comprise of members V. Raghuraman, Independent Director - Chairman, V. Subramanian, Independent Director - Member and Medha Joshi, Nominee Director - Member.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Board of Directors of the Company at its meeting held on October 31, 2014, inter alia, has approved the following:- Reconstitution of the Audit Committee of the Board with effect from October 31, 2014, which shall now comprise of the following members:a) Mr. V. Raghuraman, Independent Director - Chairman,b) Mr. V. Subramanian, Independent Director - Memberc) Mrs. Medha Joshi, Nominee Director - Member.Source : BSE\n", "title": "Suzlon Energy: Outcome of board meeting", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-outcomeboard-meeting_1216916.html", "time": "9.44 pm "}, {"date": " 20 Oct 2014", "content": "Oct 20, 2014, 04.11 PM  | Source: Moneycontrol.com\nSuzlon Energy's Q2 results on October 31, 2014\nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on October 31, 2014, to approve the unaudited Financial Results of the Company for the quarter ended on September 30, 2014 (Q2).\nLike this story, share it with millions of investors on M3\nSuzlon Energys Q2 results on October 31, 2014\nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on October 31, 2014, to approve the unaudited Financial Results of the Company for the quarter ended on September 30, 2014 (Q2).\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on October 31, 2014, to approve the unaudited Financial Results of the Company for the quarter ended on September 30, 2014 (Q2).Further, as per Companyâ\u0080\u0099s Code of Conduct for Prevention of Insider Trading (COCPIT) as required to be implemented in terms of Regulation 12 of the Securities and Exchange Board of India (Prohibition of Insider Trading) Regulations, 1992, the Trading Window of the Company has been closed from October 21, 2014 till November 01, 2014 (both days inclusive) for the purpose of declaration of the unaudited Financial Results of the Company.Source : BSE\n", "title": "Suzlon Energy's Q2 results on October 31, 2014", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energys-q2-resultsoctober-31-2014_1207934.html", "time": "4.11 pm "}, {"date": " 12 Oct 2014", "content": "Oct 12, 2014, 11.47 AM  | Source: PTI\nSuzlon to list German subsidiary Senvion on LSE by fisc end\nWorld's fifth largest wind turbine maker Suzlon plans to list its German subsidiary Senvion on the London Stock Exchange through an initial public offer which is likely to garner close to Rs 7,000 crore.\nLike this story, share it with millions of investors on M3\nSuzlon to list German subsidiary Senvion on LSE by fisc end\nWorld's fifth largest wind turbine maker Suzlon plans to list its German subsidiary Senvion on the London Stock Exchange through an initial public offer which is likely to garner close to Rs 7,000 crore.\nPost your opinion here\n \nWorld's fifth largest wind turbine maker  Suzlon plans to list its German subsidiary Senvion on the London Stock Exchange through an initial public offer which is likely to garner close to Rs 7,000 crore.\n\"We are working on that (listing of Senvion) front and it will happen by the end of current financial year (2014-15),\" Suzlon Group Chairman Tulsi Tanti told PTI when asked about the timing of Senvion's listing on the London Stock Exchange.\nHowever, the company did not disclose the amount it expects to raise from the public offer of Senvion but according to sources it is hopeful of garnering about Rs 7,000 crore.\nIndustry experts feel that the listing of German subsidiary by Suzlon will be a win win situation for the company.\n\"Senvion is a leading player in the global wind market and it would certainly have lots of interest from investors when it goes for listing in London,\" Debasish Mishra, Senior Director (Consulting) Deloitte said.\nHe added that if the structure allows Suzlon to bring the cash and reduce its debt in India, it would be a huge positive for the debt-ridden company.\nSuzlon Energy renamed its subsidiary REpower as Senvion, last year. REpower, which was founded in 2001, was acquired by Suzlon Energy in December 2009.\nMeanwhile, Suzlon which is planning a business revival strategy has set a target of raising Rs 1,000 crore through the sale of its non-core assets during the current fiscal.\nThe company reported a lower net loss of Rs 750.74 crore in the three months ended June 2014, mainly on the back of higher income. It had incurred a net loss of Rs 1,058.90 crore in the same period a year ago.\nShares of Suzlon closed at Rs 12.98, up 1.25 percent, on the BSE on Friday.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:13 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon to list German subsidiary Senvion on LSE by fisc end", "link": "http://www.moneycontrol.com/news/business/suzlon-to-list-german-subsidiary-senvionlse-by-fisc-end_1201513.html", "time": "11.47 am "}, {"date": " 09 Oct 2014", "content": "Oct 09, 2014, 11.29 AM  | Source: Moneycontrol.com\nSuzlon to build 2000MW wind energy projects over next five years\nSuzlon Group is intent to build 2000 MW of new wind energy projects in the state of Madhya Pradesh over the next five years and establish supporting manufacturing facilities.\nLike this story, share it with millions of investors on M3\nSuzlon to build 2000MW wind energy projects over next five years\nSuzlon Group is intent to build 2000 MW of new wind energy projects in the state of Madhya Pradesh over the next five years and establish supporting manufacturing facilities.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated October 09, 2014 titled \"Suzlon to Build 2000MW Wind Energy Projects over Next Five Years; expresses intent to set up Manufacturing Facilities in Madhya Pradesh\".  Suzlon Group is intent to build 2000 MW of new wind energy projects in the state of Madhya Pradesh over the next five years and establish supporting manufacturing facilities.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon to build 2000MW wind energy projects over next five years", "link": "http://www.moneycontrol.com/news/announcements/suzlon-to-build-2000mw-wind-energy-projects-over-next-five-years_1199203.html", "time": "11.29 am "}, {"date": " 26 Sep 2014", "content": "Sep 26, 2014, 05.51 PM  | Source: Moneycontrol.com\nSuzlon Energy: Disclosure of voting results of AGM (Clause 35A)\nSuzlon Energy has informed regarding the details of Voting results at the Annual General Meeting (AGM) of the Company held on September 25, 2014, under Clause 35A.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Disclosure of voting results of AGM (Clause 35A)\nSuzlon Energy has informed regarding the details of Voting results at the Annual General Meeting (AGM) of the Company held on September 25, 2014, under Clause 35A.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding the details of Voting results at the Annual General Meeting (AGM) of the Company held on September 25, 2014, under Clause 35A.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Energy: Disclosure of voting results of AGM (Clause 35A)", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-disclosurevoting-resultsagm-(clause-35a)_1189961.html", "time": "5.51 pm "}], [{"date": " 25 Sep 2014", "content": "Sep 25, 2014, 04.21 PM  | Source: Moneycontrol.com\nSuzlon Energy appoints Venkataraman Subramanian as additional director\nSuzlon Energy Ltd has informed BSE about the appointment of Mr. Venkataraman Subramanian as an Additional Director in the capacity of\nLike this story, share it with millions of investors on M3\nSuzlon Energy appoints Venkataraman Subramanian as additional director\nSuzlon Energy Ltd has informed BSE about the appointment of Mr. Venkataraman Subramanian as an Additional Director in the capacity of\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE about the following information in the matter of the reconstitution of the Board of Directors of the Company:- Appointment of Mr. Venkataraman Subramanian as an Additional Director in the capacity of \"Independent Director\" of the Company with effect from September 25, 2014.Source : BSE\n", "title": "Suzlon Energy appoints Venkataraman Subramanian as additional director", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-appoints-venkataraman-subramanian-as-additional-director_1188659.html", "time": "4.21 pm "}, {"date": " 11 Sep 2014", "content": "Sep 11, 2014, 04.48 PM  | Source: Moneycontrol.com\nSuzlon Energy: AGM on Sept 25, 2014\nSuzlon Energy has informed that the 19th Annual General Meeting (AGM) of the Company will be held on September 25, 2014.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: AGM on Sept 25, 2014\nSuzlon Energy has informed that the 19th Annual General Meeting (AGM) of the Company will be held on September 25, 2014.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the 19th Annual General Meeting (AGM) of the Company will be held on September 25, 2014.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Energy: AGM on Sept 25, 2014", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-agmsept-25-2014_1176601.html", "time": "4.48 pm "}, {"date": " 09 Sep 2014", "content": "Sep 09, 2014, 01.13 PM  | Source: Moneycontrol.com\nSuzlon Energy allots 27.03cr equity shares on conversion of bonds\nSuzlon Energy has approved the allotment of 27,03,85,303 Equity Shares of Rs 2 each on conversion of 69,409 Bonds worth USD 69,409,000, at a conversion price of Rs 15.46 per Equity Share with a fixed rate of exchange on conversion of Rs 60.225 to USD 1.00 in terms of the Information Memorandum dated June 17, 2014.\nLike this story, share it with millions of investors on M3\nSuzlon Energy allots 27.03cr equity shares on conversion of bonds\nSuzlon Energy has approved the allotment of 27,03,85,303 Equity Shares of Rs 2 each on conversion of 69,409 Bonds worth USD 69,409,000, at a conversion price of Rs 15.46 per Equity Share with a fixed rate of exchange on conversion of Rs 60.225 to USD 1.00 in terms of the Information Memorandum dated June 17, 2014.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that pursuant to the conversion notice received from certain holders of the USD 546,916,000 Step-up Convertible Bonds due July 2019 (the “Bonds”), the Securities Issue Committee of the Board of Directors of the Company at its meeting held on September 09, 2014 has approved the allotment of 27,03,85,303 (Twenty Seven Crores Three Lacs Eighty Five Thousand Three Hundred Three) Equity Shares of Rs. 2/- each on conversion of 69,409 (Sixty Nine Thousand Four Hundred Nine) Bonds worth USD 69,409,000, at a conversion price of Rs. 15.46 (Rupees Fifteen and Paise Forty Six Only) per Equity Share with a fixed rate of exchange on conversion of Rs. 60.225 to USD 1.00 in terms of the Information Memorandum dated June 17, 2014.Source : BSE\n", "title": "Suzlon Energy allots 27.03cr equity shares on conversion of bonds", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-allots-2703cr-equity-sharesconversionbonds_1174235.html", "time": "1.13 pm "}, {"date": " 27 Aug 2014", "content": "Aug 28, 2014, 08.31 AM  | Source: Moneycontrol.com\nOffshore wind mkt next key trigger for debt-ridden Suzlon?\nSuzlon‘s Finance Group Head, Kirti Vagadia said that the company has order backlog of worth USD 1.2 billion in the offshore segment. From FY16 onwards revenue of 2 billion euro per megawatt is likely to start flowing into the company’s books.\nLike this story, share it with millions of investors on M3\nOffshore wind mkt next key trigger for debt-ridden Suzlon?\nSuzlon‘s Finance Group Head, Kirti Vagadia said that the company has order backlog of worth USD 1.2 billion in the offshore segment. From FY16 onwards revenue of 2 billion euro per megawatt is likely to start flowing into the company’s books.\nPost your opinion here\nHarsha Jethmalani\nmoneycontrol.com\nSuzlon Energy  is betting big on the offshore wind market with its German subsidiary Senvion Systems SE. The company is confident of tapping this market especially in Europe via Senvioin, which produces 6.15MW turbine and is the third-biggest supplier of offshore turbines.\nWind farms which are constructed in water bodies to generate electricity from wind are known as offshore wind power. Suzlon is present in the offshore segment since 2004 and has 100 offshore turbines with more than 600MW installed. The company supplies turbines to its offshore customers while other infrastructure facilities have to be created by the latter.\nSuzlon‘s Finance Group Head, Kirti Vagadia said that the company has order backlog of worth USD 1.2 billion in the offshore segment. “When compared to the onshore, the plant load factor (PLF) and costs for offshore are double, but this option is commercially viable. Also, this market has huge untapped potential and as of now there are only few players in offshore. We expect to benefit from our early entry in this segment,” he said in a recent interaction with the press. The offshore market is expected to grow by a compound annual growth rate (CAGR) of over 31 percent between 2011 and 2016.\nIn the current fiscal year (FY15) the company is likely to execute only a small part of the offshore orders, but from FY16 onwards revenue of 2 billion euro per megawatt is likely to start flowing into the company’s books, he said.\nLight at end of tunnel\nOnce the darling of investors, Suzlon Energy’s fall from grace was equally swift. The company came out with an IPO at Rs 510 per share (Rs 10 paid up)  in October 2005, and went on to hit a record high of Rs 2185 by January 2008. But the stock has been on a downward spiral since then and is currently ruling at Rs 21 a share. When compared with Sensex returns, the stock has tanked 77 percent while the benchmark has gained 68 percent in the last five years. The reason for this sharp fall is a combination of internal and external factors.\nThe company defaulted on USD 221 million worth of foreign currency convertible bonds (FCCBs), India’s biggest convertible-bond default, maturing on October 11, 2012, after it failed to get an extension from bondholders. This caused huge stress on its financials with the company posting losses since FY10 and attracting huge debt. Global slowdown, high interest cost and removal of tax concessions for wind power in India added to the pain.\nBut, the wind turbine maker is now gearing up for a turnaround and is on a debt reduction spree. It aims to repay Rs 8,000 crore in FY15. Its Q1FY15 losses narrowed to Rs 750.74 crore from Rs 1,058.90 crore in the same period a year ago, mainly on the back of higher income. In the last one year, the stock has risen 239 percent while Sensex has gained 43 percent.\nReiterating that FY15 will be a turnaround year for the company , Vagaria said that the company’s debt in terms of rupee is likely to be at Rs 1,000 crore by March next year. “There was repayment pressure due to defaulting on FCCBs, but now the situation has improved and the debt overhang from Suzlon will be removed,” he added.\nSuzlon has already completed operational restructuring and is currently working on capital restructuring. “We target to complete capital restructuring in this financial year. We have liabilities worth Rs 9,000 crore. We would be transferring Rs 4,000 crore high cost rupee debt to euro debt and would be raising a similar sum of amount from the European equity market via Senvion as well,” he added.\nFurther, sale of non-core assets program is on track and the company has already sold non-core assets worth Rs 700 crore, he said. Within a time frame of nine-12 months, Suzlon is looking to offload non-core assets like component manufacturing units, old manufacturing units, which fetch good realty value and office complexes. The company has more than 25 old manufacturing units at multiple locations.\nThe policy push\nSuzlon also aims to cash-in on the slew of measures that were announced in PM Narendra Modi’s maiden Budget in July. According to Vagaria, re-introduction of accelerated depreciation (AD) has bought back SME and captive demand. Secondly, generation based incentives (GBIs) which provide Rs.0.50/unit incentive to generators with a cap of Rs 1 crore/MW, up from Rs 0.62 crore/MW, and will lead to setting up of new capacities by IPPs. GBI was withdrawn in March 2012, reintroduced in March 2013 and notified in September 2013. Though Vagaria sees some teething issues but is hopeful of the system coming on track.\nThe National Green Energy Fund for which the cess has been doubled to Rs 100/mt is also a big positive for the sector, he added. Also, fast tracking of implementation of Green Corridor, removal of 4 percent SAD for WTG manufacturing and making 2% CSR in renewable energy mandatory are the other key triggers for Suzlon’s growth going ahead, he said.\nDisclaimer: The correspondent's trip to Bhuj was organised by Suzlon Energy Ltd\nSuzlon Energy stock price\nOn December 18, 2015, at  12:14 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Offshore wind mkt next key trigger for debt-ridden Suzlon?", "link": "http://www.moneycontrol.com/news/business/offshore-wind-mkt-next-key-trigger-for-debt-ridden-suzlon_1165045.html", "time": "1.40 pm "}, {"date": " 26 Jul 2014", "content": "Jul 26, 2014, 11.11 AM  | Source: Moneycontrol.com\nSuzlon Energy: Outcome of board meeting\nSuzlon Energy at its meeting held on July 25, 2014, has approved to increase in Authorised Share Capital of the Company from Rs. 1,100 Crore to Rs. 1,500 Crores and alteration of the Capital Clause of the Memorandum of Association of the Company.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Outcome of board meeting\nSuzlon Energy at its meeting held on July 25, 2014, has approved to increase in Authorised Share Capital of the Company from Rs. 1,100 Crore to Rs. 1,500 Crores and alteration of the Capital Clause of the Memorandum of Association of the Company.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Board of Directors of the Company at its meeting held on July 25, 2014, inter alia, has approved the following, subject however to the approval of the members at the ensuing Nineteenth Annual General Meeting of the Company :1. Increase in Authorised Share Capital of the Company from Rs. 1,100 Crore to Rs. 1,500 Crores and alteration of the Capital Clause of the Memorandum of Association of the Company.2. Issue of Equity Shares of the Company on preferential basis in terms of Chapter VII - \"Preferential Issue\" of Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations, 2009 for the sacrifice by ICICI Bank Limited in terms of the CDR Package to an extent of Rs. 6.40 Crores;3. Issue of Securities to the extent of Rs. 5,000 Crores. (This is an enabling resolution to facilitate the Company to raise funds at an appropriate time should that be required).Source : BSE\n", "title": "Suzlon Energy: Outcome of board meeting", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-outcomeboard-meeting_1138174.html", "time": "11.11 am "}, {"date": " 25 Jul 2014", "content": "Jul 28, 2014, 10.13 AM  | Source: PTI\nSuzlon's Q1 loss narrows to Rs 750 crore\nIn the first quarter (ended June) of current fiscal, the firm's total income climbed to Rs 4,671.99 crore from Rs 3,896.71 crore in the year-ago period, reflecting an increase of about 20 per cent.\nLike this story, share it with millions of investors on M3\nSuzlons Q1 loss narrows to Rs 750 crore\nIn the first quarter (ended June) of current fiscal, the firm's total income climbed to Rs 4,671.99 crore from Rs 3,896.71 crore in the year-ago period, reflecting an increase of about 20 per cent.\nPost your opinion here\n \nWind turbine maker  Suzlon Energy saw its net loss come down to Rs 750.74 crore in the three months ended June 2014, mainly on the back of higher income. The company had incurred a net loss of Rs 1,058.90 crore in the same period a year ago. The figures are after taking into account the share in minority interest, it said in a statement today.\nIn the first quarter (ended June) of current fiscal, the firm's total income climbed to Rs 4,671.99 crore from Rs 3,896.71 crore in the year-ago period, reflecting an increase of about 20 per cent.\n\"The recent Union Budget includes several policy measures which will have a positive impact on the wind energy sector in India.\n\"Suzlon is well positioned to tap these opportunities by leveraging on its strengths. We stand committed to build on our technological edge and offer new age products and best in class services,\" Suzlon Energy Chairman Tulsi Tanti said. According to the wind turbine maker, there has been sustained increase in sales volumes and the re-instatement of accelerated depreciation policy would \"bolster growth for the wind energy sector\".\n\"We continue to maintain a strong order book at 4.9 GW, valued at USD 7 billion. On the liability management front, we have successfully completed last leg with the restructuring of FCCBs (Foreign Currency Convertible Bonds),\"  Suzlon Energy's Group Head of Finance Kirti Vagadia said.\nREAD MORE ON   Suzlon Energy\nSet email alert for\n", "title": "Suzlon's Q1 loss narrows to Rs 750 crore", "link": "http://www.moneycontrol.com/news/results/suzlons-q1-loss-narrows-to-rs-750-crore_1137950.html", "time": "9.43 pm "}, {"date": " 23 Jul 2014", "content": "Jul 23, 2014, 08.44 AM  | Source: Moneycontrol.com\nSuzlon Energy to allot 7.16cr equity shares to CDR Lenders\nSuzlon Energy at its meeting held on July 22, 2014, approved the allotment of 7,16,32,902 Equity Shares of Rs 2 each at an issue price of Rs 18.51 per share to the CDR Lenders as per CDR Package on preferential basis.\nLike this story, share it with millions of investors on M3\nSuzlon Energy to allot 7.16cr equity shares to CDR Lenders\nSuzlon Energy at its meeting held on July 22, 2014, approved the allotment of 7,16,32,902 Equity Shares of Rs 2 each at an issue price of Rs 18.51 per share to the CDR Lenders as per CDR Package on preferential basis.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Securities Issue Committee of the Board of Directors of the Company has, at its meeting held on July 22, 2014, approved the allotment of 7,16,32,902 (Seven Crores Sixteen Lacs Thirty Two Thousand Nine Hundred Two) Equity Shares of Rs. 2/- (Rupees Two Only) each at an issue price of Rs. 18.51/- (Rupees Eighteen and Paise Fifty One Only) per share to the CDR Lenders as per CDR Package on preferential basis under Chapter VII - \"Preferential Issue\" of Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations, 2009 (\"ICDR Regulations\") in terms of the approval granted by the shareholders of the Company by way of postal ballot, the results of which have been declared on April 12, 2013 and further in accordance with the scheme of corporate debt restructuring (\"CDR Package\") by and between the Company and the lenders of the Company (\"CDR Lenders\") that is governed by the Corporate Debt Restructuring Scheme issued by the RBI dated August 27, 2008 and the Corporate Debt Restructuring Guidelines formulated thereunder, which has been approved by the Corporate Debt Restructuring Empowered Group on December 31, 2012, and communicated to the Company by the Corporate Debt Restructuring Cell vide its letter of approval dated January 23, 2013.The said 7,16,32,902 (Seven Crores Sixteen Lacs Thirty Two Thousand Nine Hundred Two) Equity Shares of Rs. 2/- (Rupees Two Only) each shall be locked in for a period of one year from the date of allotment in terms of the ICDR Regulations.Source : BSE\n", "title": "Suzlon Energy to allot 7.16cr equity shares to CDR Lenders", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-to-allot-716cr-equity-shares-to-cdr-lenders_1134669.html", "time": "8.44 am "}, {"date": " 10 Jul 2014", "content": "Jul 11, 2014, 07.52 AM  | Source: PTI\nSuzlon bondholders approve FCCB restructuring proposal\nWind turbine maker Suzlon Energy today said its bondholders have approved the proposed restructuring of existing bonds including the terms and conditions of the new FCCBs.\nLike this story, share it with millions of investors on M3\nSuzlon bondholders approve FCCB restructuring proposal\nWind turbine maker Suzlon Energy today said its bondholders have approved the proposed restructuring of existing bonds including the terms and conditions of the new FCCBs.\nPost your opinion here\n \nWind turbine maker  Suzlon Energy today said its bondholders have approved the proposed restructuring of existing bonds including the terms and conditions of the new FCCBs.\n\"Pursuant to the approvals received, all the October 2012 bonds and July 2014 bonds will cease to exist and will be substituted by the new FCCBs (foreign currency convertible bonds) on July 15, 2014, subject to the satisfaction of certain conditions precedent,\" Suzlon said in a statement.\nThe company had earlier announced receipt of approval from the Corporate Debt Restructuring Empowered Group and the Reserve Bank of India for the restructuring, the statement said. In respect of the USD 175 million April 2016 series, only approximately USD 28.8 million in principal value will remain outstanding; the remaining holders have opted to substitute their existing bonds with the new FCCBs, it added.\nAlso read: Suzlon gets nod to start manufacturing for Rajasthan proj\n\"The bondholders, by approving the restructuring have reposed confidence in Suzlon and paved the path for growth. With optimism in the global economy coupled with the company's strategic developments, we are confident of maintaining sustainable growth in the next three years,\" Chairman Tulsi.\nTanti said. \"With this, Suzlon now successfully completes its last leg of comprehensive liability management programme that we initiated in 2012. In the circumstances, the agreed bond restructuring package is an optimum solution for all our stakeholders,\" Kirti Vagadia, Group Head - Corporate Finance, Suzlon Group, said. Shares of Suzlon were trading at Rs 26.25, up 3.75 percent on the BSE.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:14 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon bondholders approve FCCB restructuring proposal", "link": "http://www.moneycontrol.com/news/business/suzlon-bondholders-approve-fccb-restructuring-proposal_1124862.html", "time": "9.53 pm "}, {"date": " 19 Jun 2014", "content": "Jun 19, 2014, 01.34 PM  | Source: PTI\nSuzlon gets nod to start manufacturing for Rajasthan proj\nAccording to sources, the total value of the order is around Rs 750 crore and the equipment will be delivered to CLP India in the next 9-12 months.\nLike this story, share it with millions of investors on M3\nSuzlon gets nod to start manufacturing for Rajasthan proj\nAccording to sources, the total value of the order is around Rs 750 crore and the equipment will be delivered to CLP India in the next 9-12 months.\nPost your opinion here\n \nWind turbine maker  Suzlon Energy has been given a go-ahead by the power generation firm CLP India to start manufacturing equipment for the latter's project in Rajasthan. \"Suzlon today announced that it has received the Notice to Proceed (NTP) from CLP India for a 100.8 MW wind power project,\" the company said in a statement.\nThe notice to proceed was given to Suzlon after CLP India received the approval from the Rajasthan government to commence work on the project. The project, located at Tejuva in Rajasthan, will comprise 48 units of Suzlon's 2.1 MW wind turbines, the statement said. According to sources, the total value of the order is around Rs 750 crore and the equipment will be delivered to CLP India in the next 9-12 months.\nAlso Read: Suzlon bags Rs 750 cr order from ReNew Wind Power\n\"Upon completion, this project will boost CLP India's wind power portfolio to close to 1,000 MW,\" the statement added. \"With large reserves of untapped (wind energy) potential that spells out a great opportunity for this sector to grow exponentially. It has been a key area of thrust for us over the past 4-5 years and we are committed to growing it over the next few years as well,\" Rajiv Mishra, Managing Director, CLP India, said.\n\"This contract is another milestone for our business in India. Through our comprehensive capabilities across wind energy value chain and end-to-end solutions, we will assist CLP India in further expanding their wind energy footprint in India,\" Tulsi Tanti, Chairman, Suzlon Group, said.\nShares of the company were trading at Rs 27.70, down 1.95 percent on the BSE.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:14 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon gets nod to start manufacturing for Rajasthan proj", "link": "http://www.moneycontrol.com/news/business/suzlon-gets-nod-to-start-manufacturing-for-rajasthan-proj_1107543.html", "time": "1.34 pm "}, {"date": " 19 Jun 2014", "content": "Jun 19, 2014, 09.56 AM  | Source: Moneycontrol.com\nSuzlon Group's 100.8 MW Rajasthan wind power project get approvals to proceed\nSuzlon Group has received the Notice of Proceed from CLP India for a 100.8 MW wing power project. The project located at Tejuva, Rajasthan, will comprise 48 units of Suzlon\u0092s robust S97-2.1 MW wind turbines featuring Doubly Fed Induction Generator technology.\nLike this story, share it with millions of investors on M3\nSuzlon Groups 100.8 MW Rajasthan wind power project get approvals to proceed\nSuzlon Group has received the Notice of Proceed from CLP India for a 100.8 MW wing power project. The project located at Tejuva, Rajasthan, will comprise 48 units of Suzlon\u0092s robust S97-2.1 MW wind turbines featuring Doubly Fed Induction Generator technology.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated June 19, 2014 titled \"Suzlon Group's 100.8 MW Rajasthan wind power project for and CLP India's get approvals to proceed.\"  Suzlon Group has received the Notice of Proceed from CLP India for a 100.8 MW wing power project. The project located at Tejuva, Rajasthan, will comprise 48 units of Suzlon\u0092s robust S97-2.1 MW wind turbines featuring Doubly Fed Induction Generator technology. Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Group's 100.8 MW Rajasthan wind power project get approvals to proceed", "link": "http://www.moneycontrol.com/news/announcements/suzlon-groups-1008-mw-rajasthan-wind-power-project-get-approvals-to-proceed_1107412.html", "time": "9.56 am "}, {"date": " 18 Jun 2014", "content": "Jun 18, 2014, 09.46 AM  | Source: Moneycontrol.com\nSuzlon Energy gets CDR committee's nod to restructure existing bonds\nSuzlon Energy has received approval of the Corporate Debt Restructuring Empowered Group for the restructuring proposal and has also received approval of the Reserve Bank of India, subject to specified conditions.\nLike this story, share it with millions of investors on M3\nSuzlon Energy gets CDR committees nod to restructure existing bonds\nSuzlon Energy has received approval of the Corporate Debt Restructuring Empowered Group for the restructuring proposal and has also received approval of the Reserve Bank of India, subject to specified conditions.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Company had, pursuant to a resolution passed by its Board of Directors on May 03, 2014, issued separate notices each dated May 06, 2014 convening meetings of the holders of the 0% October 2012 Bonds, the 7.5% October 2012 Bonds, the 0% July 2014 Bonds and the 5% April 2016 Bonds to consider the proposed restructuring of the Existing Bonds. The meetings of the holders of the Existing Bonds are proposed to be held on July 09, 2014. In furtherance to the same, the Company has issued a consent solicitation memorandum and an information memorandum each dated June 17, 2014, providing further information in relation to the commercial terms of the proposed restructuring of the Existing Bonds, including the terms and conditions of the new foreign currency convertible bonds (the \"Restructured Bonds\").The Company has received approval of the Corporate Debt Restructuring Empowered Group for the restructuring proposal and has also received approval of the Reserve Bank of India, subject to specified conditions. The restructuring proposal, including the terms of the Restructured Bonds, is subject to the approval by the requisite majority of the holders of the Existing Bonds in each series.Source : BSE\n", "title": "Suzlon Energy gets CDR committee's nod to restructure existing bonds", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-gets-cdr-committees-nod-to-restructure-existing-bonds_1106686.html", "time": "9.46 am "}], [{"date": " 05 Jun 2014", "content": "Jun 05, 2014, 03.37 PM  | Source: PTI\nSuzlon bags Rs 750 cr order from ReNew Wind Power\nThe order for 100.8 MW wind farms has been awarded by ReNew Wind Power. \"The project is scheduled for execution at the Bhesada wind site, Dist Jaisalmer, Rajasthan,\" Suzlon said in a statement today.\nLike this story, share it with millions of investors on M3\nSuzlon bags Rs 750 cr order from ReNew Wind Power\nThe order for 100.8 MW wind farms has been awarded by ReNew Wind Power. \"The project is scheduled for execution at the Bhesada wind site, Dist Jaisalmer, Rajasthan,\" Suzlon said in a statement today.\nPost your opinion here\n \nWind turbine maker  Suzlon Energy has bagged an order worth about Rs 750 crore for a project in Rajasthan.\nThe order for 100.8 MW wind farms has been awarded by ReNew Wind Power. \"The project is scheduled for execution at the Bhesada wind site, Dist Jaisalmer, Rajasthan,\" Suzlon said in a statement today.\nIt is a repeat order placed by ReNew Wind Power. Sources said the order is worth around Rs 750 crore. Besides supplying 48 units of S97-120 m wind turbine generators, Suzlon Group would also oversee operations, maintenance and service of the wind site over the contracted period, the statement said.\nAlso read: Suzlon eyes growth of 40% in both global & Indian markets  \n\"Leveraging on our leadership position within the country, we continue to have  a strong focus on the Indian market as it offers a favourable renewable energy environment especially now with the new Government in place. We continue to create innovative and reliable products...,\" Suzlon Energy Chairman Tulsi Tanti said.\nReNew Wind Power Chairman and Managing Director Sumant Sinha said the deal reinforces its commitment to developing sustainable energy solutions for India.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:15 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon bags Rs 750 cr order from ReNew Wind Power", "link": "http://www.moneycontrol.com/news/business/suzlon-bags-rs-750-cr-orderrenew-wind-power_1099525.html", "time": "2.03 pm "}, {"date": " 02 Jun 2014", "content": "Jun 02, 2014, 07.32 PM  | Source: CNBC-TV18\nSuzlon eyes growth of 40% in both global & Indian markets\nSuzlon Energy shares rose as much as 10 percent after its earnings before interest, taxes, depreciation, and amortization (Ebitda) for the March quarter turned positive after a gap of seven quarters.\nLike this story, share it with millions of investors on M3\nSuzlon eyes growth of 40% in both global & Indian markets\nSuzlon Energy shares rose as much as 10 percent after its earnings before interest, taxes, depreciation, and amortization (Ebitda) for the March quarter turned positive after a gap of seven quarters.\nPost your opinion here\nWe need to ramp up our volumes very quickly, which is our priority for FY15.\nKirti Vagadia\nCFO\nSuzlon Energy\nKirti Vagadia, group head-finance, Suzlon Group says favourable product mix was the key factor for the wind turbine maker’s impressive performance in Q4.\nSuzlon Energy  shares rose as much as 10 percent after its earnings before interest, taxes, depreciation, and amortization (EBITDA) for the March quarter turned positive after a gap of seven quarters. Its net loss for the quarter ended 31 March narrowed to Rs 603.45 crore from Rs 1,912.72 crore in the year-ago period, helped by cost reductions and restructuring of operations.\nVagadia says the company will turn PAT-positive if it achieves revenue of Rs 7,000-7,500 crore on a quarterly basis. Currently, it has a order backlog of Rs 46,000 crore.\nThe debt-laden company has plans to raise about Rs 1,000 crore from sale of non-core assets this fiscal year. Besides, Suzlon is exploring new markets for business opportunities. The company has already mopped up more than Rs 700 crore by selling two non-core assets.\nAlso Read: Suzlon restructures FCCBs; eyes quarterly breakeven in FY15  \nSuzlon realised about Rs 550 crore from the sale of US-based Big Sky wind farm and around Rs 173 crore by offloading stake in a Chinese manufacturing facility. For the current fiscal, the company would mainly focus on ramping up volumes, boosting business efficiency and optimising capital structure.\n“We expect a growth of 40 percent in both global and indian markets,” he told CNBC-TV18’s Sonia Shenoy and Latha Venkatesh.\nBelow is verbatim transcript of the interview on CNBC-TV18\nLatha: There is a swing at the earnings before interest, tax and amortization (EBITA) level. When does the swing happen at the net level? And when do you turn black at a net profit level?\nA: It was our priority to deliver the operational profit in Q4 of last year. Our increase in revenue, favorable market and product mix has been a key factor behind delivering this operational profit. However, our quarterly interest cost in case of net profit at profit after tax (PAT) level is about Rs 430 crore. For delivering quarterly profitability at net level, we need Rs 1200-1500 crore more of revenue i.e. about Rs 7000-7500 crore of revenue can generate us a net profit level.\nSonia: Do you think that this Rs 7500 crore revenue figure could be achieved in FY15? What is the order book visibility for FY15?\nA: We have a strong order backlog at Rs 46000 crore and is thus, not an issue for us. Ramping up our volume is our priority for FY15.\nLatha: Is Rs 7500 crore your FY15 target?\nA: It is the quarterly revenue target.\nLatha: Do you see it happening in this year?\nA: We have attempted for it to happen in this year.\nSonia: What does the Senvion performance look like in Q4? Also, what kind of trajectory would you expect for FY15?\nA: I would not prefer to go for any of our subsidiaries on a quarterly basis. However, in context to the annual profitability, Senvion has delivered revenue of about EUR 1.8 billion-- 8 percent of the revenue, and EBITA of 145 million— about 5.5 percent in FY14.\nSo far, since our acquisition of Senvion in 2007, it has remained in a profitable growth mode. While the last three years were bad for the industry, Senvion has continued to make profit. The most remarkable factor about Senvion’s performance is that it gave a 25 percent increase in EBITA despite the 20 percent decline in revenue last year; indicating that we  have delivered only profitable orders.\nLatha: Are you considering re-listing Senvion? If yes, on which bourse ?\nA: Though re-listing Senvion is of the options that we may explore, optimizing our capital structure is one of our key priorities in FY15 and is also one of our options.\nLatha: Would it be the entire company or a part of it? Will it be in the London Stock Exchange or here in India?\nA: We will only be able to discuss such details once we have finalized our plans. I just wanted to highlight the improved valuation of wind OEM. European wind OEMs are trading slightly at 10 multiple of EBITA and is therefore, an attractive option.\n", "title": "Suzlon eyes growth of 40% in both global & Indian markets", "link": "http://www.moneycontrol.com/news/resultsboardroom/suzlon-eyes-growth40both-globalindian-markets_1096802.html", "time": "11.13 am "}, {"date": " 01 Jun 2014", "content": "Jun 02, 2014, 08.47 AM  | Source: PTI\nSuzlon to raise Rs 1K cr from non-core asset sales in FY15\nSuzlon realised about Rs 550 crore from the sale of US-based Big Sky wind farm and around Rs 173 crore by offloading stake in a Chinese manufacturing facility.\nLike this story, share it with millions of investors on M3\nSuzlon to raise Rs 1K cr from non-core asset sales in FY15\nSuzlon realised about Rs 550 crore from the sale of US-based Big Sky wind farm and around Rs 173 crore by offloading stake in a Chinese manufacturing facility.\nPost your opinion here\n \nWind turbine maker Suzlon Energy , which is working on its business revival strategy, plans to raise about Rs 1,000 crore from sale of non-core assets this financial year.\nBesides, Suzlon is exploring new markets for business opportunities, according to a top company official.\n\"We continue to work on selling non-core assets. We expect to raise around Rs 1,000 crore through sale of non-crore assets this fiscal (2014-15),\" Suzlon Group Head of Finance Kirti Vagadia told PTI.\nThe wind energy major has already mopped up more than Rs 700 crore by selling two non-core assets.\nSuzlon realised about Rs 550 crore from the sale of US-based Big Sky wind farm and around Rs 173 crore by offloading stake in a Chinese manufacturing facility.\nFor the current fiscal, the company would mainly focus on ramping up volumes, boosting business efficiency and optimising capital structure.\nNoting that the \"future looks bright\" for the company, Vagadia said he expects good revenues in the current fiscal.\nWhen asked about future business plans, Vagadia, without divulging specific details, said the company is \"exploring new markets\".\nIn signs that its restructuring efforts are reaping results, the company saw its consolidated net loss narrow to Rs 603.45 crore in the three months ended March 2014. The same stood at Rs 1,912.72 crore in the year-ago period.\nDuring the latest January-March period, revenue jumped to Rs 6,645.05 crore -- the highest in eight quarters.\nIn comparable period, revenue stood at Rs 4,336.44 crore.\nThe fourth quarter results are \"remarkable\" and the performance was helped by leveraging favourable geographical and products mix as well as cost management, Vagadia said.\nAt the end of March this year, Suzlon Group's order book was worth about USD 7.2 billion.\nWhile announcing the financial results late Friday, Suzlon Group Chairman Tulsi Tanti said that last fiscal it achieved significant progress by improving business efficiency.\n\"The group is now  transiting from a restructuring mode to a growth phase given the opportunities due to strong industry outlook,\" he had said.\nLast year, Suzlon had launched a Comprehensive Liability Management Programme. With the CDR (Corporate Debt Restructuring) implemented, overseas forex facility refinanced via largest and unique credit enhanced bonds issuance the programme has now reached its last leg, the company said on Friday.\n\"The bondholder's meeting is scheduled on July 9, 2014 to approve a restructuring proposal including cashless exchange into new bonds with five-year bullet maturity,\" it had said.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:15 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon to raise Rs 1K cr from non-core asset sales in FY15", "link": "http://www.moneycontrol.com/news/business/suzlon-to-raise-rs-1k-crnon-core-asset-salesfy15-_1096617.html", "time": "2.06 pm "}, {"date": " 31 May 2014", "content": "May 31, 2014, 11.28 AM  | Source: Moneycontrol.com\nSuzlon Energy consolidated Mar '14 sales at Rs 6,645.05 crore\nSuzlon Energy has reported a sales turnover of Rs 6,645.05 crore and a net loss of Rs 603.45 crore for the quarter ended Mar '14\nLike this story, share it with millions of investors on M3\nSuzlon Energy consolidated Mar 14 sales at Rs 6,645.05 crore\nSuzlon Energy has reported a sales turnover of Rs 6,645.05 crore and a net loss of Rs 603.45 crore for the quarter ended Mar '14\nPost your opinion here\n \nSuzlon Energy has reported a consolidated sales turnover of Rs 6,645.05 crore and a net loss of Rs 603.45 crore for the quarter ended Mar '14. Other income for the quarter was Rs 38.23 crore.\nFor the quarter ended Mar 2013 the consolidated sales turnover was Rs 4,336.44 crore and net loss was Rs 1,912.72 crore, and other income Rs 22.80 crore.\nSuzlon Energy shares closed at 22.28 on May 29, 2014 (BSE) and has given 127.35% returns over the last 6 months and 70.86% over the last 12 months.\nSuzlon Energy\n", "title": "Suzlon Energy consolidated Mar '14 sales at Rs 6,645.05 crore", "link": "http://www.moneycontrol.com/news/results/suzlon-energy-consolidated-mar-14-sales-at-rs-664505-crore_1096315.html", "time": "11.28 am "}, {"date": " 30 May 2014", "content": "May 30, 2014, 08.56 PM  | Source: PTI\nSuzlon Q4 net loss narrows to Rs 603.45 crore\nTotal income during the said quarter rose to Rs 6,645.05 crore, from against Rs 4,336.44 crore in the corresponding period of the previous financial year (2012-13).\nLike this story, share it with millions of investors on M3\nSuzlon Q4 net loss narrows to Rs 603.45 crore\nTotal income during the said quarter rose to Rs 6,645.05 crore, from against Rs 4,336.44 crore in the corresponding period of the previous financial year (2012-13).\nPost your opinion here\n \nWind turbine maker Suzlon Group today reported a consolidated net loss of Rs 603.45 crore for the fourth quarter of 2013-14 against a loss of Rs 1,912.72 crore in the same period last fiscal.\nTotal income during the said quarter rose to Rs 6,645.05 crore, from against Rs 4,336.44 crore in the corresponding period of the previous financial year (2012-13).\n\"Our revenue in Q4 is the highest in the last eight quarters,\" Kirti Vagadia, Group Head of Finance, said in a statement.\n\"On the FCCB front, the Board has approved cashless restructuring of its Foreign Currency Convertible Bonds (FCCBs) and the new restructured FCCBs will come up for maturity in July 2019,\" he said.\nSuzlon , in April, implemented the USD 1.8 billion (Rs 9,500 crore) debt restructuring package that includes preferential allotment of shares to its lenders.\nThe debt recast of USD 1.8 billion was formally approved in January this year by the company's domestic lenders -- a consortium of 19 banks.\n\"The group is now transiting from a restructuring mode to a growth phase given the opportunities due to strong industry outlook. In FY'15, our key priorities will be to ramp up volumes, improving business efficiency and rebalancing our capital structure,\" Suzlon Group Chairman Tulsi Tanti said.\nFor full 2013-14 year, the company reported a loss of Rs 3,519.97 crore, against a loss of Rs 4,723.96 crore in the previous financial year. Total income rose to Rs 20,402.86 crore in FY14, from 18,913.53 crore in FY13.\nSuzlon Group acquired Big Sky Wind Park in the US from Edison Mission Energy. The wind park consisting of 114 turbines is located in Illinois, US.\nShares of the company closed at Rs 21.96, down 1.44 per cent on the BSE.\nREAD MORE ON   Suzlon Energy\nSet email alert for\n", "title": "Suzlon Q4 net loss narrows to Rs 603.45 crore", "link": "http://www.moneycontrol.com/news/results/suzlon-q4-net-loss-narrows-to-rs-60345-crore_1096087.html", "time": "8.56 pm "}, {"date": " 27 May 2014", "content": "May 27, 2014, 10.39 AM  | Source: CNBC-TV18\nBull's Eye: Buy Alembic Pharma, Wipro, BEML, GMR Infra\nShahina Mukadam of Varun Capital recommends buying Alembic Pharma with a target of Rs 256 and Wipro with a target of Rs 530.\nLike this story, share it with millions of investors on M3\nBulls Eye: Buy Alembic Pharma, Wipro, BEML, GMR Infra\nShahina Mukadam of Varun Capital recommends buying Alembic Pharma with a target of Rs 256 and Wipro with a target of Rs 530.\nPost your opinion here\nBull's Eye\nBull's Eye, CNBC-TV18's popular game show, where market experts come together to dish out trading strategies for you to make your week more exciting and compete with each other to see whose portfolio is the strongest.\nOn Bull's Eye this week - Shahina Mukadam of Varun Capital, AK Prabharkar, Independent Advisor and Pankaj Jain of Sunteck Wealthmax are battling it out for the strongest portfolio. Let’s hear out their picks for today.\nShahina Mukadam of Varun Capital\nBuy Alembic Pharma  with a target of Rs 256 and a stoploss of Rs 240.\nBuy Wipro  with a target of Rs 530 and a stoploss of Rs 494.\nShort Mcleod Russel  with a target of Rs 266 and a stoploss of Rs 284.\nShort HDIL  with a target of Rs 86 and a stoploss of Rs 101.\nDisclosure: She doesn't hold any stocks discussed but may have recommended them to clients.\nAK Prabharkar, Independent Advisor\nBuy Andhra Bank  with a target of Rs 115 and a stoploss of Rs 93.50.\nBuy Mahindra Holidays  with a target of Rs 320 and a stoploss of Rs 268.\nBuy Jaiprakash Associates  with a target of Rs 83 and a stoploss of Rs 74.\nBuy Igarashi Motors  with a target of Rs 225 and a stoploss of Rs 174.\nDisclosure: He doesn't hold any stocks discussed but may have recommended them to clients.\nPankaj Jain of Sunteck Wealthmax\nBuy Suzlon Energy  with a target of Rs 25.50 and a stoploss of Rs 22.40.\nBuy National Buildings Construction  with a target of Rs 314 and a stoploss of Rs 283.\nBuy BEML  with a target of Rs 645 and a stoploss of Rs 595.\nBuy GMR Infra  with a target of Rs 37.30 and a stoploss of Rs 33.\nDisclosure: He doesn't hold any stocks discussed but may have recommended them to clients.\n", "title": "Bull's Eye: Buy Alembic Pharma, Wipro, BEML, GMR Infra", "link": "http://www.moneycontrol.com/news/stocksviews/bulls-eye-buy-alembic-pharma-wipro-beml-gmr-infra_1093161.html", "time": "9.04 am "}, {"date": " 16 May 2014", "content": "May 16, 2014, 05.22 PM  | Source: Moneycontrol.com\nSuzlon Energy to allot 3.48ce equity shares\nSuzlon Energy at its meeting held on May 16, 2014, approved allotment of 3,48,40,583 equity shares of Rs 2 each of the Company in dematerialised form to one of the Promoter Group Entities pursuant to conversion notice received for conversion of 47 Compulsorily Convertible Debentures of a face value of Rs 1,00,00,000 each.\nLike this story, share it with millions of investors on M3\nSuzlon Energy to allot 3.48ce equity shares\nSuzlon Energy at its meeting held on May 16, 2014, approved allotment of 3,48,40,583 equity shares of Rs 2 each of the Company in dematerialised form to one of the Promoter Group Entities pursuant to conversion notice received for conversion of 47 Compulsorily Convertible Debentures of a face value of Rs 1,00,00,000 each.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Securities Issue Committee of the Board of Directors of the Company has, at its meeting held on May 16, 2014, approved allotment of 3,48,40,583 (Three Crores Forty Eight Lacs Forty Thousand Five Hundred Eighty Three) Equity Shares of Rs. 2/- (Rupees Two Only) each of the Company in dematerialised form to one of the Promoter Group Entities pursuant to conversion notice received for conversion of 47 (Forty Seven) Compulsorily Convertible Debentures of a face value of Rs. 1,00,00,000/- each.The said 3,48,40,583 (Three Crores Forty Eight Lacs Forty Thousand Five Hundred Eighty Three) Equity Shares shall be locked in for a period of one year from the date of allotment in terms of the ICDR Regulations.Source : BSE\n", "title": "Suzlon Energy to allot 3.48ce equity shares", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-to-allot-348ce-equity-shares_1087547.html", "time": "5.22 pm "}, {"date": " 16 May 2014", "content": "May 16, 2014, 03.16 PM  | Source: Moneycontrol.com\nSuzlon Energy: Outcome of securities issue committee meeting\nSuzlon Energy at its meeting held on May 16, 2014, approved allotment of 47 Compulsorily Convertible Debentures of a face value of Rs 1,00,00,000 each on preferential basis to one of the Promoter Group Entities.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Outcome of securities issue committee meeting\nSuzlon Energy at its meeting held on May 16, 2014, approved allotment of 47 Compulsorily Convertible Debentures of a face value of Rs 1,00,00,000 each on preferential basis to one of the Promoter Group Entities.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Securities Issue Committee of the Board of Directors of the Company has, at its meeting held on May 16, 2014, approved allotment of 47 (Forty Seven) Compulsorily Convertible Debentures of a face value of Rs. 1,00,00,000/- (Rupees One Crore Only) each on preferential basis under Chapter VII of the ICDR Regulations to one of the Promoter Group Entities in consideration of the conversion of Promoter Contribution of Rs. 47 Crores brought-in in terms of the CDR Package in terms of the approval granted by the shareholders of the Company on April 12, 2013.The said 47 (Forty Seven) Compulsorily Convertible Debentures are subject to lock-in for a period of one year from the date of allotment in terms of the ICDR Regulations.Source : BSE\n", "title": "Suzlon Energy: Outcome of securities issue committee meeting", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-outcomesecurities-issue-committee-meeting_1087405.html", "time": "3.16 pm "}, {"date": " 06 May 2014", "content": "May 06, 2014, 11.10 AM  | Source: Moneycontrol.com\nSuzlon Group signs agreement to supply up to 47 WTG's with PowerWorks, USA\nSuzlon Group, today announced via their fully owned US based subsidiary SWECO its agreement to supply PowerWorks up to 98.7 MW of wing turbines. As per the agreement Suzlon Group will supply up to 47 WTG\u0092s and will oversee the operations, maintenance and service of the wind turbines for a period of two years.\nLike this story, share it with millions of investors on M3\nSuzlon Group signs agreement to supply up to 47 WTGs with PowerWorks, USA\nSuzlon Group, today announced via their fully owned US based subsidiary SWECO its agreement to supply PowerWorks up to 98.7 MW of wing turbines. As per the agreement Suzlon Group will supply up to 47 WTG\u0092s and will oversee the operations, maintenance and service of the wind turbines for a period of two years.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated May 06, 2014 titled \"Suzlon Group signs agreement to supply up to 47 WTG's with PowerWorks, USA\".  Suzlon Group, today announced via their fully owned US based subsidiary SWECO its agreement to supply PowerWorks up to 98.7 MW of wing turbines. As per the agreement Suzlon Group will supply up to 47 WTG\u0092s and will oversee the operations, maintenance and service of the wind turbines for a period of two years. Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Group signs agreement to supply up to 47 WTG's with PowerWorks, USA", "link": "http://www.moneycontrol.com/news/announcements/suzlon-group-signs-agreement-to-supplyto-47-wtgspowerworks-usa_1079910.html", "time": "11.10 am "}, {"date": " 05 May 2014", "content": "May 05, 2014, 08.54 PM  | Source: CNBC-TV18\nSuzlon restructures FCCBs; eyes quarterly breakeven in FY15\nSpeaking to CNBC-TV18, Kirti Vagadia, group head (corporate finance) at Suzlon said the interest rate of FCCBs will be closer to 5 percent.\nLike this story, share it with millions of investors on M3\nSuzlon restructures FCCBs; eyes quarterly breakeven in FY15\nSpeaking to CNBC-TV18, Kirti Vagadia, group head (corporate finance) at Suzlon said the interest rate of FCCBs will be closer to 5 percent.\nPost your opinion here\nWe expect all regulatory approvals by middle of June. We will be having a bondholder’s formal meeting on July 9.\nKirti Vagadia\nCFO\nSuzlon Energy\nWind power company Suzlon Group’s board has approved a cashless restructuring of its foreign currency convertible bonds (FCCBs). The size of the issue is about USD 485 million subject to necessary approvals, the company said in a statement issued on Saturday.\nSpeaking to CNBC-TV18, Kirti Vagadia, group head (corporate finance) at Suzlon said the interest rate of FCCBs will be closer to 5 percent. “The total interest burden on annual basis is at Rs 1,300-1,400 crore right now,” he said. He expects to receive regulatory approvals by mid-June. The group said the new bonds are due 5 years and 1 day from the date of issue, to mature in financial year 2019-20.\nAlso Read: Suzlon Energy to sell Rs 1000cr of non-core local assets\nSuzlon  CDR debt currently stands at around Rs 9000 crore, while its FX debt (including FCCBs) currently stands at around USD 1 billion. There will be another board meeting on July 9. The company is looking to sell Rs 1,000 crore of non-core assets in FY15 to cut debt. “We will try to achieve quarterly breakeven in FY15,” Vagadia said.\nThe company may also explore the option of listing REpower, which remains one of its strongest assets, Vagadia said.  \nBelow is the transcript of Vagadia’s interview to CNBC-TV18’s Latha Venkatesh, Pragya Bhardwaj and Sonia Shenoy.\nLatha: Can you take us through the terms of the restructuring? We have not got the interest rate on the new bonds?\nA: I have already mentioned in my release that the interest rate would be according to Reserve Bank of India (RBI) ceiling and it is around 5 percent. Initially, for first 18 months, it is lower rate and then it is stepping up. Overall basis, it is closer to 5 percent, which is RBI’s ceiling on the annual credit plan (ACP).\nLatha: What are the other terms of the bond; it is a USD 458 million FCCB issue?\nA: Yes. It takes care of my all four outstanding series of foreign currency convertible bonds (FCCBs) and the principle amount is around USD 484 million. It is about 10 percent premium on SEBI floor price of shares and it is a five year bond. So maturity would be roughly in July 2019.\nSonia: When do you expect to get the necessary approvals from the regulators on this particular FCCB?\nA: Regulatory approval is something, which is always in the hands of regulator. But we have budgeted certain period. We expect all regulatory approvals by middle of June. We will be having a bondholder’s formal meeting on July 9.\nLatha: What is your current outflow of interest for FY15, counting both the foreign outflows, the dollar outflows as well as the rupee outflows?\nA: As you are aware that some of our interest, which is on term loan is getting converted into equity, so it is not a cash outflow. So if you take total interest burden on the company on an annual basis it is roughly about Rs 1300-1400 crore. But if you take cash outflow on interest it is less than Rs 500 crore.\nSonia: So how much of your non-core assets you would be able to sell in this financial year in order to repay your debt?\nA: We have sold our China asset as well as our US asset, which is Edison Mission. We are further targeting to sell roughly about Rs 1000 crore from non-core asset. This Rs 1000 crore will be sold within FY15 itself that is our target.\nLatha: So what is the debt now and what will it come down to, what is the timetable you are looking at?\nA: If you take the corporate debt restructuring (CDR) it is roughly about Rs 9000 crore and over and above that is foreign currency debt of roughly about a billion dollars.\nSonia: When do you think Suzlon could manage to breakeven with this bond agreement also in place do you think there could be a breakeven within FY15 or do you think it would be in FY16?\nA: First let me brief you that this is a difficult period which I believe is over for us. Market is moving towards a growth phase so we have well within time restructured our organization. Now we are looking at about global and domestic market growth growing at a 40 percent rate as compared to last financial year. And you might be aware that despite all difficult period Suzlon has been able to maintain its global position at number five in this year as well. With all the stake holders supporting particularly our lenders, customers, suppliers, we are in a position to quickly go back to a volume growth. I don't want to give any target, but definitely in this particular financial year, we will try to achieve a quarterly breakeven as quickly as possible.\nPragya: So currently the FCCBs, which are outstanding on the company, is only USD 485 million, which the company has been able to restructure?\nA: That is correct.\nPragya: The other question is with regards to the listing of REpower. The company has made a lot of comments on that. There is a lot of market speculation. Could you give us a roadmap as to what is the company targeting on that front? Will we see something in this financial year given that REpower’s order inflows etc, has been fairly strong in the current global conditions or we will have to wait for some announcements on that?\nA: First let me say that REpower is one of the strongest assets in the wind energy. It has been generating significant growth and profit even in the worst financial years of wind industry. As compared to peer group it has maintained its profitability in last three years which was not good for wind industry.\nSo it is a very strong asset and as you are aware that financial market is very favourable for wind energy particularly debt and equity is now available very easily for wind energy market, wind energy companies. Valuation which was previously around multiple of EBITDA at four times has gone closer to 9-10 in the global market. So definitely the valuation of our company has also improved significantly.\nSenvion is the new name of REpower. I would not say that we will opt only for a listing as an option but definitely this is one of the options, which we may explore at a suitable time because we need to rebalance our capital structure.\nLatha: Is that suitable time the current financial year?\nA: I cannot comment on the timing of this. It is a function of many factors. However, this is one of our options, which we may explore at a suitable time.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:16 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon restructures FCCBs; eyes quarterly breakeven in FY15", "link": "http://www.moneycontrol.com/news/business/suzlon-restructures-fccbs-eyes-quarterly-breakevenfy15_1079081.html", "time": "10.22 am "}, {"date": " 05 May 2014", "content": "May 05, 2014, 08.51 AM  | Source: Moneycontrol.com\nSuzlon Group approves cashless restructuring of its FCCBs\nSuzlon Energy has informed that the Board of Directors of the Company has, by circular resolution, approved a cashless restructuring proposal in respect of the Existing Bonds, including, without limitation, the issuance of new foreign currency convertible bonds.\nLike this story, share it with millions of investors on M3\nSuzlon Group approves cashless restructuring of its FCCBs\nSuzlon Energy has informed that the Board of Directors of the Company has, by circular resolution, approved a cashless restructuring proposal in respect of the Existing Bonds, including, without limitation, the issuance of new foreign currency convertible bonds.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that the Board of Directors of the Company has, by circular resolution, approved a cashless restructuring proposal in respect of the Existing Bonds, including, without limitation, the issuance of new foreign currency convertible bonds (“Restructured Bonds”) in (a) substitution, by extraordinary resolution, of the accreted value and unpaid interest, if any (including default interest thereon), of the 0% October 2012 Bonds, the 7.5% October 2012 Bonds and the 0% July 2014 Bonds; (b) voluntary substitution of the accreted value and unpaid interest (including default interest thereon) of the 5% April 2016 Bonds (the “Voluntary Substitution”); (c) substitution, by extraordinary resolution, of the accreted value and unpaid interest (including default interest thereon) of the outstanding 5% April 2016 Bonds following the Voluntary Substitution (provided the principal amount of the 5% April 2016 Bonds outstanding exceeds USD 87.50 million), in an amount that is equal to USD 87.50 million less the principal amount of the 5% April 2016 Bonds substituted with the Restructured Bonds pursuant to the Voluntary Substitution plus premium and unpaid interest (including default interest thereon) in respect of such amount, which shall be effected in a pro rata manner; and (d) substitution, by extraordinary resolution, of the unpaid interest (including default interest thereon) in respect of any 5% April 2016 Bonds that are not substituted.In this regard, the Company has issued a Press Release.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Group approves cashless restructuring of its FCCBs", "link": "http://www.moneycontrol.com/news/announcements/suzlon-group-approves-cashless-restructuringits-fccbs_1079011.html", "time": "8.51 am "}, {"date": " 04 May 2014", "content": "May 05, 2014, 10.23 AM  | Source: Reuters\nSuzlon approves cashless restructuring of convertible bonds\nThe size of the issue is about USD 485 million subject to necessary approvals, the company said in a statement issued on Saturday.\nLike this story, share it with millions of investors on M3\nSuzlon approves cashless restructuring of convertible bonds\nThe size of the issue is about USD 485 million subject to necessary approvals, the company said in a statement issued on Saturday.\nPost your opinion here\n \nWind power company Suzlon Group said its board has approved a cashless restructuring of its foreign currency convertible bonds.\nThe size of the issue is about USD 485 million subject to necessary approvals, the company said in a statement issued on Saturday.\nAlso read: Suzlon hopes to get new wind projects of 300-500 MW in FY15  \nThe group said the new bonds are due 5 years and 1 day from the date of issue, to mature in financial year 2019-20.\nThe package \"is an optimal solution to our last remaining piece under the comprehensive liability management programme,\" Kirti Vagadia, Suzlon's group head – corporate finance, said in a statement.\nSuzlon Group comprises Suzlon Energy Ltd and its subsidiaries.\n \nSuzlon Energy stock price\nOn December 18, 2015, at  12:17 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon approves cashless restructuring of convertible bonds", "link": "http://www.moneycontrol.com/news/business/suzlon-approves-cashless-restructuringconvertible-bonds_1078972.html", "time": "11.26 pm "}, {"date": " 25 Apr 2014", "content": "Apr 28, 2014, 08.43 AM  | Source: PTI\nSuzlon bags 370 MW orders in first three months of 2014\nThe wind power major will supply turbines for wind farms in Germany, the UK, India, Belgium and other European nations. In the fourth quarter of 2013-14, the company signed contracts for 370 MW, it said in a statement today.\nLike this story, share it with millions of investors on M3\nSuzlon bags 370 MW orders in first three months of 2014\nThe wind power major will supply turbines for wind farms in Germany, the UK, India, Belgium and other European nations. In the fourth quarter of 2013-14, the company signed contracts for 370 MW, it said in a statement today.\nPost your opinion here\n \nThe Suzlon  Group bagged contracts for wind energy capacity of 370 MW in the first three months of this year, with projects spread across Europe and India.\nThe wind power major will supply turbines for wind farms in Germany, the UK, India, Belgium and other European nations. In the fourth quarter of 2013-14, the company signed contracts for 370 MW, it said in a statement today.\n\"The orders represent not only the rapid globalisation of our business, but also the value proposition Suzlon has to offer to its clients,\" Suzlon Group Head (Corporate Finance) Kirti Vagadia said.\nAlso read:  Suzlon Energy to sell Rs 1000cr of non-core local assets\nGroup firm Senvion SE's CEO Andreas Nauen said it has suitable turbines for each individual site in the product portfolio.\n\"That's why we are optimistic to extend our market share in Senvion's key markets,\" Nauen noted. Suzlon has an order book worth about USD 7.7 billion.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:17 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon bags 370 MW orders in first three months of 2014", "link": "http://www.moneycontrol.com/news/business/suzlon-bags-370-mw-ordersfirst-three-months2014-_1074661.html", "time": "6.40 pm "}, {"date": " 10 Apr 2014", "content": "Apr 11, 2014, 11.24 AM  | Source: PTI\nSuzlon Energy to sell Rs 1000cr of non-core local assets\nTanti said the sale of non-critical assets would be in India only. He said the company was in the process of strengthening its balance sheet.\nLike this story, share it with millions of investors on M3\nSuzlon Energy to sell Rs 1000cr of non-core local assets\nTanti said the sale of non-critical assets would be in India only. He said the company was in the process of strengthening its balance sheet.\nPost your opinion here\n \nWind power major  Suzlon Energy plans to sell Rs 1,000 crore of non-core assets to cut debt, Chairman and Managing Director Tulsi Tanti said today. \"We are going to sell Rs 1,000 crore more non-critical assets within the country. This will help us in reducing the piling debt,\" Tanti told reporters on the sidelines of a seminar organised by the CII.\nSuzlon said yesterday it sold the Big Sky Wind Farm in Illinois to EverPower Wind Holdings , without disclosing the value. The Indian company had announced the acquisition of Big Sky on April 2.\nTanti said the sale of non-critical assets would be in India only. He said the company was in the process of strengthening its balance sheet. \"How we will do that will be known after some time,\" Tanti said. With an installed wind energy capacity of 24,000 MW globally, 70 percent of Suzlon's revenue comes from overseas.\nIn India, the company's installed capacity was 8,000 MW with a 40 percent market share. \"Our next target is to set up an installed capacity of 1 lakh MW,\" he said.\nThe company's order book position globally at the moment was about USD 8 billion.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:17 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon Energy to sell Rs 1000cr of non-core local assets", "link": "http://www.moneycontrol.com/news/business/suzlon-energy-to-sell-rs-1000crnon-core-local-assets_1067593.html", "time": "9.17 pm "}], [{"date": " 09 Apr 2014", "content": "Apr 09, 2014, 03.12 PM  | Source: PTI\nSuzlon sells Big Sky Wind Farm to EverPower Wind Holdings\nSuzlon Group, which recently bought the Big Sky Wind Farm in Illinois from Edison Mission Energy, has sold it to EverPower Wind Holdings.\nLike this story, share it with millions of investors on M3\nSuzlon sells Big Sky Wind Farm to EverPower Wind Holdings\nSuzlon Group, which recently bought the Big Sky Wind Farm in Illinois from Edison Mission Energy, has sold it to EverPower Wind Holdings.\nPost your opinion here\n \nSuzlon  Group, which recently bought the Big Sky Wind Farm in Illinois from Edison Mission Energy, has sold it to EverPower Wind Holdings.\n\"Suzlon Group announced the strategic sale of the 240 MW Big Sky Wind Farm in Illinois to EverPower Wind Holdings,\" the company said in a statement without disclosing the value of the sale.\nSuzlon Group had recently acquired the Big Sky wind farm from Edison Mission Energy via their fully owned US-based subsidiary Suzlon Wind Energy Corp (SWECO), the statement said.\n\"We are very pleased to welcome EverPower to the Suzlon family of customers,\" said Duncan Koerbel, CEO of Suzlon Wind Energy Corporation and CTO of the Suzlon Group.\n\"We are pleased to add this project to our portfolio,\" said James Spencer, President and Chief Executive Officer of EverPower.\n\"This sale of Big Sky Wind Farm to a sound long term investor like EverPower is an important part of our disinvestment strategy to hive off non-core assets, and the\nnet proceeds of the sale will be used to fuel our business growth,\" said Kirti Vagadia, Group Head, Finance at Suzlon.\nCompleted in early 2011, the Big Sky Project utilizes 114 Suzlon 2.1 MW turbines to generate enough electricity per annum for nearly 50,000 homes while also offsetting over\n225,000 tonnes of carbon emissions.\nShares of Suzlon Energy were trading at Rs 14.97, up 7.23 percent on the BSE.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:17 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon sells Big Sky Wind Farm to EverPower Wind Holdings", "link": "http://www.moneycontrol.com/news/business/suzlon-sells-big-sky-wind-farm-to-everpower-wind-holdings_1066601.html", "time": "3.12 pm "}, {"date": " 09 Apr 2014", "content": "Apr 09, 2014, 03.03 PM  | Source: PTI\nSuzlon sells Big Sky Wind Farm to EverPower Wind Holdings\n\"Suzlon Group announced the strategic sale of the 240 MW Big Sky Wind Farm in Illinois to EverPower Wind Holdings,\" the company said in a statement without disclosing the value of the sale.\nLike this story, share it with millions of investors on M3\nSuzlon sells Big Sky Wind Farm to EverPower Wind Holdings\n\"Suzlon Group announced the strategic sale of the 240 MW Big Sky Wind Farm in Illinois to EverPower Wind Holdings,\" the company said in a statement without disclosing the value of the sale.\nPost your opinion here\n \nSuzlon  Group, which recently bought the Big Sky Wind Farm in Illinois from Edison Mission Energy, has sold it to EverPower Wind Holdings.\n\"Suzlon Group announced the strategic sale of the 240 MW Big Sky Wind Farm in Illinois to EverPower Wind Holdings,\" the company said in a statement without disclosing the value of the sale.\nSuzlon Group had recently acquired the Big Sky wind farm from Edison Mission Energy via their fully owned US-based subsidiary Suzlon Wind Energy Corp (SWECO), the statement said.\n\"We are very pleased to welcome EverPower to the Suzlon family of customers,\" said Duncan Koerbel, CEO of Suzlon Wind Energy Corporation and CTO of the Suzlon Group.\nAlso read:  Suzlon signs Euro 850 mn loan pact with consortium of banks\n\"We are pleased to add this project to our portfolio,\" said James Spencer, President and Chief Executive Officer of EverPower.\n\"This sale of Big Sky Wind Farm to a sound long term investor like EverPower is an important part of our disinvestment strategy to hive off non-core assets, and the net proceeds of the sale will be used to fuel our business growth,\" said Kirti Vagadia, Group Head, Finance at Suzlon.\nCompleted in early 2011, the Big Sky Project utilizes 114 Suzlon 2.1 MW turbines to generate enough electricity per annum for nearly 50,000 homes while also offsetting over 225,000 tonnes of carbon emissions.\nShares of Suzlon Energy were trading at Rs 14.97, up 7.23 percent on the BSE.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:17 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon sells Big Sky Wind Farm to EverPower Wind Holdings", "link": "http://www.moneycontrol.com/news/business/suzlon-sells-big-sky-wind-farm-to-everpower-wind-holdings_1066671.html", "time": "3.03 pm "}, {"date": " 09 Apr 2014", "content": "Apr 09, 2014, 12.04 PM  | Source: Moneycontrol.com\nSuzlon announces sell of 240 MW big sky wind farm to EverPower\nSuzlon group today announced the strategic sale of the 240 MW Big Sky wind farm in Illinois to EverPower Wind Holdings Inc.\nLike this story, share it with millions of investors on M3\nSuzlon announces sell of 240 MW big sky wind farm to EverPower\nSuzlon group today announced the strategic sale of the 240 MW Big Sky wind farm in Illinois to EverPower Wind Holdings Inc.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated April 09, 2014 titled \"Suzlon Announces Sale of 240 MW Big Sky Wind Farm to EverPower\".  Suzlon group today announced the strategic sale of the 240 MW Big Sky wind farm in Illinois to EverPower Wind Holdings Inc.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon announces sell of 240 MW big sky wind farm to EverPower", "link": "http://www.moneycontrol.com/news/announcements/suzlon-announces-sell240-mw-big-sky-wind-farm-to-everpower_1066516.html", "time": "12.04 pm "}, {"date": " 09 Apr 2014", "content": "Apr 09, 2014, 09.43 AM  | Source: Moneycontrol.com\nSuzlon's German subsidiary Senvion SE signs agreement with consortium of banks\nSenvion SE, a wholly owned subsidiary of the Suzlon Group, signed an agreement in late March with a consortium of banks headed by BayernLB, Commerzbank Aktiengesellschaft and Deutsche Bank AG for a syndicated working capital facilities of EUR 850 million for the period of 3 years.\nLike this story, share it with millions of investors on M3\nSuzlons German subsidiary Senvion SE signs agreement with consortium of banks\nSenvion SE, a wholly owned subsidiary of the Suzlon Group, signed an agreement in late March with a consortium of banks headed by BayernLB, Commerzbank Aktiengesellschaft and Deutsche Bank AG for a syndicated working capital facilities of EUR 850 million for the period of 3 years.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated April 08, 2014 titled \"Suzlon Groups German subsidiary Senvion SE signs agreement with consortium of banks, increases financing framework to EUR 850 million for a 3 year period\".Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon's German subsidiary Senvion SE signs agreement with consortium of banks", "link": "http://www.moneycontrol.com/news/announcements/suzlons-german-subsidiary-senvion-se-signs-agreementconsortiumbanks_1066412.html", "time": "9.43 am "}, {"date": " 09 Apr 2014", "content": "Apr 09, 2014, 10.44 AM  | Source: CNBC-TV18\nTop 10 stocks to be watched out for today\nAccording to CNBC-TV18’s research team following are the stocks to keep an eye on - BPCL , HDFC , SBI , Sun Pharma, Ranbaxy, Maruti, GVK, Suzlon, Emami, Bank Nifty.\nLike this story, share it with millions of investors on M3\nTop 10 stocks to be watched out for today\nAccording to CNBC-TV18’s research team following are the stocks to keep an eye on - BPCL , HDFC , SBI , Sun Pharma, Ranbaxy, Maruti, GVK, Suzlon, Emami, Bank Nifty.\nPost your opinion here\n", "title": "Top 10 stocks to be watched out for today", "link": "http://www.moneycontrol.com/news/stocksviews/top-10-stocks-to-be-watched-out-for-today-_1066378.html", "time": "9.01 am "}, {"date": " 08 Apr 2014", "content": "Apr 09, 2014, 08.36 AM  | Source: PTI\nSuzlon signs Euro 850 mn loan pact with consortium of banks\n\"Suzlon Group's German subsidiary Senvion SE signed an agreement for a loan of Euro 850 million (over Rs 7,000 crore) with consortium of banks for a three year period,\" the Suzlon said in a statement.\nLike this story, share it with millions of investors on M3\nSuzlon signs Euro 850 mn loan pact with consortium of banks\n\"Suzlon Group's German subsidiary Senvion SE signed an agreement for a loan of Euro 850 million (over Rs 7,000 crore) with consortium of banks for a three year period,\" the Suzlon said in a statement.\nPost your opinion here\n \nWind turbine maker Suzlon Group has signed an loan agreement worth Euro 850 million with a consortium of banks for funding its working capital requirements and expansion plans.\n\"Suzlon Group's German subsidiary Senvion SE signed an agreement for a loan of Euro 850 million (over Rs 7,000 crore) with consortium of banks for a three year period,\" the Suzlon said in a statement.\nSenvion SE is a wind energy turbine manufacturer. The mandated lead arrangers for this financing are -- BayernLB, Commerzbank Aktiengesellschaft, Deutsche Bank AG, BNP Paribas Fortis SA/NV, HSBC Trinkaus & Burkhardt AG and Royal Bank of Canada.\n\"This enhanced facility with long tenure is of importance for the growth of the company and the oversubscription of the same with new additions to the consortium clearly reflects strong confidence of global banks in business fundamentals of the company,\" Marcus A Wassenberg, CFO of Senvion said.\nAlso Read: Suzlon likely to take over US based Edison Mission\nSuzlon Energy stock price\nOn December 18, 2015, at  12:18 hrs Suzlon Energy was quoting at Rs 21.40, up Rs 0.25, or 1.18 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.59.\n", "title": "Suzlon signs Euro 850 mn loan pact with consortium of banks", "link": "http://www.moneycontrol.com/news/business/suzlon-signs-euro-850-mn-loan-pactconsortiumbanks_1066022.html", "time": "1.45 pm "}, {"date": " 02 Apr 2014", "content": "Apr 02, 2014, 10.04 AM  | Source: Moneycontrol.com\nSuzlon Group successfully acquires Big Sky wind park from Edison Mission Energy\nSuzlon Group today announced via their fully owned US based subsidiary SWECO that they have successfully acquired Big Sky wind park from Edison Mission Energy.\nLike this story, share it with millions of investors on M3\nSuzlon Group successfully acquires Big Sky wind park from Edison Mission Energy\nSuzlon Group today announced via their fully owned US based subsidiary SWECO that they have successfully acquired Big Sky wind park from Edison Mission Energy.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding a Press Release dated April 02, 2014 titled \"Suzlon Group successfully acquires Big Sky wind park from Edison Mission Energy\"  Suzlon Group today announced via their fully owned US based subsidiary SWECO that they have successfully acquired Big Sky wind park from Edison Mission Energy.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Group successfully acquires Big Sky wind park from Edison Mission Energy", "link": "http://www.moneycontrol.com/news/announcements/suzlon-group-successfully-acquires-big-sky-wind-parkedison-mission-energy_1062529.html", "time": "10.04 am "}, {"date": " 31 Mar 2014", "content": "Mar 31, 2014, 02.45 PM  | Source: Moneycontrol.com\nSuzlon Energy clarifies on news item\nSuzlon Energy has clarified on the news item appearing in the newspaper & media titled, Suzlon eyes Rs 10k cr LSE listing for arm.\nLike this story, share it with millions of investors on M3\nSuzlon Energy clarifies on news item\nSuzlon Energy has clarified on the news item appearing in the newspaper & media titled, Suzlon eyes Rs 10k cr LSE listing for arm.\nPost your opinion here\n \nWith reference to the news item appearing in the newspaper & media titled \"Suzlon eyes Rs. 10k cr LSE listing for arm\", Suzlon Energy Ltd has Clarified to BSE as under:1. Suzlon is exploring various options to rebalance its capital structure and accordingly we would relook at our capital structure during the next financial year (FY 2014-15).With reference to the media reports, it remains our policy to not to comment on what is market rumour and speculation.2. As regard news item, \"Suzlon to acquire US based company”, we wish to clarify that Suzlon is merely buying a US based SPV company (‘Big Sky’) owning certain assets which were sold by Suzlon to Big Sky, and which were partially financed by Suzlon through a loan and which is now in default. A formal announcement in this regard will be made shortly.We wish to reiterate that the Company and its management remain committed to the highest standards of Corporate governance, and will communicate to the stock exchanges on developments as they happen.\"Source : BSE\n", "title": "Suzlon Energy clarifies on news item", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-clarifiesnews-item_1061234.html", "time": "2.45 pm "}, {"date": " 26 Feb 2014", "content": "Feb 26, 2014, 03.20 PM  | Source: PTI\nSuzlon seeks shareholders' nod for Rs 3-cr pay to Tanti\nSuzlon is seeking approval to re-appoint Tanti as managing director for a period of three years starting from April 1, 2014.\nLike this story, share it with millions of investors on M3\nSuzlon seeks shareholders nod for Rs 3-cr pay to Tanti\nSuzlon is seeking approval to re-appoint Tanti as managing director for a period of three years starting from April 1, 2014.\nPost your opinion here\n \nWind turbine maker Suzlon Energy  will seek shareholders’ approval for re-appointment of Tulsi Tanti as managing director of the company with an annual salary of Rs 3 crore.\nThe company would also seek nod for preferential issue of shares certain entities and promoters.\nThese are among the resolutions for which Suzlon would seek shareholders’ green signal through a postal ballot.\nSuzlon is seeking approval to re-appoint Tanti as managing director for a period of three years starting from April 1, 2014.\nBesides an annual salary of Rs 3 crore, Tanti would also be eligible for various “perquisites” including medical benefits for self and family, according to the postal ballot notice.\nFurther, the firm would seek approval from shareholders to increase its borrowing limit to Rs 20,000 crore from Rs 10,000 crore.\nAnother resolution is for authorising Suzlon board to “create a charge in whatsoever manner on the company’s current assets, present and future, in favour of banks, financial institutions, bodies corporate, other entities, person or persons who may provide such credit facilities to the company”.\nSuzlon reported a consolidated net loss of Rs 1,075.25 crore in the latest December quarter. In the year-ago period, the same was at Rs 1,154.53 crore. These figures are after share in associate’s profit and minority interest.\nIn the third quarter of current fiscal (2013 December quarter), the wind turbine maker raked in total income of Rs 5,052.20 crore compared to Rs 4,047.71 crore in the same period a year ago.\nAt the end of December quarter, the group’s order book stood at 5.5 GW (gigawatts), translating to around Rs 47,393 crore (or USD 7.7 billion) in value.\nSuzlon Energy stock price\nOn December 18, 2015, at  12:19 hrs Suzlon Energy was quoting at Rs 21.35, up Rs 0.20, or 0.95 percent. The 52-week high of the share was Rs 31.35 and the 52-week low was Rs 12.52.\nThe latest book value of the company is Rs -2.82 per share. At current value, the price-to-book value of the company was -7.57.\n", "title": "Suzlon seeks shareholders' nod for Rs 3-cr pay to Tanti", "link": "http://www.moneycontrol.com/news/business/suzlon-seeks-shareholders-nod-for-rs-3-cr-pay-to-tanti_1048244.html", "time": "9.11 am "}, {"date": " 15 Feb 2014", "content": "Feb 15, 2014, 01.37 AM  | Source: Moneycontrol.com\nSuzlon Energy: Outcome of board meeting\nSuzlon Energy has informed regarding Outcome of Board Meeting held on February 14, 2014.\nLike this story, share it with millions of investors on M3\nSuzlon Energy: Outcome of board meeting\nSuzlon Energy has informed regarding Outcome of Board Meeting held on February 14, 2014.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE regarding Outcome of Board Meeting held on February 14, 2014.Source : BSE\nTo read the full report click here\nSet email alert for\n", "title": "Suzlon Energy: Outcome of board meeting", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energy-outcomeboard-meeting_1043632.html", "time": "1.37 am "}, {"date": " 14 Feb 2014", "content": "Feb 14, 2014, 09.47 PM  | Source: PTI\nSuzlon Q3 net losses narrow to Rs 1075cr; sales up\n\"We are reporting losses mainly due to lower sales, adverse impact of foreign currency fluctuation and the restructuring cost that comes in the Ebitda. But our sales have improved on year-on-year basis,\" Suzlon Group finance head Kirti Vagadia said.\nLike this story, share it with millions of investors on M3\nSuzlon Q3 net losses narrow to Rs 1075cr; sales up\n\"We are reporting losses mainly due to lower sales, adverse impact of foreign currency fluctuation and the restructuring cost that comes in the Ebitda. But our sales have improved on year-on-year basis,\" Suzlon Group finance head Kirti Vagadia said.\nPost your opinion here\n \nLeading wind turbine maker  Suzlon today said it narrowed net losses on a consolidated basis in the quarter to December to Rs 1,075.25 crore from Rs 1,154.53 crore a year ago on better project execution. The Pune-based company's total income during the third quarter ended December 31 increased to Rs 5,052.2 crore from Rs 4,047.71 crore a year-ago.\n\"We are reporting losses mainly due to lower sales, adverse impact of foreign currency fluctuation and the restructuring cost that comes in the Ebitda. But our sales have improved on year-on-year basis,\" Suzlon Group finance head Kirti Vagadia said. Total expenses increased to Rs 5,375.33 crore from Rs 4,563.47 crore. Of this, forex loss was Rs 91.48 crore compared to Rs 46.99 crore a year ago.\nCommenting on the results, company Chairman Tulsi Tanti said, \"while we have made important progress on some fronts, this has been a disappointing quarter in terms of operating performance and there remains much work to be done.\" Tanti said the company has strategically positioned its business to take advantage of new opportunities.\nMeanwhile, Suzlon has embarked on re-organising domestic operations and hiving off maintenance services vertical into a separate company. \"The step will help build on our long track record of providing best-in-class service, value-added services and focus on customer excellence besides responding to new growth opportunities in this space,\" Vagadia said. During the quarter, the company received 913 mw of new orders. \"This gives us good visibility into the near and medium term,\" he said. On plans of selling non-core assets, Vagadia said, \"we are progressing on that front, but the movement is slow mainly due to adverse (economic) environment.\"\n", "title": "Suzlon Q3 net losses narrow to Rs 1075cr; sales up", "link": "http://www.moneycontrol.com/news/results/suzlon-q3-net-losses-narrow-to-rs-1075cr-sales-up_1043558.html", "time": "9.39 pm "}, {"date": " 05 Feb 2014", "content": "Feb 05, 2014, 03.42 PM  | Source: Moneycontrol.com\nSuzlon Energy's Q3 results on Feb 14, 2014\nSuzlon Energy\u0092s board meeting will be held on February 14, 2014 to approve the unaudited Financial Results of the Company for the quarter ended on December 31, 2013.\nLike this story, share it with millions of investors on M3\nSuzlon Energys Q3 results on Feb 14, 2014\nSuzlon Energy\u0092s board meeting will be held on February 14, 2014 to approve the unaudited Financial Results of the Company for the quarter ended on December 31, 2013.\nPost your opinion here\n \nSuzlon Energy Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on February 14, 2014 to approve the unaudited Financial Results of the Company for the quarter ended on December 31, 2013.Further, as per Companyâ\u0080\u0099s Code of Conduct for Prevention of Insider Trading (COCPIT) as required to be implemented in terms of Regulation 12 of the Securities and Exchange Board of India (Prohibition of Insider Trading) Regulations, 1992, the Trading Window of the Company has been closed from February 04, 2014 till February 15, 2014 (both days inclusive) for the purpose of declaration of the unaudited Financial Results of the Company.Source : BSE\n", "title": "Suzlon Energy's Q3 results on Feb 14, 2014", "link": "http://www.moneycontrol.com/news/announcements/suzlon-energys-q3-resultsfeb-14-2014_1038209.html", "time": "3.42 pm "}, {"date": " 05 Feb 2014", "content": "Feb 05, 2014, 08.59 AM  | Source: CNBC-TV18\nBull's Eye: Buy YES Bank, Arvind, Adani Ports, UPL\nPrakash Diwan of Altamount Capital Management advises going long in Suzlon Energy for a target price fo Rs 11.90 and Bharat Forge for a target price of Rs 349.\nLike this story, share it with millions of investors on M3\nBulls Eye: Buy YES Bank, Arvind, Adani Ports, UPL\nPrakash Diwan of Altamount Capital Management advises going long in Suzlon Energy for a target price fo Rs 11.90 and Bharat Forge for a target price of Rs 349.\nPost your opinion here\nBull's Eye\nBull's Eye, CNBC-TV18's popular game show, where market experts come together to dish out trading strategies for you to make your week more exciting and compete with each other to see whose portfolio is the strongest.\nThis week Manav Chopra of Nirmal Bang, Dharmesh Kant of Indianivesh Securities and Prakash Diwan of Altamount Capital Management battle it out for top honours.\nManav Chopra of Nirmal Bang\nBuy  CESC with a stoploss at Rs 438 and for a target price of Rs 480\nBuy  Jain Irrigation with a stoploss at Rs 62 and for a target price of Rs 68\nBuy  Unitech with a stoploss at Rs 12.2 and for a target price of Rs 14\nBuy  YES Bank with a stoploss at Rs 297 and for a target price of Rs 315\nDisclaimer: He does not hold stocks discussed but may have recommended them to clients.\nDharmesh Kant of Indianivesh Securities\nBuy  UPL for a target price of Rs 210 and keep a stoploss at Rs 180\nBuy  Arvind for a target price of Rs 156 and keep a stoplos at Rs 144\nBuy  Union Bank of India for a target price of Rs 120 and keep a stoploss at Rs 102\nBuy  Bata India for a target price of Rs 1,050 and keep a stoploss at Rs 950\nDisclaimer: He does not hold stocks discussed but may have recommended them to clients.\nPrakash Diwan of Altamount Capital Management\nGo long in  Suzlon Energy for a target price fo Rs 11.90 and keep a stoploss at Rs 11.10\nGo long in  Bharat Forge for a target price of Rs 349 and keep a stoploss at Rs 329\nGo long in  Phoenix Lamps for a target price of Rs 117.50 and keep a stoploss at Rs 111.50\nGo long in  Adani Ports for a target price of Rs 153 and keep a stoploss at Rs 143\nDisclaimer: He does not hold stocks discussed but may have recommended them to clients.\n", "title": "Bull's Eye: Buy YES Bank, Arvind, Adani Ports, UPL", "link": "http://www.moneycontrol.com/news/stocksviews/bulls-eye-buy-yes-bank-arvind-adani-ports-upl_1037911.html", "time": "8.59 am "}], [], [], [], [], []]